{"data":{"wordpressPost":{"title":"Modern covers","content":"<p>\n Last night I came across yet another song that I thought was awesome, but turned out to be a cover of an 80&#39;s electropop or synthpop or electronica or whatever the genre song. Really, too many way too similar genres in the 80&#39;s, bloody annoying. Anyhoo &#8230;\n</p>\n<p>\n What strikes me as odd is that all covers I find are better than their electropop originals, which is vastly different to modern covers of 80&#39;s rock music that are usually much worse and simply not as good in any way. Usually modern rock covers lack a certain emotion behind them, while the old electropop music seems to lack the emotion behind the modern interpretations.\n</p>\n<p>\n Take <a href=\"http://youtube.com/watch?v=OufZbzsUtIo\" target=\"_blank\">Eurhythmics&#39; Sweet Dreams</a>, sure cool song, nice to listen, but utterly annoying in the way it&#39;s done. Now take <a href=\"http://youtube.com/watch?v=3iuve2OjY_8\" target=\"_blank\">Marylin Manson&#39;s cover</a> of the same song and you will notice it has much more feeling behind it, sounds better and just feels much more suited to the lyrics. <a href=\"http://youtube.com/watch?v=4NAPw8N5vM8\" target=\"_blank\">Fear for Tears&#39; Mad World</a> is a similar example, the original doesn&#39;t seem to fit the depressing lyrics at all and is very silly in its appearance, while the <a href=\"http://youtube.com/watch?v=v52Igdotisk\" target=\"_blank\">Michael Andrews/Gary Jules version</a> is perfectly suited for the lyrics, slow depressing and awesome sounding.\n</p>\n<p>\n The most interesting difference I see is that the modern version as a rule have a slower tempo, deeper, more sensual voice and simpler music, much simpler. Is it just the times that change so much, the overall preferences in people&#39;s taste or is it just that 80&#39;s synthpop simply wasn&#39;t good music?</p>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"1c0ab1f9-6b16-5778-8a97-4dbab119a81e"}}