{"data":{"wordpressPost":{"title":"The carnival the carnival","content":"<p>\nWent to the carnival yesterday and let me just tell you straight off that it &#8230; was &#8230; AWESOME! Sure I spent shitloads of money and yes I didn&#39;t win anything worth my money, but who the hell cares, it was fun.\n</p>\n<p>\nGoing to the carnival one must understand that they&#39;re not going there to win stuff, it&#39;s actually more along the lines of paying for the ability to play a fun game and the thrill of hoping to win something awesome like a giant fluffy toy. You must also understand that all the games are rigged so that it&#39;s nearly impossible to beat them unless your aim is dead perfect or you&#39;ve had thousands of plays of practice, which, unless you&#39;re somewhat insane, you haven&#39;t.\n</p>\n<p>\nThere&#39;s only one thing that&#39;s dead simple to beat &#8211; the duck catch. There&#39;s plastic duckies floating in some water and you fetch them out with a long stick. Unless you&#39;re a fumbling idiot you should be able to get all seven or whatever the deal is. However this is <em>not</em> where the best prizes are. Another beatable thing is the bow and arrow challenge where you have to pop four water balloons that are, obviously, not fully inflated. This one sounds tricky, but it isn&#39;t because bows aren&#39;t <em>that</em> hard to shoot, especially not from the distance of two meters &#8230; hell even <strong>I</strong> could do it, but the girlfriend didn&#39;t allow it because she considers me a fumbling idiot. This is also <em>not</em> where the best prizes are, but they <em>are</em> better than the duck pond.\n</p>\n<p>\nThe funnest of all the activities was the Booster, a long pole-like thing with  seats on each end that spins and spins and the seats, of course, also turn around an axis. The sum result is being flown up in the sky to the height of about twelve meters then being plunged back down to earth &#8230; I felt like superman, honestly. The whole ride elicited bouts of laughter from me and screams of sheer terror from the girlfriend.\n</p>\n<p>\nHell, the fact that she was so scared made the whole ride even better!</p>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"3e91d04f-cb9a-5e3d-a2b6-ab1149e9ce72"}}