{"data":{"wordpressPost":{"title":"Best coding headphones: Bose QuietComfort 35","content":"<p><iframe src=\"https://www.youtube.com/embed/IGHjijemjgQ\" width=\"853\" height=\"480\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"></iframe></p>\n<p>When looking for coding headphones, I care about two things:</p>\n<ol>\n<li>I want to feel like I am alone in the universe and no other humans exist</li>\n<li>Comfortable enough to wear all day</li>\n</ol>\n<p>I judge comfort both on how headphones feel on my ears/face and whether I have to keep them so loud that my ears hurt after a while.</p>\n<p>So far my answer has been a pair of Beats Studio. They worked great, made me feel alone in the universe, and were comfortable enough to wear all day. The cable was annoying but okay. It became super annoying after <a href=\"https://swizec.com/blog/first-day-new-2017-macbook-pro/swizec/7643\">Apple moved their headphone port to the right.</a></p>\n<p>After about 2 years of constant use, my Beats kicked the can.</p>\n<blockquote class=\"twitter-tweet\" data-lang=\"en\">\n<p dir=\"ltr\" lang=\"en\">Confirmed. After about 2.5 years of everyday all day use, my Beats are on their way out. 😭</p>\n<p>And I can&#8217;t solder like <a href=\"https://twitter.com/m1hah\">@m1hah</a> suggested. <a href=\"https://t.co/lMRelLNbsd\">pic.twitter.com/lMRelLNbsd</a></p>\n<p>— Swizec (@Swizec) <a href=\"https://twitter.com/Swizec/status/885974627180175360\">July 14, 2017</a></p></blockquote>\n<p><script async src=\"//platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></p>\n<p>Looking for a replacement, everyone suggested <a href=\"https://www.amazon.com/gp/product/B01E3SNO1G/ref=as_li_tl?ie=UTF8&amp;camp=1789&amp;creative=9325&amp;creativeASIN=B01E3SNO1G&amp;linkCode=as2&amp;tag=ageewitahat-20&amp;linkId=e2da7ce562847b54253ae445a5afa79b\">Bose QuietComfort 35</a>. And hot damn were they right! These things are amazing.</p>\n<p>You put them on and the world disappears. You are alone. Think your thinks, code your code. Open office no more. Coworkers don&#8217;t exist. If someone wants your attention they have to get up and come tap you on the shoulder.</p>\n<p>You won&#8217;t know they&#8217;re there and you&#8217;ll do a startle and shit your pants. Worth it.</p>\n<p>I find the padding on the Bose QuietComforts a bit less comfortable than the Beats Studio, but they are a lot lighter. Never realized how heavy my Beats were until I tried these. Bose also packs smaller than Beats which is great. Bulky headphones are a pain in the arse to transport, and at $440 you&#8217;re not gonna have multiple pairs.</p>\n<p><em>You</em> might. Too rich for <em>my</em> blood 😅</p>\n<p>Oh and the QuietComfort sound better than Beats. Yes the Beats has more bass and that makes the sound richer, but Bose sounds more real somehow. You listen to a video or a game and it sounds <em>real</em>. Like it&#8217;s not coming out of headphones at all.</p>\n<p>Sometimes I look around in surprise because I can&#8217;t tell if sounds are in real life or in the video. It&#8217;s great.</p>\n<p>Shout at me on Twitter if you think I&#8217;m wrong.</p>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"502fc0e1-1988-5518-8d44-200d886fd468"}}