{"data":{"wordpressPost":{"title":"How MAFIAA killed itself and why Goth is undead","content":"<div class=\"zemanta-img\" style=\"display: block; width: 310px; margin: 1em; float: right;\">\n<div>\n<dl class=\"wp-caption alignright\" style=\"width: 310px;\">\n<dt class=\"wp-caption-dt\"><a href=\"http://commons.wikipedia.org/wiki/Image:Bauhaus_concert.jpg\"><img title=\"Photo of Bauhaus in concert at the Brixton Aca...\" src=\"http://upload.wikimedia.org/wikipedia/commons/thumb/b/b1/Bauhaus_concert.jpg/300px-Bauhaus_concert.jpg\" alt=\"Photo of Bauhaus in concert at the Brixton Aca...\" width=\"300\" height=\"214\" /></a></dt>\n<dd class=\"wp-caption-dd zemanta-img-attribution\" style=\"font-size: 0.8em;\">Image via <a href=\"http://commons.wikipedia.org/wiki/Image:Bauhaus_concert.jpg\">Wikipedia</a></dd>\n</dl>\n</div>\n</div>\n<p>When I was about thirteen years of age I discovered music &#8211; you know, real music, outside of what you see on television, hear on the radio and pick up from your parents. It was at that age that I discovered metal was pretty cool, transitioned my clothing to black and essentially discovered that music comes in albums that can be either bought for extortionate moneys or downloaded for free (audiogalaxy.com was The Thing back then)</p>\n<p>A bit later in life I realised metal was actually rather dull and became more and more <a class=\"zem_slink\" title=\"Goth subculture\" rel=\"wikipedia\" href=\"http://en.wikipedia.org/wiki/Goth_subculture\">goth</a>. It could be argued that metal was the gateway music for me, was just different enough not to be <a class=\"zem_slink\" title=\"Pop music\" rel=\"wikipedia\" href=\"http://en.wikipedia.org/wiki/Pop_music\">pop</a>, but not exactly high quality (sorry to all <a class=\"zem_slink\" title=\"Metalhead\" rel=\"wikipedia\" href=\"http://en.wikipedia.org/wiki/Metalhead\">metalheads</a>, but most of it is just extremely dull). As I became goth I was trapped because once you&#8217;re goth, you can&#8217;t actually stop being goth.  It&#8217;s a very virulent subculture in that sense.</p>\n<p>At first you&#8217;re a noob goth who wears too many spikes and tends to be different, just like everyone else. Then as a goth grows older they realise all the spikes and makeup are somewhat silly. Even later they realise leather boots and similar don&#8217;t quite work out in the summer. Perhaps at some point they might even discover that colours other than black can be worn &#8211; revelation! HOWEVER! None of this will prevent a person from being goth. Even outwardly proclaiming yourself not to be goth &#8230; will make you even more goth. I don&#8217;t pretend to actually understand how or why this works, but simply put &#8211; the less goth you think of yourself, the more goth you are.</p>\n<p>This brings us back to the MAFIAA topic. Notice how at thirteen I discovered music and albums? This was because back then the MAFIAA already invented The Single, but it was promotional material, it basically said <em>&#8220;Look, we made a cool song, we have others&#8221;</em> the video served the same purpose.  These days my sister is fourteen. She has yet to discover music. The only music she ever listens to is music television (not just <a class=\"zem_slink\" title=\"MTV\" rel=\"wikipedia\" href=\"http://en.wikipedia.org/wiki/MTV\">MTV</a>) and whatever her friends bluetooth to her phone. Of course her friends, also, haven&#8217;t really discovered music and so only singles get passed around.</p>\n<div class=\"zemanta-img\" style=\"display: block; width: 310px; margin: 1em; float: left;\">\n<div>\n<dl class=\"wp-caption alignright\" style=\"width: 310px;\">\n<dt class=\"wp-caption-dt\"><a href=\"http://en.wikipedia.org/wiki/Image:WKAP_Amazon_cover.jpg\"><img title=\"Digital Only &quot;Special Edition&quot;\" src=\"http://upload.wikimedia.org/wikipedia/en/thumb/0/0d/WKAP_Amazon_cover.jpg/300px-WKAP_Amazon_cover.jpg\" alt=\"Digital Only &quot;Special Edition&quot;\" width=\"300\" height=\"300\" /></a></dt>\n<dd class=\"wp-caption-dd zemanta-img-attribution\" style=\"font-size: 0.8em;\">Image via <a href=\"http://en.wikipedia.org/wiki/Image:WKAP_Amazon_cover.jpg\">Wikipedia</a></dd>\n</dl>\n</div>\n</div>\n<p>This is in large part a fuck up by the MAFIAA. At some point they became so obsessed with promotion that nearly half the songs on an album are released as singles. Everything can be bought and downloaded as a single music file &#8211; which may or may not magically stop working.</p>\n<p>No wonder people aren&#8217;t buying albums anymore you stupid gits, it&#8217;s because you never talk about albums anymore! You just keep promoting <em>songs</em>.</p>\n<p>I don&#8217;t know, maybe I&#8217;m just growing out of touch with the common teenager, but I used to cherish the idea of a <a class=\"zem_slink\" title=\"Album\" rel=\"wikipedia\" href=\"http://en.wikipedia.org/wiki/Album\">music album</a>. I <em>wanted</em> to see an artist&#8217;s full breadth, not just a song here and there. Of course half the album usually sucked, but that&#8217;s alright, it gave us insight, it helped us <strong>feel</strong> the music and the artist&#8217;s soul.</p>\n<p>Today &#8230; today music feels more like a glorified <a class=\"zem_slink\" title=\"Special effect\" rel=\"wikipedia\" href=\"http://en.wikipedia.org/wiki/Special_effect\">special effects</a> fuckfest.  And it&#8217;s all the MAFIAA&#8217;s fault. It&#8217;s people like them that forced Amanda Palmer to abandon her music record so as to be able to actually create music. Surprising fact &#8211; she&#8217;s even more successful after having abandoned them and sells more of </p>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"e39e936b-1989-5996-b47e-db1e7400cc28"}}