{"data":{"wordpressPost":{"title":"What Richard Feynman taught me about joy","content":"<p><center><a href=\"https://www.amazon.com/Surely-Feynman-Adventures-Curious-Character/dp/0393316041/ref=as_li_ss_il?ie=UTF8&amp;linkCode=li3&amp;tag=ageewitahat-20&amp;linkId=a839c1f710af9c51c52bb3f2e405571c\"><img src=\"https://images-na.ssl-images-amazon.com/images/I/519fWd56vTL._SL250_.jpg\" /></a></center></p>\n<p><em>Surely You&#8217;re Joking, Mr. Feynman</em> is magnificent. A biography in spirit, reads like a series of anecdotes from the life of a great man. Adapted from taped conversations with a friend, apparently.</p>\n<p>The paperback has been collecting dust, unopened, on my bookshelf for many years now. 😅</p>\n<p>But the audiobook! The audiobook was perfect.</p>\n<p>Captures the spirit of how Feynman speaks perfectly. He has this distinct way of talking that you can recognize from a mile away.</p>\n<p>Here he is talking about why you can&#8217;t answer <em>why</em> questions 👇</p>\n<p><iframe width=\"580\" height=\"435\" src=\"https://www.youtube.com/embed/MO0r930Sn_8?feature=oembed\" frameborder=\"0\" allow=\"autoplay; encrypted-media\" allowfullscreen></iframe></p>\n<p>Alas, Feynman didn&#8217;t narrate the audiobook. It&#8217;s the only thing that could possibly make it better. I found myself avoiding pressing play on shorter runs just so I could savor the book and drag it out over many more weeks.</p>\n<p>I kinda wish it was longer &#8230;</p>\n<h2>Feynman in a nutshell</h2>\n<img src=\"https://upload.wikimedia.org/wikipedia/commons/thumb/e/eb/Richard_Feynman_Los_Alamos_ID_badge.jpg/440px-Richard_Feynman_Los_Alamos_ID_badge.jpg\" alt=\"Richard Feynman's Los Alamos ID pic\" />\n<p>Feynman, if you don&#8217;t know him yet, is the prototypical intellectual merry prankster.</p>\n<p>A brilliant professor of physics who played bongo drums, delivered mind-blowing lectures, and always found some way or another to play a practical joke.</p>\n<p>He got a Nobel Prize for something or another with the spin of electrons. Worked on the <a href=\"https://en.wikipedia.org/wiki/Manhattan_Project\">Manhattan Project</a> barely out of college, and invented those subatomic particle diagrams you&#8217;ve probably seen before.</p>\n<img src=\"https://swizec.com/blog/wp-content/uploads/2018/07/Feynmann_Diagram_Gluon_Radiation.svg_-1024x654.png\" alt=\"\" class=\"alignnone size-large wp-image-8509\" srcset=\"https://swizec.com/blog/wp-content/uploads/2018/07/Feynmann_Diagram_Gluon_Radiation.svg_-1024x654.png 1024w, https://swizec.com/blog/wp-content/uploads/2018/07/Feynmann_Diagram_Gluon_Radiation.svg_-300x192.png 300w, https://swizec.com/blog/wp-content/uploads/2018/07/Feynmann_Diagram_Gluon_Radiation.svg_-768x490.png 768w, https://swizec.com/blog/wp-content/uploads/2018/07/Feynmann_Diagram_Gluon_Radiation.svg_.png 1200w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" />\n<p>Feynman&#8217;s interaction with <a href=\"https://en.wikipedia.org/wiki/Niels_Bohr\">Niels Bohr</a> describes him best, I think:</p>\n<blockquote><p>\nHe was sought out by physicist Niels Bohr for one-on-one discussions. He later discovered the reason: most of the other physicists were too much in awe of Bohr to argue with him. Feynman had no such inhibitions, vigorously pointing out anything he considered to be flawed in Bohr&#8217;s thinking. He said he felt as much respect for Bohr as anyone else, but once anyone got him talking about physics, he would become so focused he forgot about social niceties. Perhaps because of this, Bohr never warmed to Feynman.\n</p></blockquote>\n<h2>What Feynman taught me about joy</h2>\n<p>So the book was great, and I enjoyed listening to it. But what did I learn?</p>\n<p>What struck me most is how Feynman was able to weave pure joy into his life and everything he did. Little pranks, inside jokes, stuff he found funny while others didn&#8217;t and that didn&#8217;t matter at all.</p>\n<p>Like how he felt burned out on physics and the immense pressure bestowed upon him by Cornell. Free reign, we know you&#8217;re smart Mr. Feynman, famous practically, you&#8217;ll be the best for us!</p>\n<p>So he turned his mind to pointless things and having fun with physics and playing around. Returning back to what gave him joy when he first became a physicist.</p>\n<p>And that led to a Nobel Prize.</p>\n<p>Or how he found Los Alamos boring because there was no fun to be had. Sure, they were inventing the nuclear bomb, and the war was going, and the faster they could make the bomb, the sooner the war would end.</p>\n<p>And yet, he found time to learn safe cracking and steal everyone&#8217;s documents. Instead of asking for reports, he would casually bring them back, and when someone protested that they were in a locked safe, he&#8217;d say, <em>&#8220;Yeah, the safe&#8217;s no good. I’ve been telling you.”</em></p>\n<p>Or there&#8217;s the story of how he became a professional musician because a ballet composer wanted to try writing a ballet with just percussion and she saw him play bongos in a school play. They went all the way to Paris with that one before he was discovered to be a fraud and a real musician said, <em>&#8220;Wait no, this isn&#8217;t right.”</em></p>\n<p>Fun guy.</p>\n<p>I need to do more of that. Stuff that&#8217;s just for fun, not serious at all.</p>\n<p><em>Surely You&#8217;re Joking, Mr. Feynman</em> is fundamentally a book with a single lesson: Don&#8217;t take yourself so seriously. Just because your work is serious doesn&#8217;t mean you have to be.</p>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"e5ff2ac6-f5d6-5836-86b8-73c85bc6058e"}}