{"data":{"wordpressPost":{"title":"Livecoding #28: Productizing the door-answering Slack bot, Part 1","content":"<p><em>This is a Livecoding Recap – an almost-weekly post about interesting things discovered while livecoding ?. Always under 500 words and with pictures. You can follow my channel, <a href=\"https://livecoding.tv/swizec\">here</a>. New streams almost <strong>every Sunday at 2pm PDT</strong>. There’s live chat, come say hai ?</em></p>\n<p><iframe src=\"https://www.livecoding.tv/swizec/videos/pyXGG/embed\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"true\" scrolling=\"no\"></iframe></p>\n<p>Today was all about winning a bet.</p>\n<p>On Wednesday, the founder walked up to my desk and said: <em>&quot;If you don&#39;t get that Slack bot set up, we&#39;re routing the buzzer phone number to your phone. I&#39;m not joking.&quot;</em></p>\n<p>Well, the joke&#39;s on him. OpenMyDoor is ready for a real world test! ?? Weight off my chest. too. I hate phones.</p>\n<p>But first, some background. He was talking about <a href=\"https://swizec.com/blog/make-slack-twilio-talk/swizec/7128\">the Twilio+Slack bot</a> I <a href=\"https://swizec.com/blog/livecoding-22-a-door-answering-slackbot/swizec/7038\">started building</a>, and <a href=\"https://swizec.com/blog/livecoding-23-slackbots-oauth/swizec/7065\">almost finished</a> in September. I had a working prototype running on my localhost some time in October.</p>\n<p>When I showed it to the coworker who&#39;s currently stuck answering the door, she loved it. Super excited. She&#39;s been giving me glares for the past 2 months. <em>&quot;Where is my fucking bot!?&quot;</em> the glares ask.</p>\n<p>Then I hide under the couch and mumble something about how short nights and weekends are.</p>\n<p>Founder dude put his foot down, and here we are. Bot is ready 4 days later. ?</p>\n<p>In my defense, I <em>meant</em> to do it this whole time, but I was busy putting together the <a href=\"http://www.reactindiebundle.com\">React Indie Bundle</a>.</p>\n<h2>What we did</h2>\n<img class=\"alignnone size-full wp-image-7266\" src=\"https://swizec.com/blog/wp-content/uploads/2016/12/Screen-Shot-2016-12-05-at-00.44.43.png\" width=\"846\" height=\"344\" srcset=\"https://swizec.com/blog/wp-content/uploads/2016/12/Screen-Shot-2016-12-05-at-00.44.43.png 846w, https://swizec.com/blog/wp-content/uploads/2016/12/Screen-Shot-2016-12-05-at-00.44.43-300x122.png 300w, https://swizec.com/blog/wp-content/uploads/2016/12/Screen-Shot-2016-12-05-at-00.44.43-768x312.png 768w\" sizes=\"(max-width: 846px) 100vw, 846px\" />\n<p>Here&#39;s what we did to win the bet:</p>\n<ul>\n<li>put bot on Heroku as <a href=\"https://openmydoor.herokuapp.com/\">openmydoor.herokuapp.com</a></li>\n<li>made initiating the OAuth flow easier</li>\n<li>made API keys and tokens configurable</li>\n</ul>\n<p>That&#39;s right. You can&#39;t steal my auth anymore. You may have seen the exact tokens in the video, but I can regenerate and configure them easily. Ha!</p>\n<p>I should do that…</p>\n<p>The caveat is that it&#39;s still set up to only work with one Slack team at a time. Once you change the config, the bot is theirs.</p>\n<p>At least it&#39;s independent of my laptop now ?</p>\n<p>To make OpenMyDoor <em>actually</em> useful, I have to add a database. Something simple to keep track of which OAuth token belongs to which phone number and Slack channel. Then we&#39;ll be able to route Twilio calls to correct teams.</p>\n<p>We&#39;ll do that next week on Saturday instead of Sunday because I&#39;m having some sort of Christmas party on Sunday.</p>\n<p>See you next week. I have the perfect user onboarding flow in mind.</p>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"5f5c762f-4aa1-5b7a-bd71-b57f34c48fa6"}}