{"data":{"wordpressPost":{"title":"Bernoulli&#8217;s trials can tell you how many job applications to send","content":"<p>A reader wrote to me bemoaning the difficulty of getting a job these days. She had read <a href=\"https://swizec.com/blog/the-most-pleasant-job-interview-i-have-ever-had/swizec/6121\">my old article about interviewing at Shopify</a> and thought something like <em>&#8220;Damn that sounds so easy! Why is it so hard now?&#8221;</em></p>\n<blockquote><p>I miss the days when getting a job didn’t mean jumping through rings of fire, not that I actually remember them, but I’ve heard stories!<br />\n~ Miss Anastacia</p></blockquote>\n<p>I don&#8217;t think it&#8217;s gotten any harder or easier than it used to be. Think of it as a game of probabilities.</p>\n<p>Let&#8217;s assume that a successful job application is a conversion funnel. Just like a funnel in sales, or marketing, or product signups. They&#8217;re all similar in that you have a series of steps that produce one of two outcomes: Yes or No.</p>\n<p>In job applications you get an offer, or you don&#8217;t. In sales, you make the sale, or not. In marketing, someone tries your app, or they don&#8217;t. In product signups, they become a user, or not. When applying for conference talks, you get in, or you don&#8217;t.</p>\n<p>This observation of a Yes or No result is important. It means we can model the probability of success after repeat attempts using <a href=\"https://en.wikipedia.org/wiki/Bernoulli_trial\">Bernoulli&#8217;s trials</a>.</p>\n<blockquote><p>In the theory of probability and statistics, a Bernoulli trial (or binomial trial) is a random experiment with exactly two possible outcomes, &#8220;success&#8221; and &#8220;failure&#8221;, in which the probability of success is the same every time the experiment is conducted. It is named after Jacob Bernoulli, a 17th century Swiss mathematician.</p></blockquote>\n<p>Those assumptions are not strictly true for us. You don&#8217;t have the same probability of landing every job you apply for, some people are easier to sell to, some marketing campaigns are just better, and not all conferences have the same rejection rates.</p>\n<p>All of that is true. Life is fuzzy.</p>\n<p>We can rely on the law of <a href=\"https://en.wikipedia.org/wiki/Regression_toward_the_mean\">regression toward the mean</a> to gloss over that imperfection. After enough attempts we should have a clear conversion rate.</p>\n<p>Many people famous for speaking at tech conferences, for example, say that about 1 in 3 applications lands. That gives them a conversion rate of 30%.</p>\n<p>A job applicant with a smashing CV and amazing talent for applying only to jobs they&#8217;re a great match for might have a conversion rate of, say, 50%.</p>\n<p>A fresh graduate using a spray and pray strategy might be closer to a 5% overall conversion rate. First contact to job offer.</p>\n<p>Job applications are often a long funnel and each step on the way has a Yes or No component. Each can be modeled as its own Bernoulli trial.</p>\n<ol>\n<li>First contact. You ping them or their recruiter pings you</li>\n<li>Initial phone call with recruiter person</li>\n<li>First real phone interview</li>\n<li>On-site interview lasting a few hours</li>\n<li>Chatting with offer giver so they can feel you out</li>\n<li>Job offer</li>\n</ol>\n<p>Many people don&#8217;t realize this, but step 5 is where they decide what the offer is going to be. The best negotiator in the company feels you out and decides what to offer so it&#8217;s juuuuust enough for you to say yes, but no more. That would be expensive.</p>\n<p>You often already have a job at this point. A red flag can still mess it up.</p>\n<p>Now let&#8217;s say the probabilities of a Yes in each of those steps go something like this:</p>\n<ol>\n<li>Initial contact: 10%</li>\n<li>Soft phone interview: 80% (recruiters are optimistic, that&#8217;s what pays them)</li>\n<li>Phone interview: 50% (you&#8217;re a good engineer, but companies like to think they&#8217;re tough)</li>\n<li>On-site interviews: 60% (you&#8217;re already here, that&#8217;s good)</li>\n<li>Chat with offer giver: 80% (only red flags will mess it up)</li>\n<li>Job offer</li>\n</ol>\n<p>That gives you an overall conversion rate of <code>0.1*0.8*0.5*0.6*0.8 = 0.02 == 2%</code> which sounds really tough. I see now what Anastacia meant.</p>\n<p>Now if we plug that into the formula for <a href=\"https://www.wolframalpha.com/input/?i=30+trials+p%3D0.02\">Bernoulli trials on WolframAlpha</a> we see that if you apply for 30 jobs, that gives you a 45% chance of landing at least one job. 100 applications increases that chance to 86%.</p>\n<figure><img src=\"https://i.imgur.com/1lvVtEh.png\" alt=\"\" /></figure>\n<p>That sounds discouraging I know, but there are things you can do to improve your chances. You can improve your targeting to increase that first 10% chance. You can blog and go to meetups and build your network and skip that first step.</p>\n<p>When recruiters make the first contant, you have a higher chance. I promise. Conversion rate goes from the above, to something closer to <code>0.8*0.5*0.6*0.8 = 0.19 == 19%</code>.</p>\n<p>That means you have an 87% chance of landing a job after just <a href=\"https://www.wolframalpha.com/input/?i=10+trials+p%3D0.19\">10 Bernoulli trials</a>. Pretty good, no?</p>\n<p>Now of course all these probabilities are made up. They&#8217;re different for every individual. They depend on experience, the companies you apply for, how much money you want.</p>\n<p>I promise that if you&#8217;re a decent engineer and you&#8217;re willing to work for $50k in Silicon Valley, you will have to fight off startup founders with a stick.</p>\n<p>Oh and what about our <em>&#8220;Famous tech conference speaker with 30% conversion rate&#8221;</em> example? <a href=\"https://www.wolframalpha.com/input/?i=7+trials+p%3D0.3\">7 CFP applications gives them a 91%</a> chance of giving a talk.</p>\n<p>And really that just means I&#8217;m a huge baby for having a single CFP rejected and thinking to myself screw conferences this is stupid I&#8217;m never CFPing ever again.</p>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"453b306e-7eea-5cf0-9717-ddc130649078"}}