{"data":{"wordpressPost":{"title":"The Focus app reduced my decision fatigue","content":"<div id=\"attachment_6686\" style=\"width: 610px\" class=\"wp-caption alignnone\"><a href=\"http://swizec.com/blog/wp-content/uploads/2015/05/Screen-Shot-2015-05-07-at-14.14.47.png\"><img class=\"wp-image-6686 size-full\" title=\"Focused, hard work is the real key to success.\" src=\"http://swizec.com/blog/wp-content/uploads/2015/05/Screen-Shot-2015-05-07-at-14.14.47.png\" alt=\"Focused, hard work is the real key to success.\" width=\"600\" height=\"284\" srcset=\"https://swizec.com/blog/wp-content/uploads/2015/05/Screen-Shot-2015-05-07-at-14.14.47.png 600w, https://swizec.com/blog/wp-content/uploads/2015/05/Screen-Shot-2015-05-07-at-14.14.47-300x142.png 300w\" sizes=\"(max-width: 600px) 100vw, 600px\" /></a><p class=\"wp-caption-text\">Focused, hard work is the real key to success.</p></div>\n<p>For the past few months I&#8217;ve been having more and more trouble focusing. Run <code>vagrant up</code>, browse Imgur for 2 minutes. Hit <code>Cmd+R</code>, read Twitter for 3 minutes. Compile assets, scroll up and down Facebook for 1 minute. Finish a pomodoro, read Hacker News for 10 minutes.</p>\n<p>It was bad.</p>\n<p>A normal Pomodoro cycle is supposed to follow 25 minutes of intense focus with 5 minutes of rest. Four times. After 1 hour and 55 minutes of work, you take a longer break. Away from the computer if possible.</p>\n<p>My five minute breaks were always about farting around the internet. The longer breaks I would spend doing chores or more farting around the internet.</p>\n<p>The system has been working great <a href=\"http://swizec.com/blog/living-life-in-25min-increments/swizec/1859\">since I started using it in 2011</a>. But for the last few months &#8230; not so much.</p>\n<p>Interneting during a Pomodoro because <em>&#8220;But it takes so long to load, wah&#8221;</em>. No it doesn&#8217;t, you&#8217;re just an idiot, Swizec. A 30 second load time is rough, but you <em>can</em> wait it out. Yes it feels like a waste of time, yes it&#8217;s annoying, yes having good and fast automated tests would be better. No, you <em>can</em> wait it out.</p>\n<p>Better to wait than to spend five minutes on Imgur every time you have to look at a loading bar for 30 seconds.</p>\n<p>Sure, I still got all my work done. In a reasonable time even. But that shit was not up to <em>my</em> standards.</p>\n<p>Worse still, it was stressing me out because I always felt like I was running out of time, and created a huge mind-drain in terms of decision fatigue.</p>\n<p>I&#8217;m not sure <em>why</em> I was doing this. Maybe I was tired, perhaps I had too much on my mind, or maybe I just didn&#8217;t like what I was working on all that much, probably I was addicted to random rewards</p>\n<p>All of the above.</p>\n<p>But! I have found a solution! The <a href=\"https://heyfocus.com/\">Focus app</a>.</p>\n<p>The Focus app does just what you&#8217;d imagine &#8211; make sure you focus. You turn it on and, poof, focused. At least in theory.</p>\n<p>In practice it just blocks all those addicting websites so you don&#8217;t have to think about it. Blocks Twitter, blocks Facebook, blocks Hacker News, blocks many popular blog platforms.</p>\n<p>Anything you might use to waste time is gone. Turned into an inspirational quote that gently reminds you that you&#8217;re supposed to be working. After 25 minutes, it all comes back.</p>\n<div id=\"attachment_6687\" style=\"width: 610px\" class=\"wp-caption alignnone\"><a href=\"http://swizec.com/blog/wp-content/uploads/2015/05/Screen-Shot-2015-05-15-at-00.12.14.png\"><img class=\"wp-image-6687 size-full\" title=\"Inspiration exists, but it has to find you working.\" src=\"http://swizec.com/blog/wp-content/uploads/2015/05/Screen-Shot-2015-05-15-at-00.12.14.png\" alt=\"Inspiration exists, but it has to find you working.\" width=\"600\" height=\"281\" srcset=\"https://swizec.com/blog/wp-content/uploads/2015/05/Screen-Shot-2015-05-15-at-00.12.14.png 600w, https://swizec.com/blog/wp-content/uploads/2015/05/Screen-Shot-2015-05-15-at-00.12.14-300x141.png 300w\" sizes=\"(max-width: 600px) 100vw, 600px\" /></a><p class=\"wp-caption-text\">Inspiration exists, but it has to find you working.</p></div>\n<p>This ties nicely into Pomodoro. The moment my timer goes <em>bing</em>, my browser starts loading all those tabs that were blocked.</p>\n<p>Magic.</p>\n<p>After a month, I feel much better. I don&#8217;t know if I&#8217;m more creative or more productive, but I do feel less tired. No option to visit addictive websites, no drain on the decision pool. Perfect 🙂</p>\n<p><a href=\"https://www.youtube.com/watch?v=Qby0ed4aVpo\">John Cleese on Creativity</a> gives another take on why this is so important. He explains that to be creative you not only need a distraction-free environment, you need a distraction-free mind.</p>\n<blockquote><p>Now creativity can happen, because play is possible when we are separate from everyday life.</p>\n<p>So, you&#8217;ve arranged to take no calls, you&#8217;ve closed your door, you&#8217;ve sat down somewhere comfortable, take a couple of deep breaths and if you&#8217;re anything like me, after you&#8217;ve pondered some problem that you want to turn into an opportunity for about 90 seconds, you find yourself thinking &#8220;Oh I forgot I&#8217;ve got to call Jim… oh, and I must tell Tina that I need the report</p>\n<p>/../</p>\n<p>Because, as we all know, it&#8217;s easier to do trivial things that are urgent than it is to do important things that are not urgent, like thinking.</p>\n<p>And it&#8217;s also easier to do little things we know we can do, than to start on big things that we&#8217;re not so sure about.</p>\n<p>/../</p>\n<p>So when I say create an oasis of quiet know that when you have, your mind will pretty soon start racing again. But you&#8217;re not going to take that very seriously, you just sit there (for a bit) tolerating the racing and the slight anxiety that comes with that, and after a time your mind will quiet down again.</p></blockquote>\n<p><em>That</em> is what Focus helps you with. It forces you to sit there and tolerate the anxiety while you wait for the mind to quiet down.</p>\n<div style=\"width: 356px\" class=\"wp-caption alignnone\"><img title=\"10% less tweets than the month before\" src=\"https://draftin.com:443/images/29348?token=ZsaYLWrbnX8KLGaPcbv5wSS3BT7eEds0nNBHIIdNjybx15L_YO4ThCgOW_UOehBhq9miREhUu9IIkZ5mUnNjy48\" alt=\"10% less tweets than the month before\" width=\"346\" height=\"268\" /><p class=\"wp-caption-text\">10% less tweets than the month before</p></div>\n<p>Since I started using Focus, I&#8217;ve written 10% less tweets. Well worth the $20 investment.</p>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"28540808-700e-501f-8691-5791d6e7493a"}}