{"data":{"wordpressPost":{"title":"&lt;insert deity&gt; bless opensource","content":"<p>\nThere has been <a href=\"http://swizec.com/index.php/mode=news/id=297\">blabber about opensource</a>  around here before and some <a href=\"http://swizec.com/index.php/mode=news/id=226\">against</a> but what there hasn&#39;t been is an ode and an ode is exactly what opensource needs right now. Because it&#39;s fucking awesome! And why exactly would that be, just why is this opensource thing so very awesome, you might ask. Well stop fussing around and let me tell you a tale, a tale of labour cut to a minimum, a tale of espionage and treasure, and most of all bare-breasted cuties.\n</p>\n<p>\nA few months ago I was told about a project wherein a social network thingy much like facebook would have to be made for students of Europe and their teachers, alright I thought, gave a rough time estimate and forgot about it. Then last week the project, after hassling around with the clients and whatnot the project came back. This time I made another time estimate &#8211; roughly two hundred hours.\n</p>\n<p>\n<em>Whoa</em> everyone thought, the programmer has his work cut out, we can reel the designer in a bit later and we all have very much time left on our hands. Then I did some searching because verily some opensource alternative to me doing all the work was about and I&#39;d merely have to touch it up a bit. What I found was <a href=\"http://elgg.org/\" target=\"_blank\">elgg</a>  &#8230; a totally and absolutely complete social networking thingy that has <em>everything</em> absolutely <strong>everything</strong> we needed either built in or as a freely available plugin.\n</p>\n<p>\nNow you may not fully understand the situation here so let me boil it down for you. The time estimate for my work plumeted from ~200 hours to <strong>~50 hours</strong>!! FIFTY! &#8230; I did in two hours what I thought would take me <em>three weeks</em>! (the left-over 50 hours are for aplying the fancy design). But don&#39;t you dare think I stole anything, I intend to give full credit to the developers of elgg and if we decide a funky plugin is needed for some special feature we come up with I have all intention (and permission from the boss) to give it back to the elgg community.\n</p>\n<p>\nOk so there were no bare-breasted cuties in this story, but what there was was so much more awesome you can&#39;t blame me for skipping the boobies.</p>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"f340c9e2-2430-5175-9d4a-c0ce1e31692c"}}