{"data":{"wordpressPost":{"title":"Livecoding #31: Wherein we learn that datasets are hard and find 2 good papers","content":"<p><em>This is a Livecoding Recap – an almost-weekly post about interesting things discovered while livecoding ?. Always under 500 words and with pictures. You can follow my channel, <a href=\"https://livecoding.tv/swizec\">here</a>. New content almost <strong>every Sunday at 2pm PDT</strong>. There’s live chat, come say hai ?</em></p>\n<p><iframe src=\"https://www.liveedu.tv/swizec/videos/QMMLq/embed\" width=\"560\" height=\"315\" frameborder=\"0\" scrolling=\"no\" allowfullscreen=\"allowfullscreen\"></iframe></p>\n<p>There were things happening this weekend that left me glued to Twitter. Distracted and ineffective, I didn&#8217;t get much done. It shows in the Livecoding session too.</p>\n<blockquote class=\"twitter-tweet\" data-width=\"550\">\n<p lang=\"en\" dir=\"ltr\">I have been distracted and ineffective all day. Weekend really. Shouldn’t even have opened the internet.</p>\n<p>&mdash; Swizec (@Swizec) <a href=\"https://twitter.com/Swizec/status/825902085623341058\">January 30, 2017</a></p></blockquote>\n<p><script async src=\"//platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></p>\n<p>I&#8217;m still deciding whether I want to write about the things that were happening. Maybe I should, maybe I shouldn&#8217;t, maybe I have nothing useful to add. Who knows… ¯\\<em>(ツ)</em>/¯</p>\n<p>Completely coincidentally, I wanted to use the Livecoding session to build an immigration dataviz. Something that would show the positive economic impact of immigration, and not just This Is How Many People Came. Numbers are more interesting when coupled with impact.</p>\n<p>Did you know that 24,000,000 people immigrated to the US in 2015 alone? That&#8217;s a bunch of people.</p>\n<a href=\"https://bl.ocks.org/curran/8c5bb1e0dd8ea98695d28c8a0ccfc533\"><img class=\"alignnone\" src=\"http://d.pr/i/OAPz.png\" alt=\"Immigration chord diagram\" width=\"1076\" height=\"958\" /></a>\n<p><a href=\"https://twitter.com/currankelleher\">Curran Kelleher</a> built a great chord diagram of the <a href=\"https://github.com/curran/data/blob/gh-pages/un/migration/README.md\">UN migrations dataset</a>. And there&#8217;s this cool chord diagram of <a href=\"http://ansperformance.eu/studies/flows-extra/index.html\">flights in and out of United States</a> that <a href=\"https://twitter.com/espinielli\">@espinielli</a> built.</p>\n<img class=\"alignnone wp-image-7402 size-full\" src=\"http://swizec.com/blog/wp-content/uploads/2017/01/flights-diagram-screenshot.png\" alt=\"Flights chord diagram\" width=\"1094\" height=\"854\" srcset=\"https://swizec.com/blog/wp-content/uploads/2017/01/flights-diagram-screenshot.png 1094w, https://swizec.com/blog/wp-content/uploads/2017/01/flights-diagram-screenshot-300x234.png 300w, https://swizec.com/blog/wp-content/uploads/2017/01/flights-diagram-screenshot-768x600.png 768w, https://swizec.com/blog/wp-content/uploads/2017/01/flights-diagram-screenshot-1024x799.png 1024w\" sizes=\"(max-width: 1094px) 100vw, 1094px\" />\n<p>I wanted something more. I wanted to build something that shows how many businesses are created by immigrants, how much money is pumped into the economy, and how many people were employed.</p>\n<p>I failed. For now.</p>\n<p>Those datasets are hard to find. I was able to find a dataset that shows the number of people self-employed, having jobs, or running a business based on race and ethnicity. It&#8217;s called the <a href=\"https://catalog.data.gov/dataset/survey-of-business-owners\">Survey of Business Owners</a>. It’s collected by the government and released every month, I think.</p>\n<p>Then there&#8217;s the US census <a href=\"http://www.census.gov/data/tables/time-series/demo/income-poverty/cps-pinc.html\">current population survey</a> which also promised to be useful.</p>\n<p>But I was unable to put them together and build a comprehensive dataset that shows what I wanted. Or even mentions it.</p>\n<p>Looks like the US government is much more concerned with tracking whether somebody is Black, Asian, Hispanic, White, or a veteran than it is whether they&#8217;re an immigrant or not. I wonder why… ?</p>\n<p>That said, I found two amazing studies talking about what I wanted to show.</p>\n<p>This <a href=\"http://www.hbs.edu/faculty/Publication%20Files/17-011_da2c1cf4-a999-4159-ab95-457c783e3fff.pdf\">Immigrant Entrepreneurship</a> 2016 paper from Harvard is the first. It&#8217;s 68 pages, so I haven&#8217;t read it yet.</p>\n<blockquote><p>We examine immigrant entrepreneurship and the survival and growth of immigrant-founded businesses over time relative to native-founded companies. Our work quantifies immigrant contributions to new firm creation in a wide variety of fields and using multiple definitions. While significant research effort has gone into understanding the economic impact of immigration into the United States, comprehensive data for quantifying immigrant entrepreneurship are difficult to assemble. We combine several restricted-access U.S. Census Bureau data sets to create a unique longitudinal data platform that covers 1992-2008 and many states. We describe differences in the types of businesses initially formed by immigrants and their medium-term growth patterns. We also consider the relationship of these outcomes to the immigrant&#8217;s age at arrival to the United States.</p></blockquote>\n<p>Sounds perfect, doesn&#8217;t it?</p>\n<p>Except for the <em>&#8220;combine several restricted-access&#8221;</em>. I can&#8217;t do restricted access.</p>\n<p>This <a href=\"https://www.sba.gov/sites/default/files/rs396tot.pdf\">Immigrant Entrepreneurs and Small Business Owners, and their Access to Financial Capital</a> 2012 paper from SBA tells a similar tale. Their datasets constructed out of restricted-access materials.</p>\n<p>Alas, that puts a stop to this project for now. But I&#8217;ll email the paper authors to see if they&#8217;re willing to share.</p>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"754193ca-12a5-5239-ba11-dd327da909d8"}}