{"data":{"wordpressPost":{"title":"I was wrong about AngularJS","content":"<div style=\"width: 650px\" class=\"wp-caption alignnone\"><img title=\"Here be dragons\" alt=\"Here be dragons\" src=\"https://draftin.com:443/images/21380?token=HhIlUPZY9RXuPRfOpGRctox6FoU0XQguyv0u4rpgynHlN-DOppDWqpjriFmSdTefOatp1b9AoP0v2hu5vfkEMSQ\" width=\"640\" height=\"480\" /><p class=\"wp-caption-text\">Here be dragons</p></div>\n<p>I started using Angular a few months ago. I hated it. Backbone was <em>so much</em> better.</p>\n<p>I cursed Angular every day. Logic mixed with HTML, bits of javascript polluting everything, the organisation of services and modules and controllers and apps and all the things feeling like some old school Java app. And god forbid you try to stray from the path, Angular will bash you over the head.</p>\n<p>And I never liked how much logic Angular hides from you. When I work on something, I want to understand the whole system. Having a bunch of <em>&#8220;Here be dragons, don&#8217;t go here&#8221;</em> signposts everywhere feels weird.</p>\n<p>How can you reason about your code if half of it is hidden?</p>\n<p>There was a case where I spent a whole day chasing down a bug because of that. When you clicked on a thing an unrelated thing cried out in pain and the app crashed.</p>\n<p>Turns out Angular was messing up the event cycle and tried to update something before a different thing made it ready to be updated. Yes, very descriptive, I know. But Angular&#8217;s <em>&#8220;This thing can&#8217;t be called, derp&#8221;</em> was super helpful too.</p>\n<p>Had to wrap a bunch of code in <code>setTimeout</code>. Ew.</p>\n<p>BUT!</p>\n<p>The past few weeks I poked at Backbone again. My love.</p>\n<p>And you know what, I can&#8217;t argue with results. Despite everything I hate about Angular on a philosophical level, it gets the job done. Fast.</p>\n<p>Getting stuff done with Angular is just so much easier. Especially the simple stuff that I don&#8217;t want to think about. Want something to be visible or not? <code>ng-show</code>. Want to display a value to users? <code>ng-model</code>.</p>\n<p>And so on.</p>\n<p>All these trivial little things that, yes, are simple, and, yes, I can code in my sleep, but with Angular I don&#8217;t have to. It takes 10 seconds with Angular, 3 minutes with Backbone.</p>\n<p>Who cares right? It&#8217;s only 94% quicker. Oh &#8230;</p>\n<p>It adds up, man. It really does.</p>\n<p>And because I don&#8217;t have to care about these tiny things, I get to spend more brain cycles on the main logic. It even leaves enough time to deal with the millions of steps of responsibility misdirection between the various controllers.</p>\n<p>But man do I hate writing so much Javascript in HTML. Didn&#8217;t we agree to ban <code>onclick=</code> ten years ago?</p>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"e1b27a3b-0298-5e53-8b12-275ffe8a7be7"}}