{"data":{"wordpressPost":{"title":"Magic shiny paint","content":"<p>Remember that Volvo LifePaint video from last year?</p>\n<p><iframe width=\"600\" height=\"400\" src=\"https://www.youtube.com/embed/CfWzeGlaFvI\" frameborder=\"0\" allowfullscreen></iframe></p>\n<p>DID YOU KNOW YOU CAN BUY THAT STUFF ON AMAZON!?!</p>\n<p>It&#8217;s called <a href=\"https://www.amazon.com/s/ref=nb_sb_noss_1?url=search-alias%3Daps&amp;field-keywords=albedo+spray&amp;rh=i%3Aaps%2Ck%3Aalbedo+spray\">albedo</a>, and it costs about $20 per can. The internet tells me that&#8217;s much cheaper than the Volvo-branded version. But the can is small, and you will finish it quick.</p>\n<p>It works great, though 😀</p>\n<p>I bought it so I can be shiny when riding my Boosted Board at night. Drivers in this city can be pretty aggressive. They zoom past and make me poop my pants.</p>\n<p>Pooping your pants at 22mph is dangerous.</p>\n<figure>\n<img src=\"http://i.dailymail.co.uk/i/pix/2012/09/18/article-0-15141246000005DC-845_634x419.jpg\" alt=\"\" /><br />\n</figure>\n<p>See? I’ve got my back towards the road when riding. I can&#8217;t see cars passing. My butt clenches every time they pass aggressively.</p>\n<p>Now check out how shiny my shoes and backpack were 10 minutes after dousing them in shiny magic paint. The shoes are a last minute <em>&#8220;Oooh, that&#8217;s gonna be cool!&#8221;</em> idea. The backpack was planned all along.</p>\n<figure>\n<img src=\"http://i.imgur.com/45BP3uB.jpg\" alt=\"\" /><br />\n</figure>\n<p>Just look at those shoes! It&#8217;s surreal how shiny they are. And that&#8217;s from an iPhone flash. Who knows how shiny they&#8217;ll be under car headlights. Wow.</p>\n<p>At least, that&#8217;s what I thought at first. I was never again able to reproduce an effect quite so dramatic. And it&#8217;s hard to show your friends how cool your shoes are when it takes night time and flash photography to show.</p>\n<p>It&#8217;s almost impossible to see under normal lighting. You can kinda see that I may have ruined the expensive birthday gift backpack my girlfriend got me, and the shoes sooooort of have a sheen if a light hits them just right.</p>\n<figure>\n<img src=\"http://i.imgur.com/kJNcSMj.jpg\" alt=\"\" /><br />\n</figure>\n<p>See. Nothing. Just an off-color backpack and some shoes.</p>\n<p>But with flash, they&#8217;re still shiny even a whole week of daily use. The paint on my shoes has mostly rubbed off because they&#8217;re smooth, but the backpack is going as strong as ever.</p>\n<figure>\n<img src=\"http://i.imgur.com/eRFMSlG.jpg\" alt=\"\" /><br />\n</figure>\n<p>I tried to draw a face on the backpack, but it just looks creepy instead &#8230; maybe that&#8217;s why cars have been keeping their distance lately. ?</p>\n<p>As for how it&#8217;s possible to have an invisible spray that’s also highly reflective (but only in the direction light is coming from), <a href=\"https://www.google.com/patents/US5109060\">here&#8217;s the patent</a>. At least I think that&#8217;s the patent.</p>\n<blockquote>\n<p>Stable spray-coatable, water base composition having about 2 percent solids, that dries into glittering film having plurality of reflective surfaces resistant to flaking, comprising: a blend of a surfactant free first solution comprising, butyl methacrylate, butyl acrylate, 2-ethylhexyl acrylate, glacial methacrylic acid and styrene; a blend of a self-crosslinking second solution comprising, 2-ethylhexyl acrylate, butyl methacrylate, glacial methacrylic acid, styrene and at least one cross-linking polymer; a thickener gel; transparent polyethylene terephthalate chips on which reflective material has been vacuum deposited and cured fast by an epoxy resin, and ammonia.</p>\n</blockquote>\n<p>Sure sounds like the patent.</p>\n<p>Oh, and the patent expired some 16 years ago. You can make this stuff yourself and no one will come after you. Enjoy ☺️</p>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"400fb17a-3e39-56f2-a2ff-66f139665bde"}}