{"data":{"wordpressPost":{"title":"Dude! The blog is read :O","content":"<p>\nThere have been many surprises regarding these blog over the past few days and one very huge one over the past few months. My readership has experienced a very odd fucking spike in that it&#39;s suddenly almost four-bloody-hundred a month whereas before I was lucky to push near 300. Another great surprise was talking to a lass in Norway the other day and when the topic of my <a href=\"http://swizec.com/index.php/mode=news/id=336\">computer</a>  came up she said something to the extent of <em>Oh yeah I know, read the blog about that.</em> Must say I was quite taken aback by that, what the fuck, people <em>actually</em> read that bunch of jibber jabber!?\n</p>\n<p>\nA few months ago a different kind of awesome happened, which I may already have talked about, but whatever, it was that in a debate on a forum someone wanted to prove me wrong and they &#8230; quoted my blog that they found on the internets and had no idea it was from me &#8230; very odd feeling indeed.\n</p>\n<p>\nBut it hasn&#39;t always been like this and I fear all of this is merely some kind of freak occurence. When I think about it I started my first blog back when they were still called journals. Not sure what domain it was on and am pretty certain it&#39;s been lost to the great beyond, but I do know what I started it for. We were doing poets and writers in school and I realised the importance of their journals, that they were very useful to the posterity, of great help in deciphering their texts. So I started my own.\n</p>\n<p>\nOf course it was a total flop, think I managed writing it for not even three weeks. But it was an experience. Later, when I started my first webcomic, or maybe the webcomic came before &#8230; anyway, it had a news section where I diligently wrote about stuff, not realising it &#8211; I was writing a blog. Later when I started Cthulhu and other crazies, which was of course a total flop, and bought this domain I also had a news section.\n</p>\n<p>\nDiligently, with every update of the comic I wrote and wrote. But since the comic was so overdesigned and the art way way too complex for anything but a monthly release schedule the news section became the most updated part of the website. And so slowly but surely it turned into a real proper blog.\n</p>\n<p>\nAs you may have noticed the comic slowly slipped out of my update schedule and only the blog remained around here, even though it&#39;s still called &quot;news&quot;, which is silly since it&#39;s a blog. But what&#39;s most surprising to me is that none of my webcomics, none of my previous blogs, ever managed to reel in even a quarter of the users this lonely jabbering blog does. Strange how things go, what was supposed to be a simple sideshow turned into the main attraction.\n</p>\n<p>\nThis is why I will soon be reworking this site into a pure blog, all about me and my yapping. Hopefully all you readers will be amused and will even start leaving me a comment or two once I make it practically possible instead of merely a theoretical possibility.\n</p>\n<p>\nThinking about how I had a blog when blogs weren&#39;t blogs yet makes me feel old, damn it.</p>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"e1e4551c-14ee-5e61-8ef8-64d4c9cabe5f"}}