{"data":{"wordpressPost":{"title":"After three years I finally have a phone number again","content":"<div style=\"width: 510px\" class=\"wp-caption alignnone\"><img alt=\"My new iPhone\" src=\"http://25.media.tumblr.com/e2453ce4d3e3428327caf2b3ec132d35/tumblr_mwu6dt9PIN1qekjngo1_500.jpg\" width=\"500\" height=\"500\" /><p class=\"wp-caption-text\">My new iPhone</p></div>\n<p>I bought my old iPhone in late 2010. Had to traveled all the way to the US to get a good deal since they were stupidly expensive in Europe and simply unavailable in Slovenia.</p>\n<p>Back then factory unlocked iPhones weren&#8217;t a thing yet. Just like the dark ages, only a select many had access to the best toys.</p>\n<p>But buy one I did. Hackers had promised the firmware and OS are already unlocked, they&#8217;re just waiting for Apple to release <a class=\"zem_slink\" title=\"IOS\" href=\"http://www.apple.com/ios/\" target=\"_blank\" rel=\"homepage\">iOS</a> 4 to make sure the bug doesn&#8217;t get fixed. Just a week or two and I&#8217;d be able to use the phone back home.</p>\n<p>The bug got leaked.</p>\n<p>I bought the phone a week after a firmware upgrade came out that fixed the unlock bug.</p>\n<p>Then the internet decided to just never break that particular firmware. Something about a new iOS coming out anyway with new firmwares and whatnot &#8230; they just didn&#8217;t bother with this particular version.</p>\n<p>Here I was, stuck with a very expensive iPod Touch that could make calls and receive texts on an AT&amp;T network. We don&#8217;t have an AT&amp;T network in Slovenia.</p>\n<p>It was a huge problem at first. 21st century, can&#8217;t even make a phone call or text somebody in a pinch. Can hardly make arrangements with friends because everyone just says <em>&#8220;Yeah let&#8217;s meet up tomorrow night&#8221;</em> and works the details out later.</p>\n<p>I couldn&#8217;t do that.</p>\n<p>I also couldn&#8217;t ask for instructions when I got lost, I couldn&#8217;t stray far at a busy music festival, I couldn&#8217;t leave the group at all when traveling. All those little things everyone takes for granted, I just couldn&#8217;t do.</p>\n<p>But man was it peaceful.</p>\n<p>Phones are super disruptive. Your phone rings, you pick up, and just like that the person on the other end is the most important thing in your universe. Impossible to focus on anything else, they own you.</p>\n<p>Usually, though, they don&#8217;t have anything <em>that</em> important to say. I&#8217;m a programmer, not an ambulance driver. The amount of times somebody needs my full attention Right Now! is infinitesmall.</p>\n<p>90% of the things I have to do in life can be handled via email, twitter, or Skype. Asynchronously. Without a fuss.</p>\n<p>In Slovenia this worked very well.</p>\n<p>The nearly ubiquitous wi-fi coverage in Ljubljana meant people could contact me as soon as I sat down somewhere. I could always look stuff up online by taking a few steps to the nearest wi-fi, and people got used to making concrete plans with me.</p>\n<p>Instead of <em>&#8220;Yeah let&#8217;s go out tomorrow.&#8221;</em>, it was <em>&#8220;Let&#8217;s meet at 8:13pm at so and so&#8221;</em>.</p>\n<p>This solves two problems:</p>\n<ol>\n<li>People are less likely to flake out</li>\n<li>Concrete plans mean you can concretely plan your day</li>\n</ol>\n<p>I like having my day mapped out so I&#8217;m not guessing what to do with myself hour to hour.</p>\n<p>But I&#8217;m in the US now.</p>\n<p>All these crazy kids ever do is text each other. Nobody is ever available on Skype or on FB messenger or Twitter or email. Most of them don&#8217;t even have a Twitter account!</p>\n<p>There&#8217;s no wi-fi anywhere either. Or rather, you have wi-fi in random grocery stores, but not in coffee shops. Of the three places I went to in <a class=\"zem_slink\" title=\"San Francisco\" href=\"http://maps.google.com/maps?ll=37.7833333333,-122.416666667&amp;spn=0.1,0.1&amp;q=37.7833333333,-122.416666667 (San%20Francisco)&amp;t=h\" target=\"_blank\" rel=\"geolocation\">San Francisco</a> last week not one of them had wi-fi.</p>\n<p>Must be some new hipster thing. Oooh we&#8217;re too cool for wi-fi, we want you to actually talk to the people around you. Humbug.</p>\n<p>So this week I got a phone. I&#8217;ve been planning a new iPhone for a while, but these crazy Americans broke my resolve and I got a phone number as well.</p>\n<p>Unlimited everything for $70 a month.</p>\n<p>It&#8217;s pretty nifty. Having an internet in your pocket at all times comes handy more often than I thought. I no longer have to plan routes in advance, I don&#8217;t have to remember to look things up before stepping out the door, I no longer get angry at coffee shops without wi-fi.</p>\n<p>I even have tethering!</p>\n<p>But &#8230; they wouldn&#8217;t let me have a phone with just internet. I have texting as well.</p>\n<p>It&#8217;s taken three times longer than usual to write this post because I keep texting with a girl instead. Meeting her in SF tomorrow.</p>\n<p>We&#8217;re figuring the plan out later &#8230; <em>sigh</em></p>\n<div class=\"zemanta-pixie\" style=\"margin-top: 10px; height: 15px;\"><a class=\"zemanta-pixie-a\" title=\"Enhanced by Zemanta\" href=\"http://www.zemanta.com/?px\"><img class=\"zemanta-pixie-img\" style=\"border: none; float: right;\" alt=\"Enhanced by Zemanta\" src=\"http://img.zemanta.com/zemified_e.png?x-id=517c0f05-96db-458b-8eeb-b9debe8fbc7c\" /></a></div>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"4c4bd8a2-2ce5-588b-9b1d-6163257b71d6"}}