{"data":{"wordpressPost":{"title":"This weekend I rented my dream car","content":"<div style=\"width: 710px\" class=\"wp-caption alignnone\"><img src=\"https://draftin.com:443/images/29095?token=c-p_DdWkS94dPXpEZVU2xsBgmQqRIClxKedWGTmdi9PjP6wchrMS6b-c_WSLFMfaeTbWrfKUHDfnbhmahhioprI\" alt=\"FIAT 500 Abarth\" width=\"700\" height=\"525\" /><p class=\"wp-caption-text\">FIAT 500 Abarth</p></div>\n<p>You should&#8217;ve seen the grin on my face when I sat in that thing. I looked like an idiot. There are no pictures. Girlfriend was too worried about how I&#8217;m going to drive to take any.</p>\n<p>Puhlease, what could I possibly do with a 160 horse power turbo charged car with manual transmission and sexy leather interior with red stitching? Sure, they call it the poor man&#8217;s Ferrari, but it&#8217;s really kind of fat for its engine.</p>\n<p>I don&#8217;t know how they packed so much into a car that&#8217;s small enough even I can reach from steering wheel to headlamp, but they did. I would assume it&#8217;s for safety.</p>\n<p>In a <a href=\"http://www.caranddriver.com/comparisons/2014-ford-fiesta-st-vs-2014-fiat-500-abarth-2014-mini-cooper-s-hardtop-final-scoring-performance-data-and-complete-specs-page-5\">recent comparison with other hot hatches</a>, the FIAT 500 Abarth took 7.0 seconds to 60MPH and a whopping 39.3 seconds to reach 120MPH (193km/h).</p>\n<p>The Abarth tops out at just 129MPH (207km/h).</p>\n<p>I mean, how can you possibly have fun in a car that takes almost a whole minute to reach 200 kilometers an hour? Seriously &#8230; why even bother.</p>\n<p>Hell, the thing takes <em>two seconds</em> to reach top city speeds of 30MPH (48km/h). TWO SECONDS before you&#8217;re breaking speed limits in the city.</p>\n<p>Useless.</p>\n<p>Boy was my girlfriend in for a fun ride. When that turbo kicks in &#8230; hnnnnnngh. Fssssck, whooosh. Gearshift. Wroooom. Fssssck, whooosh. Gearshift.</p>\n<img src=\"https://draftin.com:443/images/29087?token=gvGAivrSK8baFXN8jHd0V_sZ8XCYFyk0IkPP9_U3BYIg70qc2fx6gk9_pdkTj1qAnxUODVqCM0p5axbhLJGKQDQ\" alt=\"Jizz'd my pants\" />\n<p>The sound was like something out of Colin Mcrae Rally. I don&#8217;t even know how to describe it. If you&#8217;ve never driven a car with a real turbo before, you are missing out. No, the modern turbocharged diesels will not do. They don&#8217;t make the sexy noise.</p>\n<p>And the acceleration curve is out of this world. You stomp the accelerator, the car whizzes off the line. Just as it&#8217;s supposed to start letting go, the turbo gets full pressure and you fly out of this world.</p>\n<p>You&#8217;re sitting there and the car is purring. You press the gas and it goes wroooOOOO*<em>OOOMMMMMMM</em>*. It&#8217;s like you pressed a second accelerator or something.</p>\n<p>Then you change gear and the turbo exhales and it&#8217;s the most satisfying sound in the world. Sometimes it makes a purring sound next to the whoosh.</p>\n<p>And I&#8217;m not sure if I&#8217;m just such an epic driver, or the car has amazing stability control (which it does), but I could not make it misbehave in a corner. It&#8217;s front-wheel drive, so you&#8217;re not going to be doing tailwhips. But I couldn&#8217;t even get it to understeer.</p>\n<p>Although I did manage a small go-kart style skid thing on one particular freeway ramp. That was fun.</p>\n<div style=\"width: 489px\" class=\"wp-caption alignnone\"><img src=\"https://draftin.com:443/images/29091?token=lu8xcGVPoG9hhrwTsSMFb-60QCR4nn3mAXGTjq40pD-0ural-cetkV6rKMMWVDXLakjoDhOJeuQp2eJBNhoOAlc\" alt=\"The original Abarth with an uncloseable engine compartment\" width=\"479\" height=\"319\" /><p class=\"wp-caption-text\">The original Abarth with an uncloseable engine compartment</p></div>\n<p>The new FIAT 500 Abarth may not be as bonkers as the old version where the engine would overheat, if you closed the bonnet. But it is <em>the</em> perfect car.</p>\n<p>It costs only $22,000, is way too stiff for San Francisco&#8217;s crappy roads, and I want one. I want one now.</p>\n<p>The only thing that bothered me was the stupid armrest attached to the driver seat. You can&#8217;t reach the handbrake when it&#8217;s down &#8211; you need it a lot on these here hills &#8211; and my elbow kept bumping into it when I was shifting gears even when it was up. Go away armrest, this car is too tiny for you!</p>\n<p>The car is also too tiny for two Starbucks cups. They overlap in the cup holder and getting one out without knocking over the other is a struggle.</p>\n<p>But who cares. It&#8217;s a fun car. It&#8217;s a cheap car. It gets great mileage. It&#8217;s got a sport button. It goes whoosh. It blinks a light when it thinks you should shift up, but it&#8217;s usually wrong. And I have got to rent it again and drive it somewhere that isn&#8217;t just boring freeways.</p>\n<p>Where else can you get a whole day of stupid-grin-on-face fun for just $30 in gas?</p>\n<p>Nowhere.</p>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"49ddf55b-0e81-5b98-9de2-4f0c8f0ebe72"}}