{"data":{"wordpressPost":{"title":"GoKarting is better than both sex _and_ bacon","content":"<p><iframe src=\"//www.youtube-nocookie.com/embed/m7u4YdDgJB4\" height=\"360\" width=\"640\" allowfullscreen=\"\" frameborder=\"0\"></iframe></p>\n<p>Last time I sat in a gokart was much too long ago. About ten years ago I think and it almost doesn&#8217;t count anyway. Electric indoor karting for ten minutes, bleh.</p>\n<p>Last time I drove a <em>real</em> gokart was at some auto show or another when I was ten. Not sure if they still have those, but it used to be common in Slovenia for gokart racing teams to put up a small race track in the parking lot of a big auto show and let people race.</p>\n<p>Yesterday I got to go again.</p>\n<p>So. Much. Fun.</p>\n<p>Screw bacon and sex, give me a small petrol monster and a track and I&#8217;m in heaven. Everything else pales in comparison. I can&#8217;t even explain it.</p>\n<p>It&#8217;s just so &#8230; exciting. Exciting is too weak a word. Invigorating?</p>\n<p>Well let&#8217;s be honest, it&#8217;s just adrenaline and your brain desperately fighting to keep you alive through the madness. If you&#8217;ve ever had a 15 minute adrenaline high, you know what I mean. Sure, there&#8217;s many ways to get an adrenaline high, but motor sports have the best sustainedness.</p>\n<p>Everything else is just short bursts.</p>\n<p>You can race down a hill on a longboard. But after a minute, you have to spend a while walking back up or waiting for the shuttle.</p>\n<p>You can surf a gnarly wave. But after a few seconds, it&#8217;s back to fighting for your life on the edge of drowning and trying to find the lineup again.</p>\n<p>You can walk up to a cute girl and say <em>&#8220;Hi&#8221;</em>. But all the adrenaline is in the walk up, which lasts all of ten seconds.</p>\n<p>You can hop on a bike and race down a narrow woodland path. But the longer the hill lasts, the longer it will take you to get back up.</p>\n<p>You can jump off a plane. But from what I hear that doesn&#8217;t last very long either.</p>\n<p>Motor sports &#8230; that just goes and goes and goes. As long as there&#8217;s something in your fuel tank, you can keep going. Every turn a bit more on the edge. Every overpass a bit more aggressive. Every straight you accelerate sooner and brake later.</p>\n<p>That feeling when you&#8217;re neck-and-neck. Wall closing in from one end, gokart closing you in from the other. And you don&#8217;t let up. It&#8217;ll work out. It <em>has</em> to work out, or you&#8217;ll be in a world of hurt.</p>\n<p>You scrape the wall and the other guy, but you get through. Bam! Next corner.</p>\n<p>Luckily, <a class=\"zem_slink\" title=\"Kart racing\" href=\"http://en.wikipedia.org/wiki/Kart_racing\" target=\"_blank\" rel=\"wikipedia\">gokarts</a> are super safe. At least the kind of gokarts they let normal humans drive. You&#8217;ll be fine even if you let go of any sense of self-preservation you had left.</p>\n<p>Probably.</p>\n<p>Unless somebody ignores a yellow flag and smashes into your back full throttle with such force their glasses fly out of the helmet. Yeah that happened, I have no idea how &#8230;</p>\n<p>&#8230; but I can&#8217;t wait to do this again. If I wasn&#8217;t a programmer, I&#8217;d definitely be a race car driver.</p>\n<p>Mostly I just want another go so I can wipe that grin off the guy who won. I came 2nd and it <em>bothers</em> me.</p>\n<p><em>*glare*</em></p>\n<div class=\"zemanta-pixie\" style=\"margin-top: 10px; height: 15px;\"><a class=\"zemanta-pixie-a\" title=\"Enhanced by Zemanta\" href=\"http://www.zemanta.com/?px\"><img class=\"zemanta-pixie-img\" style=\"border: none; float: right;\" alt=\"Enhanced by Zemanta\" src=\"http://img.zemanta.com/zemified_e.png?x-id=ca188068-6110-4ca3-abca-9ae9834888f1\" /></a></div>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"9919fa0a-7dea-5629-a674-1a4b9f37086a"}}