{"data":{"wordpressPost":{"title":"Go the fuck home","content":"<p><iframe width=\"640\" height=\"360\" src=\"https://www.youtube.com/embed/YBoS-svKdgs\" frameborder=\"0\" allowfullscreen></iframe></p>\n<p>This 5 minute talk by Pam Selle is a thing of beauty. Watch it.</p>\n<p>Here are the key points. Honestly though, she expresses them much better than I do, so watch the video →</p>\n<ul>\n<li><strong>You are a business asset</strong>. You&#8217;re worth $X to your company. Your company knows the X… do you know the X?</li>\n<li>The more hours you work, the less money you&#8217;re making for your time.</li>\n<li>Every time you stay late after work, you&#8217;re giving that time away for free.</li>\n<li>Do side projects. Maybe even side projects that make money. 😉</li>\n<li><strong>You only stay late because you can&#8217;t do your work.</strong> Do your work at work. Get off Facebook, make the shit you want to happen happen, and go the fuck home when you&#8217;re done.</li>\n<li>When you work overtime, **your productivity goes down. **</li>\n<li>If you are good at your job, you should get it done in the time allotted.</li>\n<li><strong>Get a Life</strong></li>\n<li>Have an escape plan: schedule something right after work so that you&#8217;re forced to go the fuck home</li>\n<li><strong>Be an example for your team</strong>. Don&#8217;t perpetuate the &#8220;stay later to look loyaler&#8221; arms race. It&#8217;s dumb.</li>\n<li><strong>Be happy.</strong> Happier people are more productive, and if you&#8217;re more productive, you make more money. Everyone loves more money.</li>\n</ul>\n<p>You know what makes you happy? Having a life. Know what makes it possible to have a life? Going the fuck home.</p>\n<p>PS: If you&#8217;re a founder or have millions of dollars of your net worth in the company, this advice does not apply. You pour your heart and soul into that fucker, and <strong>remember to tell your employees to go the fuck home</strong>.</p>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"79af8d9c-7bd3-573d-83be-b7e95f34f167"}}