{"data":{"wordpressPost":{"title":"Plans and scams","content":"<p>\nLast night my girlfriend came home from the trip to Amsterdam, which ended up lasting exactly a week instead of almost two that she first thought she could pull off. Money conquers all I guess.  But anyway, you might remember my <a href=\"http://swizec.com/index.php/mode=news/id=349\">bemoaning of her cheating</a>  on me over there a few days ago, well guess what &#8230; it was all a <em>prank!</em>\n</p>\n<p>\nShe didn&#39;t cheat on me at all, she just made me think she did and when I found out all I could feel was immensely proud of what she did. Yes, the girlfriend finally beat me in my own mind games, what&#39;s more, in a single swipe she got me back for every time I ever scared the shit out of her or made her think there was something amiss with our relationship.\n</p>\n<p>\nHell, it brought a tear to my eye! You might be thinking right now that I&#39;m a lunatic for being proud of my girlfriend for causing me several days of severe anguish, but I&#39;m not a sore loser. In fact I cherish my losses because it means I had a worthy opponent, or even, if I dare say so, that my opponent has grown as a direct result of being my opponent. Now <em>that&#39;s</em> achievement! On top of it all, besides sex, what better fun can a couple have than fucking with eachother&#39;s minds? I sure can&#39;t think of anything &#8230;\n</p>\n<p>\nHowever, all is not as crystal clear, my jealousy sensors did go off for numerous things that she said she did, like for example being drunk and stoned all night with a couple of guys &#8230; yeah, totally unsuspicious, BUT, this morning I received final proof that nothing went wrong and she&#39;s still all mine. I&#39;d tell you how to tell if your girlfriend has cheated on you, but it&#39;s a trade secret of an evil scheming bastard.\n</p>\n<p>\nWhile we&#39;re on the topic of scheming, my master scheme surrounding the trip worked out. The idea was to let her go even though I was thoroughly upset by her going without me and not even inviting me, to even encourage her to go because I want her to be happy even if it&#39;s without me and such bullshit, but at the same time mention just a few times, in a few passing remarks, a serious word here and there, how much it bothers me that she&#39;s going &#8230; all with the evil plan of letting her realise on her own that she&#39;d much <em>much</em> rather go on vacation with me.\n</p>\n<p>\nThe scheme worked, she learned what I intended her to learn and professed never to go anywhere without me again &#8230; never again of course means until we get kind of sick of each other in 20 years, but I can live with that.\n</p>\n<p>\nAnd people say women are complicated! HA!</p>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"6f49f68b-634c-5c4f-abf8-739a0ab54edc"}}