{"data":{"wordpressPost":{"title":"What happens when you stop saying No","content":"<div style=\"width: 525px\" class=\"wp-caption alignnone\"><img title=\"Die with memories, not dreams\" alt=\"Die with memories, not dreams\" src=\"https://draftin.com:443/images/20767?token=QJ7LIyOnkgSrWEcgqAqYdMLyPeL4st46IUQKB-SrDZUU6Av3PfVzD-SLc-w44_dwkoEiDhwelw8WXRdJBiZIxuk\" width=\"515\" height=\"524\" /><p class=\"wp-caption-text\">Die with memories, not dreams</p></div>\n<p>This isn&#8217;t an inspirational story like Carrey&#8217;s <a class=\"zem_slink\" title=\"Yes Man [Blu-ray]\" href=\"http://www.amazon.com/Yes-Man-Blu-ray-Jim-Carrey/dp/B001FB55M6%3FSubscriptionId%3D0G81C5DAZ03ZR9WH9X82%26tag%3Dageewitahat-20%26linkCode%3Dxm2%26camp%3D2025%26creative%3D165953%26creativeASIN%3DB001FB55M6\" target=\"_blank\" rel=\"amazon\">Yes man</a>. It&#8217;s not much of a story even. It&#8217;s something that occurred to me while running yesterday morning.</p>\n<p>I have stopped saying &#8220;No.&#8221;</p>\n<p>I used to be a giant diva. If something wasn&#8217;t part of my plan for the day -&gt; No. Lunch with friends? Nope. Dinner with the girlfriend? No way. Call during my morning writing time? Negative. Do something fun on the weekend? Lol, nope.</p>\n<p>Every each nope was followed by a &#8220;Got work to do&#8221;. Or in case of potential clients, &#8220;Too busy, sorry.&#8221;</p>\n<p>My day followed strict rules &#8211; writing from 10am to 12am, then lunch, then work for one or <em>at most</em> two clients. Each day belonged to a particular client. Weekends belonged to writing.</p>\n<p>And it worked. I got <em>shitloads</em> done. Except most of my friends forgot I existed, my girlfriend got to see me a few hours a week, and my family thought I was a parasitic alien.</p>\n<p>But then, a panic over high rent and living in a new city.</p>\n<p>I <em>had</em> to make rent. I <em>had</em> to make friends. And bam! I stopped being a diva. I stopped saying No. I went to every social event I could. I accepted every project.</p>\n<p>And the result is horrifying.</p>\n<p>Two main projects get their proper days. A quick project has been feature creeping for four months, I have a side-project on a tight deadline, and I&#8217;m working on a d3.js video course for a publisher. Somehow I&#8217;ve even got a new girlfriend.</p>\n<p>That part is great.</p>\n<p>But all this amounts to being five weeks behind on deadlines for my publisher, not having written a blogpost in over a month despite ideas coming and going daily, a bimonthly email newsletter that I haven&#8217;t updated in three months, a woefully neglected half-finished self-published book that people are still buying in hopes I one day manage to finish, and clients that started asking what the hell is going on.</p>\n<p>And I haven&#8217;t gone longboarding in months.</p>\n<p>I can&#8217;t remember what it&#8217;s like to not be tired. My days go from groggy to hopped up on caffeine to falling asleep with laptop open and hands on keyboard.</p>\n<p>That&#8217;s a lie. My girlfriend forced me to take last week off. On Monday I felt deeply energetic for the first time in <em>months</em>. I got a bunch of writing done for video scripts and closed a week&#8217;s worth of tickets for the Monday client. Magic.</p>\n<p>But a week off also means work piled up; deadlines are tighter, clients are panickier, and most of my writing looks deader than ever.</p>\n<p>If I ever want to sleep again I have to start saying No. No to random trips to the beach, No to long dinners, No to just hanging out, No to concerts, No to music festivals, No to projects I don&#8217;t have time for.</p>\n<p>It&#8217;s the only way to stay sane.</p>\n<p>Last night I volunteered for DjangoGirls &#8230;</p>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"042088b7-dccf-5c69-ada2-1bef03631918"}}