{"data":{"wordpressPost":{"title":"Does it even make sense to move to San Francisco?","content":"<p>No.</p>\n<p>If all you want is a job and some equity and to hang out with your friends — stay home. San Francisco is too expensive. Stay home, work remotely, save thousands of dollars every month. Income arbitrage.</p>\n<p>But if you want to increase your opportunity potential, bootstrap a business on the side, start a startup eventually maybe, or just want your environment to push you to be the best you that you can be — come to San Francisco.</p>\n<img class=\"alignnone size-large wp-image-6808\" src=\"http://swizec.com/blog/wp-content/uploads/2016/05/landmark-bridge-cliff-california-1024x476.jpeg\" alt=\"landmark-bridge-cliff-california\" srcset=\"https://swizec.com/blog/wp-content/uploads/2016/05/landmark-bridge-cliff-california-1024x476.jpeg 1024w, https://swizec.com/blog/wp-content/uploads/2016/05/landmark-bridge-cliff-california-300x140.jpeg 300w, https://swizec.com/blog/wp-content/uploads/2016/05/landmark-bridge-cliff-california-768x357.jpeg 768w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" />\n<p>I know. We have the internet now and a global economy to boot. But who do you think gets better advice? That random bloke asking you questions on Twitter, or the guy who took you out to lunch?</p>\n<p>When an opportunity shows up, who do you think gets it? That guy who impressed you during a coffee chat, or the bloke who posts witty, sometimes useful comments on your Facebook posts?</p>\n<p>When you’re looking to start a business, who do you call for help? Friends from your social circle or randos from your email inbox?</p>\n<p>Exactly.</p>\n<p>You call the people you know, you send opportunities to people who impress you, and you give better advice in focused conversations.</p>\n<p>That’s why moving to San Francisco makes sense. It’s not that you’re gonna make $100,000 in salary and spend $90,000 of it staying alive. It’s not the ping pong tables and the free food and the shiny new Mac for everyone who joins. It’s the network effect.</p>\n<p>Being in the center of your industry isn’t <em>necessary</em>, but <strong>it sure helps</strong>.</p>\n<p>Sure, “the center of your industry” might not be San Francisco. If you like finance (even tech finance), go to New York. If you like movies, go to Los Angeles. If you like overpriced coffee, go to Portland.</p>\n<p>But, Swizec, all these cities are in the US!</p>\n<p>I know.</p>\n<p>A unified market of 320 million people who have been conditioned all their life that spending money is double plus good is <em>amazing</em>. The advantage is almost unfair.</p>\n<p>No matter what you do, no matter who you sell to, at some point someone has to extract that money from consumers.</p>\n<p>Yes, successful/huge/unicorn/global/gigantic companies do come out of Europe and China and India and all those other places with amazing people. But who do you think has it easier?</p>\n<p>On one hand, you have a starting market of 1 billion Indians who are barely making it. On the other hand, you have a starting market of 320 million Current Cultural Overlords Of The World™ with so much money that <a href=\"https://en.wikipedia.org/wiki/Pet_Rock\">they spent $6,000,000 on <em>pet rocks</em></a>. Pet rocks. Rocks! Six million dollars!</p>\n<p>Or a copper sphere that <a href=\"https://www.kickstarter.com/projects/trancemetals/trance-sphere-oligodynamic-copper\">raised $230,000</a> on Kickstarter.</p>\n<p>Americans <em>hate</em> keeping their money. Absolutely hate it.</p>\n<p>You don’t have to be an expert in macroeconomics to know that getting a dollar from the rich is easier than trying to get a dime from the struggling.</p>\n<p>Sure, there’s shitloads of opportunity in emerging markets. Bucketloads. If you can capture the Indian market <em>right now</em>, you’re going to be a global giant ten years from now.</p>\n<p>Can you survive the ten years it takes to get there? Maybe.</p>\n<p>What do you care, right? We’re talking about <em>you</em>. Where should <em>you</em> live? Who cares anyway, right? You want a job, maybe a side-business, you’re not trying to build a billion dollar company. Yet.</p>\n<p>Where I come from – Slovenia – the economy is doing… okay? There’s been a deep recession for the last several years, and there’s high unemployment for people under 30. Go to a gym at 11am on a Monday and it is <em>packed</em>.</p>\n<p>Most people are happy to have jobs at all. They’re counting pennies. Do you really think they’re going to push you to be the best you that you can be?</p>\n<p>When I’m home in Slovenia and I say, <em>“Fuck yeah! My promotion just sold $3,000 worth of books over the weekend! Woohoo!”</em>, people congratulate me.</p>\n<p>But their faces are saying: <em>“Is this guy for real? I think he’s lying. That doesn’t sound possible. Why is he telling me this? Doesn’t he know I’m struggling? What an insensitive fucker. All he cares about is money.”</em></p>\n<p>So I stop talking about it.</p>\n<p>When I’m in San Francisco and I say, <em>“Fuck yeah! My promotion just sold $3,000 worth of books over the weekend! Woohoo!”</em>, people congratulate me.</p>\n<p>But <em>their</em> faces are saying: <em>“LoL, why so little? Why does he even bother? Might as well spend more time with friends.”</em></p>\n<p>Then they ask, <em>“So what went wrong? Can you do better next time?”</em></p>\n<p>To be honest, it hurts. But it does make me think. I totally <em>can</em> do better next time. Why the hell wouldn’t I? I did <em>this</em> wrong and <em>that</em> wrong and <em>this thing</em> didn’t go to plan and I procrastinated on <em>that</em> bit.</p>\n<p>And it’s not just people’s expectations that push you. It’s their relative achievement as well. The glass ceiling, if you will.</p>\n<p>In Slovenia, I probably know half of all solopreneurs who make $100k-ish per year. There are no solopreneur millionaires. There aren’t even that many <em>companies</em> that make a million dollars or more in revenue.</p>\n<p>In San Francisco, on the other hand, $100k is a number casually thrown around. Not everyone makes that much, but everyone knows that they can. Easily. Maybe on the next job hop, or the one after that.</p>\n<p>Entrepreneurs, even solopreneurs, don’t worry about making thousands or tens of thousands. They think about hundreds, millions, even hundreds of millions in later stages.</p>\n<p>Almost everyone has a few hundred thousand in imaginary equity money. Or they hope they do.</p>\n<p>Think you’ve found a glass ceiling at home? You ain’t seen nothing yet. Come to San Francisco. Let the environment push you.</p>\n<p>You can do more.</p>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"ab26b6b5-a0fc-5e99-90d3-8bc8a4335bd0"}}