{"data":{"wordpressPost":{"title":"Going to the dentist is like trying out a new opensource project","content":"<p>Roughly six or seven years have passed since I was last at the dentist&#8217;s and after having been putting off making an appointment for just over a year now I finally decided to man up and go make an appointment today.</p>\n<div style=\"width: 250px\" class=\"wp-caption alignright\"><a href=\"http://www.flickr.com/photos/40066856@N04/6325384369\"><img class=\"zemanta-img-inserted zemanta-img-configured\" title=\"IMG_3265\" src=\"http://swizec.com/blog/wp-content/uploads/2011/11/6325384369_10e9b3492f_m5.jpg\" alt=\"IMG_3265\" width=\"240\" height=\"180\" /></a><p class=\"wp-caption-text\">Image by simply.jessi via Flickr</p></div>\n<div class=\"mceTemp\"></div>\n<p>Of course, the last time I was there I was in high school and somebody, probably mum, simply told me when and where to go and that was that. I may even have been on some sort of reoccuring pattern and the dentist told me when to come next time or something. Don&#8217;t really remember.</p>\n<p>Since I&#8217;m now a bit older this means an appropriate dentist isn&#8217;t even in the same building anymore. Luckily the new building is across the street.</p>\n<p>So I go there and immediately have to make a decision. This thing is like a huge repository of stuff &#8230; think of it like github. You are greeted with a big sign essentially saying <em>&#8220;Some interesting projects this way. There are some that other way as well. Oh and some are upstairs&#8221;</em></p>\n<p>Picked the Dentist project and walked through a door.</p>\n<p>The project consisted of roughly two modules. There was a big Waiting Room module, which I think doubles as a homegrown community forum, an RTG module &#8211; might be just a single executable. There was also a module looking more like a collection of executables, called Dentists.</p>\n<p>Naturally there was no documentation. Well, I&#8217;m lying, of course there was some documentaiton. A document listed all the executables in this project and there was a document suggesting I should have a running OS before I attempt to use an executable &#8230; something about things being pricey if I don&#8217;t.</p>\n<p>You look at these executables and nothing makes sense.</p>\n<p>Every executable is described only by its name. Other than that the only information was one executable advertising itself as just having moved to a different location, presumably within the same project, and another saying I should not under any circumstances try to execute it first.</p>\n<div style=\"width: 250px\" class=\"wp-caption alignleft\"><a href=\"http://www.flickr.com/photos/60500928@N06/6325383183\"><img class=\"zemanta-img-inserted zemanta-img-configured\" title=\"45\" src=\"http://swizec.com/blog/wp-content/uploads/2011/11/6325383183_2d45304650_m3.jpg\" alt=\"45\" width=\"240\" height=\"160\" /></a><p class=\"wp-caption-text\">Image by &amp;TheBitGoesOn via Flickr</p></div>\n<p>In a sense this was the worst open source project I ever attempted to use. There was no indication of a project owner or anyone I could contact in case I had any questions. The community forum also looked particularly dead &#8230; there was one member online but I think he was idling and probably wouldn&#8217;t answer my questions even if I asked.</p>\n<p>There were some more executables around the corner, but nothing that could really explain what&#8217;s going on here or what the entry point for the project is. Where to start picking it apart and figuring out how to use this thing.</p>\n<p>Oh and I also found some random piece of documentation that said all executables have a latency of roughly a month or two. Although I&#8217;m not certain how this is useful if you can&#8217;t even run them in the first place &#8230; maybe they run as a server and you have to somehow issue a request?</p>\n<p>All in all a really baffling and confusing experience. In the end I just left. Think I need to find someone with experience using this project or some sort of tutorial &#8230;</p>\n<div class=\"zemanta-pixie\" style=\"margin-top: 10px; height: 15px;\"><a class=\"zemanta-pixie-a\" title=\"Enhanced by Zemanta\" href=\"http://www.zemanta.com/\"><img class=\"zemanta-pixie-img\" style=\"border: none; float: right;\" src=\"http://img.zemanta.com/zemified_e.png?x-id=4c2d625b-786d-4bb8-a1b7-3344769d30f9\" alt=\"Enhanced by Zemanta\" /></a></div>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"b1f648ad-6d55-52ad-90f9-ba4c283feb5d"}}