{"data":{"wordpressPost":{"title":"The modern decadent","content":"<p>\nRecently I&#39;ve read a book on decadence that was comprised primarily of examples on being decadent, how it&#39;s done, why it&#39;s done and so on &#8230; it was called <em>The Decadent Handbook</em> I believe and anyone with any sort of decadent aspirations should give it a read, even though it <em>is</em> a bit difficult to wade through at certain points. The book itself has an interesting notion in the foreword and epilogue in that it claims everyone mentioned in it, indeed anyone writing about decadence, cannot be decadent themselves by definition.\n</p>\n<p>\nThe idea behind this notion seemed to be that the people writing in the book were not writing about their own experiences for the most part and that they were merely bookworms behind closed doors dreaming up lives of fun and adventure. Nothing wrong with this, but personally I prefer thinking that at least some of them were real and they weren&#39;t all quite as shammy as the cynic bastard surrounding it would have you think.\n</p>\n<p>\nBut it got me to wondering, just what <em>is</em> decadence then? Everyone in the book seemed to agree on one single point, surprisingly it wasn&#39;t the drugs, the debauchery or glutonous eating. No, the one and only common denominator between all descriptions was having fun with total disregard for common sense.\n</p>\n<p>\nRight, so that immediatelly pops an image of a rockstar or something similar up in your head and there&#39;s nothing wrong with that, there really isn&#39;t. But I propose to you an image of a different decadent, one that doesn&#39;t flip his finger at society quite so obviously. What if true decadence is that guy who goes to work every morning and <strong>loves</strong> it? What if it&#39;s the workoholic who actually likes what they do and feels invigorated by their job? Granted that doesn&#39;t seem very fun to the rest of the world, but he wouldn&#39;t even care, just like he shouldn&#39;t. If he manages to sneak in a few drugs here and there, some heavy drinking when he&#39;s got the time and perhaps an odd kink or two that&#39;s an added plus.\n</p>\n<p>\nSo, in the end, what is decadence? Decadence is fun.</p>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"5c32dd66-5f58-5ae5-8fbc-ff98be434e5d"}}