{"data":{"wordpressPost":{"title":"The story of my family is the story of survivorship bias&#8217;s other side","content":"<p>I figured it out on my 2 hour run…</p>\n<img src=\"https://scontent-sjc3-1.cdninstagram.com/vp/83b5e68b420d481323b0458af04c91ef/5B216B80/t51.2885-15/e35/27878687_956907841130931_5664501580645269504_n.jpg\" alt=\"Life in San Francisco ain't bad\" />\n<p>A thing I’ve noticed:</p>\n<p>Objectively, my life is going pretty well.</p>\n<p>Subjectively, I always have a sense of impending doom and feel like I&#8217;m not living boldly enough, am underperforming, and turning into a normie.</p>\n<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">A thing I’ve noticed:</p>\n<p>Objectively, my life is going pretty well on all fronts.</p>\n<p>Subjectively, I always expect an imminent catastrophe that’s going to ruin everything and feel like I’m not living boldly enough, am underperforming and turning into a normie.</p>\n<p>I wonder why</p>\n<p>&mdash; Swizec (@Swizec) <a href=\"https://twitter.com/Swizec/status/965072611842510848?ref_src=twsrc%5Etfw\">February 18, 2018</a></p></blockquote>\n<p><script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></p>\n<p>The existential dread never goes away. And I think I know why.</p>\n<p>Story time! 👇</p>\n<p>My great grandparents were wealthy farmers. They owned one of the largest farms around back when <a href=\"https://en.wikipedia.org/wiki/Kingdom_of_Yugoslavia#Economy\">the economy was 75% agrarian</a>.</p>\n<p>They returned from Dachau or Buchenwald <sup><a id=\"ffn1\" href=\"#fn1\" class=\"footnote\">1</a></sup> to a largely burned down and destroyed farm.</p>\n<p>Great granddad rebuilt their wealth through livestock trading, a booming industry in an agrarian society that needs to rebuild after a war. Milk was a staple.</p>\n<p>The stories I heard about my great grandpa paint him as sort of entrepreneurial genius. He started life as a farmhand, a young worker paid with food and board. Eventually, he bought the farm he worked at as a kid.</p>\n<img src=\"https://upload.wikimedia.org/wikipedia/commons/a/a6/Postcard_of_Raka,_Kr%C5%A1ko_(2).jpg\" alt=\"This was my great grandparents' local town\" />\n<p>Despite his genius, the forces of industrialization <sup><a id=\"ffn2\" href=\"#fn2\" class=\"footnote\">2</a></sup> were too strong. Kids went to school and wanted jobs in the city.</p>\n<p>These days, the farm is Not Doing So Great. Those who remain get by and supplement their income with day jobs. The rest moved to the city.</p>\n<p>Great gramps died a month before I was born. Late 80&#8217;s. I&#8217;m told we&#8217;re a lot alike.</p>\n<p>Grandpa on that side of the family died in an iron factory accident when my dad was 5. Grandma died from complications during childbirth.</p>\n<p>So my dad was an orphan growing up with my great grandmother on the family farm. More on him later.</p>\n<hr />\n<img src=\"http://varnastarost.si/uploads/RTEmagicC_TST_stari_leseni_bazen_600.png.png\" alt=\"One of my grandpa's first jobs was in a nearby spa\" />\n<p>On the other side of the family, my great grandparents did okay but not spectacular. No camps for them that I know of, but times were tough after the war. They got by.</p>\n<p>I heard they knew of my paternal great grandpa from his cattle trading reputation and propensity for practical jokes. Maybe they even met.</p>\n<p>My maternal grandpa complains he was often hungry as a kid. My mum says he exaggerates. Young growing boys are always hungry.</p>\n<p>Back then, you bought jam by the spoon, not by the jar.</p>\n<p>My grandma says she would sometimes eat plaster off the walls when she was hungry. I don&#8217;t know much about her side of the family.</p>\n<p>But grandpa decided farming was not for him, and he went to seek riches in the service industry. He finished high school in The Big City, you see. He was a hotshot.</p>\n<p>Eventually, he and my grandma started a tavern. This must have been in the 70&#8217;s. My mum says to this day that red wine smells like fat old drunk men.</p>\n<p>The tavern was going well for a while. Then they went bankrupt. I don&#8217;t know why, but they did.</p>\n<p>Grandpa got a job as an inventory manager at a nearby pharmaceutical factory. Grandma worked as a pill packer. She was given 1 liter of milk per day to help with the chemicals.</p>\n<p>Grandpa bought up land around their house and started a vineyard on the side.</p>\n<p>It was going great. He won awards. But land is expensive and wine is labor intensive. He kept his high paying job until his retirement some time in the late 90&#8217;s.</p>\n<p>After retirement, he redoubled his efforts and went hard on the vineyard.</p>\n<img src=\"https://scontent-sjc3-1.cdninstagram.com/vp/b0bca11067fa4b97afdecab144f08029/5B4D673A/t51.2885-15/e15/1799704_1620500888163827_370626032_n.jpg\" alt=\"My grandpa and my sister raking leaves\" />\n<p>But the wine market in Slovenia collapsed, and the government started bailing people out. Cash in return for cutting down your vines.</p>\n<p>He took the cash. Now he smokes meat as a hobby.</p>\n<p>Sometimes, he sells some of his old wine inventory. My French girlfriend says it&#8217;s some of the best wine she&#8217;s ever tasted.</p>\n<hr />\n<img src=\"https://i.pinimg.com/originals/57/c2/60/57c2604c5394cbceb7ad77ec14fdfe59.jpg\" alt=\"My mum moved to the capital\" />\n<p>My mum was scarred from entrepreneurship because of grandpa, so she got a well paying government job in the city instead. She does okay but complains a lot.</p>\n<p>A lot of stability tho. Stability is good.</p>\n<p>Because my dad… my dad saw much opportunity in the early 90&#8217;s transition from socialism to capitalism <sup><a id=\"ffn3\" href=\"#fn3\" class=\"footnote\">3</a></sup>. He tried many things. Some went better, some went worse.</p>\n<p>Somehow, he was always between different schemes and different jobs.</p>\n<p>Eventually, my mum got tired of him, and they divorced. He took the money as seed investment in a real estate business. Flipping houses.</p>\n<p>It was going great for a while.</p>\n<p>Then 2008 happened. The apartments he flipped got smaller and smaller. Child support checks stopped coming.</p>\n<p>He refused to accept defeat and kept going.</p>\n<p>Our family eventually broke ties with him. His extended family gave up even sooner, I think. He owed money to everyone, even his kids.</p>\n<p>He went kinda coo-coo after that.</p>\n<p>Last I heard, he was homeless. Avoiding collections.</p>\n<hr />\n<p><center><img src=\"https://c1.staticflickr.com/5/4067/4422312388_f6811a34b8_z.jpg\" alt=\"Me pitching at seedcamp\" /></center></p>\n<p>And then there&#8217;s me.</p>\n<p>I started college right before the global crisis of 2008. I always knew there was no future for me in having a job.</p>\n<p>So in college, I started a startup. But nobody told me a business should make money. All I heard about was VC this VC that.</p>\n<p>I didn&#8217;t get VC. My angels fired me.</p>\n<p>So I started a freelancing business. It was going great. Until I decided to make it <em>really</em> great by moving to the US.</p>\n<p>But in the US, SF Bay Area at least, nobody wants freelancers. They want full time.</p>\n<p>Oh, and the social clout I took for granted back home? Worth nothing.</p>\n<p>Times got tough, but I failed up into a full-time engineering job at a startup. Paying better than any of my freelancing ever did.</p>\n<p>But I knew my future was not in jobs. So I started a sidehustle. Training people how to be better engineers. React was just exploding, great time to get in.</p>\n<img src=\"https://scontent-sjc3-1.cdninstagram.com/vp/5ae255f532cbab3d70c7286e6cd0f460/5B080185/t51.2885-15/e35/10899048_1679818318917842_1788738823_n.jpg\" alt=\"I got me a home office\" />\n<p>That&#8217;s still going great. 2x year-over-year growth so far. Wonderful.</p>\n<p>But the sidehustle is showing some worrying signs. It&#8217;s getting smothered by my lack of time. The competition is out-executing me.</p>\n<p>It&#8217;s time to do or die. Those decisions are hard.</p>\n<p>Because I come from a long line of smart ambitious hardworking people plagued by unforeseen market changes and personal tragedy.</p>\n<p>Whenever anyone in my family did or died, it was always going great until suddenly it wasn&#8217;t.</p>\n<p>And that&#8217;s where my sense of impending doom comes from.</p>\n<p>Thanks for listening.</p>\n<blockquote><p>\nCaveat: This story is stitched together from memories and stories I heard. Many of them when I was very young.\n</p></blockquote>\n<ol id=\"footnotes\">\n<li id=\"fn1\">I don&#8217;t know which camp my great grandparents were in. I know it was in Germany and that it was a work camp, not an extermination camp. According to them this made it relatively tame. <a href=\"#ffn1\">&#8617;</a></li>\n<li id=\"fn2\">Yugoslavia after World War 2 went through a period of intense industrialization. Everyone got electricity and indoor plumbing, jobs moved to cities, factories sprung up all over. People bought bicycles, cars, and tractors. <a href=\"#ffn2\">&#8617;</a></li>\n<li id=\"fn3\">After the <a href=\"https://en.wikipedia.org/wiki/Ten-Day_War\">10-day war</a>, Slovenia seceded from Yugoslavia and started transforming its economy from mostly centrally planned socialism, to a capitalist system. Those who could, bought up state-owned factories and businesses, others started their own. Entrepreneurship was encouraged at last. <a href=\"#ffn3\">&#8617;</a></li>\n</ol>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"cb80ead2-0a8a-5a42-b799-0ebe573c7f78"}}