{"data":{"wordpressPost":{"title":"Stupid users are a myth","content":"<div class=\"zemanta-img\" style=\"margin: 1em; display: block;\">\n<div>\n<dl class=\"wp-caption alignright\" style=\"width: 212px;\">\n<dt class=\"wp-caption-dt\"><a href=\"http://commons.wikipedia.org/wiki/Image:Einstein1921_by_F_Schmutzer_2.jpg\"><img title=\"Albert Einstein during a lecture in Vienna in 1921\" src=\"http://upload.wikimedia.org/wikipedia/commons/thumb/a/af/Einstein1921_by_F_Schmutzer_2.jpg/202px-Einstein1921_by_F_Schmutzer_2.jpg\" alt=\"Albert Einstein during a lecture in Vienna in 1921\" width=\"202\" height=\"252\" /></a></dt>\n<dd class=\"wp-caption-dd zemanta-img-attribution\" style=\"font-size: 0.8em;\">Image via <a href=\"http://commons.wikipedia.org/wiki/Image:Einstein1921_by_F_Schmutzer_2.jpg\">Wikipedia</a></dd>\n</dl>\n</div>\n</div>\n<p>As developers we often berate our users for being stupid, even go so far as making up sayings to make it easier; what&#8217;s more, we even employ some very smart people and proverbs about stupidity to aid us in our cause to make fun of the stupid (l)users:</p>\n<ul>\n<li>Human stupidity is nonconvergent &#8211; it has no limit</li>\n<li>Two things are infinite: the universe and human stupidity; and I&#8217;m not sure about the universe.</li>\n<li>No matter how idiot proof you make something, humanity/evolution will always provide a better idiot</li>\n<li>PEBCAK/PEBKAC Error &#8220;problem exists between chair and keyboard&#8221; &#8211; <a class=\"zem_slink\" title=\"ID-Ten-T Error\" rel=\"wikipedia\" href=\"http://en.wikipedia.org/wiki/ID-Ten-T_Error\">ID10T</a> Error (via @foulbastard)</li>\n<li>Or <a class=\"zem_slink\" title=\"PEBKAC\" rel=\"wikipedia\" href=\"http://en.wikipedia.org/wiki/PEBKAC\">PICNIC</a>. Problem In Chair Not In Computer (via @kapkap)</li>\n<li>no system, no matter how greatly developed, is resistant against dumb pulling off switch (via @Rokrca)</li>\n</ul>\n<p>But let me ask you something, are you as a developer absolutely certain that the user is stupid and the fault doesn&#8217;t lie with your software? Can you prove without a doubt that what you developed is perfect and the Stupid User is just too idiotic to learn how to use your brilliant work?</p>\n<h2><!--more--></h2>\n<h2>There are no stupid users, just useless tools</h2>\n<div class=\"zemanta-img\" style=\"margin: 1em; display: block;\">\n<div>\n<dl class=\"wp-caption alignright\" style=\"width: 212px;\">\n<dt class=\"wp-caption-dt\"><a href=\"http://commons.wikipedia.org/wiki/Image:HumanProcessorModel.jpg\"><img title=\"Model of the Human Processor\" src=\"http://upload.wikimedia.org/wikipedia/commons/thumb/6/66/HumanProcessorModel.jpg/202px-HumanProcessorModel.jpg\" alt=\"Model of the Human Processor\" width=\"202\" height=\"179\" /></a></dt>\n<dd class=\"wp-caption-dd zemanta-img-attribution\" style=\"font-size: 0.8em;\">Image via <a href=\"http://commons.wikipedia.org/wiki/Image:HumanProcessorModel.jpg\">Wikipedia</a></dd>\n</dl>\n</div>\n</div>\n<p>An old saying goes, or maybe I just made it up, that <em>The tool is only as good as the person using it, </em>which seems like a terrible example to use, but hear me out. Notice that it doesn&#8217;t say the tool is good, neither does it say that the tool is brilliant, it says the tool is used.</p>\n<p>So if a tool is only as good as the person using it and your tool is impossible to use, doesn&#8217;t that in effect mean that the tool is quite simply useless? See, the thing with software is that yes, you find it extremely simple, yes you&#8217;ve thought of everything (or so you think) and yes, you can&#8217;t understand what people find so hard about it. But the thing is, if a person can&#8217;t use something, they won&#8217;t.</p>\n<p>It doesn&#8217;t matter how brilliant you are, it doesn&#8217;t even matter how well thought-out your algorithm is and that it uses two petaflops less than it could. If its interface can only be used by a rocket scientist and even then only after ten weeks of training that means <strong>you fail.</strong></p>\n<p>Users don&#8217;t actually care about performance, most of them can&#8217;t tell poor performing software from a well performing software. All they care about is &#8220;Can I use it?&#8221; and if the answer to that question is No then they will move to a competitor that might cost a bit more or might be a bit slower. In fact the only time real users care about performance is when it affects usability.</p>\n<h2>We are all stupid users</h2>\n<p>Next time you make light fun of stupid users who have managed to uncover an error message you put in for fun &#8220;because no-one would be so stupid to make that sequence of actions&#8221; or when you make fun of people for not understanding how to do X in dialog Y and how on earth they could get confused about a modal dialog &#8230; you get the picture.</p>\n<p>Well next time that happens, stop for a moment and think: <em>How often am I the stupid user? </em>Chances are the answer is Quite frequently.</p>\n<p>We all hit snags when somebody forgets to think about usability somewhere, or puts performance/design/whatever before their users. We all know that one (or more) website where it&#8217;s easier to just use the search box than prowl around for what you need. We all go WTFLOL when a weird dialog box pops up. And we&#8217;ve all been forced into a situation where a sequence of actions needed to do something simply wasn&#8217;t logical at all (think VCR&#8217;s and most cell phones)</p>\n<p>So does that make us stupid (l)users? Yes, how could it not, there was a piece of brilliant software just like we make every day and we couldn&#8217;t use it &#8230; but not actually, it justs shows we&#8217;re all users first and developers/geniuses later. Think about it, you seemed very stupid to your maths teacher in high school or wherever, but they would never berate you like that since they&#8217;re there to teach, not to gloat.</p>\n<h2>Teach and reflect</h2>\n<p>But what can we do to make our users less stupid? Well the obvious solution is to once in a while think like them even if it&#8217;s hard. Try to forget everything months of experience in testing has brought and see what a novice user would do. Set up girlfriend tests and find some dope who has no idea what X is and just watch them using your software. Do they find everything? Are they filled with questions, or can they do pretty much everything they want intuitively?</p>\n<p>Most of all, when developing always keep in mind: <em>&#8220;Could I use it if I weren&#8217;t using it all the time?&#8221;</em></p>\n<p>Better yet, make it so your interface is automatically teaching its users what to do. When they figure out an action all subsequent actions should follow the same mould. Consistency and discoverability are key. A feature the user can&#8217;t discover is a feature that doesn&#8217;t exist.</p>\n<h2>Conclusion</h2>\n<p>For conclusion let me condense this whole post into a lovely little soundbyte: There are no stupid users, just clueless developers.</p>\n<h6 class=\"zemanta-related-title\" style=\"font-size: 1em;\">Related articles by Zemanta</h6>\n<ul class=\"zemanta-article-ul\">\n<li class=\"zemanta-article-ul-li\"><a href=\"http://www.90percentofeverything.com/2009/03/12/bsod-error-reporting-boost-the-error-reporting-user-experience-of-your-websites/\">BSOD Error Reporting: boost the error reporting user experience of your websites.</a> (90percentofeverything.com)</li>\n</ul>\n<div class=\"zemanta-pixie\" style=\"margin-top: 10px; height: 15px;\"><a class=\"zemanta-pixie-a\" title=\"Zemified by Zemanta\" href=\"http://reblog.zemanta.com/zemified/a4e997fb-c78f-452d-be4d-afff7b41df05/\"><img class=\"zemanta-pixie-img\" style=\"border: none; float: right;\" src=\"http://img.zemanta.com/reblog_e.png?x-id=a4e997fb-c78f-452d-be4d-afff7b41df05\" alt=\"Reblog this post [with Zemanta]\" /></a><span class=\"zem-script more-related\"><script src=\"http://static.zemanta.com/readside/loader.js\" type=\"text/javascript\"></script></span></div>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"d2eab306-bc07-5c92-bec8-e33081850791"}}