{"data":{"wordpressPost":{"title":"Are You an Engineer or a Developer?","content":"<p>Did you know software engineers make $13,000 per year more than software developers on average?<sup><a href=\"#fn1-23616\" id=\"fnr1-23616\" title=\"see footnote\" class=\"footnote\">1</a></sup> It’s even more than that (a $22,000 difference) in California.</p>\n<p>Same job, right? You build software. Get some specs, build some software, make shit work. But the market clearly believes there’s a difference.</p>\n<p>It took 18 months, but I think I finally understand the difference. There’s a binary question you can answer to see if you&#8217;re a software engineer or a software developer.</p>\n<p>Let&#8217;s role-play!</p>\n<hr />\n<p><em>Manager Bob:</em> Our business has a problem. We spend a lot of money on acquiring users, but they drop out of onboarding before their ah-ha moment<sup><a href=\"#fn2-23616\" id=\"fnr2-23616\" title=\"see footnote\" class=\"footnote\">2</a></sup>. We&#8217;ve identified three drop-off points where we lose 50% of our users. Our design and product people came up with a new onboarding flow that aims to fix this problem. It took weeks to design, and we think it&#8217;s really good.</p>\n<p><em>You</em>: Uh-oh.</p>\n<p><em>Manager Bob</em>: We tried to reuse old components as much as possible, but the overall onboarding experience is completely new. We also changed some business processes to facilitate these improvements and get rid of unnecessary steps. That might have implications beyond onboarding.</p>\n<p><em>You</em>: Oh yeah, it definitely will. How did you reuse components exactly?</p>\n<p><em>Manager Bob</em>: We used the same semantics as before and tweaked the design to fit our new flow. That&#8217;s not hard to build, is it? To be honest, you&#8217;ll just have to figure it out anyway. This needs to happen. We can&#8217;t keep wasting ad spend like this.</p>\n<p><em>You</em>: Right, yeah. No, we can&#8217;t.</p>\n<p><em>Manager Bob</em>: How can we get this out as soon as possible?</p>\n<hr />\n<p>I have yet to meet a coder-at-heart who wouldn&#8217;t break a sweat in this situation. My initial reaction is always something like <em>&#8220;You want to do what? Holy shit.&#8221;</em></p>\n<p>You get an amorphous blob of a project. What you do next defines you as an engineer or a developer. If you can take the amorphous blob and turn it into:</p>\n<ul>\n<li>action steps</li>\n<li>sub-projects</li>\n<li>a staggered delivery plan (perhaps)</li>\n<li>opportunities for work in parallel</li>\n<li>a clear Thing To Do First™</li>\n<li>a well-defined Thing That Says You’re Done™</li>\n</ul>\n<p>…then you are an engineer. If somebody else has to do that, then you’re a developer.</p>\n<p>Or maybe the difference lies in the size of that amorphous blob you can begin with. ?</p>\n<p>PS: This is what an engineer looks like per Wikipedia. It&#8217;s a shame software engineers don&#8217;t get slide rules.</p>\n<figure>\n<img src=\"https://upload.wikimedia.org/wikipedia/commons/thumb/d/d0/Kitty_Joyner_-_Electrical_Engineer_-_GPN-2000-001933.jpg/800px-Kitty_Joyner_-_Electrical_Engineer_-_GPN-2000-001933.jpg\" alt=\"\" /><br />\n</figure>\n<div class=\"footnotes\">\n<hr />\n<ol>\n<li id=\"fn1-23616\">\n<p>The hard data I have is from salary distributions of engineers/developers/programmers on H1B visas. <a href=\"https://twitter.com/swizec/status/569946812099862528\">Here&#8217;s a tweetable recap</a> that links to source. I haven&#8217;t been able to find hard data for jobs that don&#8217;t involve immigration. <a href=\"#fnr1-23616\" title=\"return to article\" class=\"reversefootnote\">&#8617;&#xFE0E;</a></p>\n</li>\n<li id=\"fn2-23616\">\n<p>In UX, the a-ha moment is the first time a user says &#8220;A-ha! <em>That</em>&#8217;s how this app makes my life better&#8221;. Read <a href=\"https://www.amazon.com/Badass-Making-Awesome-Kathy-Sierra/dp/1491919019\">Kathy Sierra&#8217;s <em>Badass</em> book</a> for more. <a href=\"#fnr2-23616\" title=\"return to article\" class=\"reversefootnote\">&#8617;&#xFE0E;</a></p>\n</li>\n</ol>\n</div>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"5cea3a65-fbf6-57d3-83bc-89bd130009b4"}}