{"data":{"wordpressPost":{"title":"Livecoding recap #40: react-navigation with React Native","content":"<p><em>This is a Livecoding Recap – an almost-weekly post about interesting things discovered while livecoding. Usually shorter than 500 words. Often with pictures. Livecoding happens almost <strong>every Sunday at 2pm PDT</strong> on multiple channels. You should follow <a href=\"https://www.youtube.com/channel/UCoyHgaeLLI7Knp7LDHOwZMw\">My Youtube</a> channel to catch me live.</em></p>\n<p>I channeled my inner Darth Vader yet again. Still don&#8217;t know why my sound is garbled on YouTube, but works on LiveEdu. They&#8217;re both using the same stream 😕</p>\n<p><iframe width=\"853\" height=\"480\" src=\"https://www.youtube.com/embed/OFx8tMvpNj0\" frameborder=\"0\" allowfullscreen></iframe></p>\n<p>This weekend, I wanted to try out <a href=\"https://reactnavigation.org/\"><code>react-navigation</code></a> because I&#8217;ve heard a lot about it. Supposed to be the big new (official) thing since <code>Navigator</code> was deprecated in April.</p>\n<p>So I set out to build a travel app. You say where you&#8217;re going, app tells you what to pack. I have no idea where I&#8217;m going to get lists of what to pack for different situations, but it seemed like a good way to try react-navigation.</p>\n<p>Looks a bit like this:</p>\n<img class=\"alignnone size-full wp-image-7639\" src=\"https://swizec.com/blog/wp-content/uploads/2017/06/travel-app.gif\" width=\"554\" height=\"982\" />\n<p>Pictures are from Flickr. I figured out how to do that in <a href=\"https://school.shoutem.com/lectures/build-react-native-music-app-tutorial-part1/\">my Music App tutorial</a>. Maybe I should make an opensource &#8220;show random pretty pic from Flickr&#8221; component. Seems useful 🤔</p>\n<p>Anyway, pics from Flickr, navigation done via <code>react-navigation</code>, lists of choices done by hand. No biggie there… still not sure how I&#8217;m going to get packing recommendations.</p>\n<p>I wonder how difficult it would be to add crowdsourcing to the app… a bit of Firebase, some setup, a call or two… hmmmm. We&#8217;ll see.</p>\n<p>Either way, expect an in-depth tutorial about all of this on <a href=\"reactnative.school\">reactnative.school</a> come Tuesday. Maybe Wednesday if I decide to wait for my new laptop to arrive.</p>\n<p>Really, the hardest part of today&#8217;s livecoding was dealing with my computer. Damn thing is so slow when running OBS and <a href=\"https://swizec.com/blog/connected-canon-dslr-webcam/swizec/7477\">connecting to my DSLR</a> that it took 15 minutes to compile the initial blank app.</p>\n<p>And animations were slow in the iOS simulator and interaction was painful and I could barely type in the chatroom and even the Flickr images were taking way too long to show up. Just watch the stream video; it&#8217;s painful as hell.</p>\n<p>Reminds me of playing Resident Evil on my 166MHz machine with 16MB RAM back in middle school. I&#8217;d read books during the door opening animations.</p>\n<p>These ones:</p>\n<p><iframe width=\"853\" height=\"480\" src=\"https://www.youtube.com/embed/ZNU29JfzKOI\" frameborder=\"0\" allowfullscreen></iframe></p>\n<p>Yeah, that used to take 5 minutes on my computer in middle school 😀</p>\n<p>Great game tho. Much fun.</p>\n<p>So yeah, fun livecoding, we made something pretty, then I ragequitted because I couldn&#8217;t deal with my laptop anymore. Thank &lt;insert nerd deity&gt; that I&#8217;m getting a new one in the mail this Wednesday.</p>\n<p>Then all will be better, right?</p>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"f9b3f03b-1048-5b1a-9239-aa727306b8dd"}}