{"data":{"wordpressPost":{"title":"Pingvinske vrste","content":"<p>\n Zadnje Äase se je nabiralo veliko stvari, ki bi jih bilo treba povedati, a zelo malo Äasa za poÄetje le-tega, tako da sku&scaron;ajmo to popraviti s prvo pripovedjo v kronolo&scaron;kem redosledu in potem druge v najkraj&scaron;em moÅ¾nem Äasu.\n</p>\n<p>\n V sredo sem nepopravljivo skvaril svoje raÄunalo in bolj ko sem ga sku&scaron;al popraviti manj stvari je delovale. Iz teh kaotiÄno fatalnih razmer je zrasla moja odloÄitev. Spremenil bom okus pingvinov, ki upravljajo male zobnike v diferenÄnem stroju pod mojo mizo. Lotil sem se dolpotega Kubuntuja.\n</p>\n<p>\n Takoj sem opazil, da v osnovi delujoÄa in&scaron;talacija Kubuntuja traja le dobro uro ali dve v primerjavi z Getnoojevima dvema dnevoma. Kmalu sem tudi opazil kako hitro taista in&scaron;talacija raste in se debeli v nekaj bolj po moji meri, paketki so se nalagali in postavljali s prav v&scaron;eÄno frekvenco.\n</p>\n<p>\n Nastavljanje mojega ATIja X1600 v dvoekranski naÄin je potekalo malÄek hitreje kot poprej&scaron;njikat, okoli dve ure igraÄkanja, predvsem zaradi shranjenih konfiguracij od prej in verjetno nekaj izku&scaron;enj, ki so mi bile ostale. Naslednja stvar na agendi je bila nastavljanje zvoka na malo bolj&scaron;e performanse, v katerem trenutku je sovjo debelo grdo glavo pokazala najveÄja linuxova pomankljivost &#8211; ni preprostega naÄina za nastavljanje zvoka, sploh. Trenutno lahko, kot kaÅ¾e, izbirem med pravim dmixom ali 5.1 zvokom.\n</p>\n<p>\n NajveÄja teÅ¾ava, ki jo imam s Kubuntujem, je da iz nekega sumljivega razloga ni repozitorijih ni Opere, zakaj ne, ne vem. Velik problem je tudi teÅ¾aven postopek za usposabljanje mp3 in nasplo&scaron;no multimedija podpore. ÄŒe je to neka distribucija za zaÄetnike, zakaj vraga je torej potrebnih toliko majÄkenih korakcov za dosego tistega kar naj bi vsako namizno raÄunalo zmoglo?</p>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"e7601293-57c7-5be7-aa13-148fdb3735dc"}}