{"data":{"wordpressPost":{"title":"Blogolicious envy","content":"<p>\n  Not long ago my bird, as some have taken to labeling her, mentioned that she is envious of my writing vigour and style, of how my words seem to simply flow without effort. She got specifically bummed after I mentioned that these blog posts are posted as-is. No editing, no great thought, just a flow of rambling as it jumps out of my throbbing brain.\n</p>\n<p>\n  But there&#39;s really nothing to it. This is how I think, this is how my brain works. Words have always been a trivial matter to me &#8230; actually since as long as I can remember I could go into long yappings over anything. I was very opinionated even as a young child and once I discovered the written word nothing could really stop me. The first time I tried writing a book I was around ten and have been trying, without success, to write a book ever since.\n</p>\n<p>\n  I guess it&#39;s merely a matter of practice. The more you think, talk, write, the better you are at words. As soon as you become too aware of what you&#39;re saying, of what you&#39;re writing, the words become forced, even raped and they drag through the receiver&#39;s mind like barbbed wire. Of course this is not to be confused with properly polished writing that comes from a third rendition of that first jumble of words. But that&#39;s reserved only for things that are art and need to be good.\n</p>\n<p>\n  To finish this particular ramble off, I&#39;d just like to point out that at times I am quite jealous of <a href=\"http://www.vijavaja.com/enter/cenca/dnevnik_podrob.php?ID=57451\" target=\"_blank\">the girl&#39;s own blog</a> because, sometimes, it tickles my spider senses and sends a shiver of depth and emotion through me. Sometimes &#8230; that blog is just pure emotion and it is <em>always</em> an elatic read.</p>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"26bf2b76-084e-5fa1-8336-0bbba60a43c9"}}