{"data":{"wordpressPost":{"title":"Hug a developer","content":"<p>\n<object classid=\"clsid:D27CDB6E-AE6D-11cf-96B8-444553540000\" codebase=\"http://download.macromedia.com/pub/shockwave/cabs/flash/swflash.cab#version=6,0,29,0\" width=\"425\" height=\"344\"><param name=\"movie\" value=\"http://www.youtube.com/v/1lqxORnQARw&amp;hl=en&amp;fs=1\" /><param name=\"quality\" value=\"high\" /><param name=\"menu\" value=\"false\" /><param name=\"wmode\" value=\"\" /><embed src=\"http://www.youtube.com/v/1lqxORnQARw&amp;hl=en&amp;fs=1\" wmode=\"\" quality=\"high\" menu=\"false\" pluginspage=\"http://www.macromedia.com/go/getflashplayer\" type=\"application/x-shockwave-flash\" width=\"425\" height=\"344\"></embed></object>\n</p>\n<p>Everything the video<em> Hug a developer</em> says is true &#8211; there probably isn&#39;t a job more difficult than being a developer, at least no intellectual job can be much more difficult. Yes we&#39;re like gods to other less perfect beings and yes we do appear omnipotent and like we know everything, but the fact of the matter is our lives are hard.\n</p>\n<p>\nMost of what makes our lives hard are ignorant bosses who know next to nothing about our work seeming as how it&#39;s simply not very much like any other type of office work out there whereas they seem to think it is. People just don&#39;t understand that developing takes time, they think it&#39;s like writing a text, simpler perhaps, and no matter how often you tell them that you need to at least know what the hell it is you&#39;re supposed to do before doing it and preferably before running out of time, they will still change specs whenever they please. Somehow bosses just can&#39;t seem to comprehend the fact that changing a line or two in a large specification doesn&#39;t take changing a line or two in the code, but could actually mean weeks more work.\n</p>\n<p>\nBut after all, I would rather work for three ignorant bosses who couldn&#39;t understand even each other at once than see my girlfriend in such a state as I saw her this morning &#8230; it did however make me feel very powerful and like a god amongst the masses.</p>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"faa31656-bb27-5c23-81d2-7c29bc723b18"}}