{"data":{"wordpressPost":{"title":"Why I only work with startups","content":"<p>As a freelancer with a tinge of an online presence I often get to be picky about whom I work with. In a sense this ties into my post about <a title=\"We are not generation sell\" href=\"http://swizec.com/blog/we-are-not-generation-sell/swizec/2926\">the mindset of the current generation</a>&#8211; I&#8217;m not picky because I get so many offers, I&#8217;m picky because I like to enjoy my work.</p>\n<div style=\"width: 250px\" class=\"wp-caption alignright\"><a href=\"http://www.flickr.com/photos/55247267@N00/4610893696\"><img class=\"zemanta-img-inserted zemanta-img-configured\" title=\"Tokyo Tower\" src=\"http://swizec.com/blog/wp-content/uploads/2011/11/4610893696_7d66700b4d_m1.jpg\" alt=\"Tokyo Tower\" width=\"240\" height=\"160\" /></a><p class=\"wp-caption-text\">Image by konishiroku_ via Flickr</p></div>\n<p>This is why I only work with startups.</p>\n<p>Yes, I&#8217;ve worked with nonstartups before, I no longer want to; enough of that nonsense. Nonstartups are just inherently annoying and horrible to work with, rather than filling me with a sense of pride those projects always make me feel feel like I just sold my body to the ugliest hairyest guy on the block (not that I&#8217;ve done this before, I&#8217;m guessing)</p>\n<p>So what are the top few reasons I love working with startups?</p>\n<p><strong>1. Working directly with calling-the-shots people</strong></p>\n<p>Having a direct contact to people calling the shots is very important for me. It allows me to get a sense for what they actually want, rather than just what words are coming out of their mouth. This way I can focus my efforts on what really matters when it matters &#8211; sometimes it&#8217;s just better to Get It Working than doing it right.</p>\n<p>In a big corporation orders trickle down through a chain, getting reimagined and reinterpreted on every step and when they finally get to you, there&#8217;s only a sense of what you were told to do and all sense of what matters is lost.</p>\n<p><strong>2. Impact</strong></p>\n<p>Directly tied to the sense of context, is having an impact in the company. When somebody is just starting out with their product, you&#8217;re helping to shape their vision, you can give good feedback and make use of your experience &#8211; in a sense you&#8217;re helping somebody achieve their dream and that&#8217;s a Great Feeling &#8482;.</p>\n<p>Working as an emotionless engineer, a faceless cog who just gets his part done in the big machine &#8230; well I&#8217;m sure you can imagine how that doesn&#8217;t even begin to compare.</p>\n<p><strong>3. The fast pace</strong></p>\n<div style=\"width: 250px\" class=\"wp-caption alignleft\"><a href=\"http://www.flickr.com/photos/36093266@N06/4631606862\"><img class=\"zemanta-img-inserted zemanta-img-configured\" title=\"Fast gul\" src=\"http://swizec.com/blog/wp-content/uploads/2011/11/4631606862_5148f506ef_m3.jpg\" alt=\"Fast gul\" width=\"240\" height=\"131\" /></a><p class=\"wp-caption-text\">Image by aginorz via Flickr</p></div>\n<p>A great thing of a small team is the fast pace everything moves at. Since you&#8217;re talking directly to those in charge and everyone shares the vision at least a bit (otherwise why work for this startup?) everything moves quickly. An idea is pushed into the system and a couple of days later it can be implemented and tested.</p>\n<p>Conversely when working with an established organization, somebody gets an idea, there is a meeting for those responsible of the creative vision shaping, then a meeting between a representative of the leader class and a representative of the implementation class. Then the implementation class has a meeting of their own. By the time you start working on something months might have passed and even the original idea-giver has probably already lost passion.</p>\n<p><strong>4. Interesting work</strong></p>\n<div style=\"width: 310px\" class=\"wp-caption alignright\"><a href=\"http://commons.wikipedia.org/wiki/File:Bicycle_Wheels.jpg\"><img class=\"zemanta-img-inserted zemanta-img-configured\" title=\"Some interesting early attempts at suspension.\" src=\"http://swizec.com/blog/wp-content/uploads/2011/11/300px-Bicycle_Wheels1.jpg\" alt=\"Some interesting early attempts at suspension.\" width=\"300\" height=\"206\" /></a><p class=\"wp-caption-text\">Image via Wikipedia</p></div>\n<p>The work at startups is usually more interesting as well. Might be because I enjoy working with new technologies and startups are likelier to take a risk with new technology. Or maybe it&#8217;s just because I like working on products helping actual people rather than faceless hypothetical entities.</p>\n<p>A pain point working for established companies is that you often edn up working on internal tools aimed at internal tools aimed at internal people for internal purposes. Sometimes they never even get pushed into production because some boss up high was fired and the new one must assert his rule.</p>\n<p><strong>5. No politics</strong></p>\n<p>I haven&#8217;t personally had to deal with a lot of politics, but I&#8217;ve talked to people working in government all their lives &#8211; some times it feels like the sole reason they even go to work is to deal with the other people working there.</p>\n<p>You know, instead of doing their job.</p>\n<p><strong>6. Self-organization</strong></p>\n<p>What I love about small teams comes directly from the fact there are no people whose sole purpose in life is looking after you. Because everyone in a small team is a focused professional a sense of trust is built; people no longer feel like they have to check up on everythign everyone does, you can just give the team some loosely defined orders and they&#8217;ll figure it out.</p>\n<div style=\"width: 310px\" class=\"wp-caption alignleft\"><a href=\"http://en.wikipedia.org/wiki/File:SculptureMQ2.JPG\"><img class=\"zemanta-img-inserted zemanta-img-configured\" title=\"Nigel Harrison's Autonomy - Near MGSM hotel\" src=\"http://swizec.com/blog/wp-content/uploads/2011/11/300px-SculptureMQ23.jpg\" alt=\"Nigel Harrison's Autonomy - Near MGSM hotel\" width=\"300\" height=\"217\" /></a><p class=\"wp-caption-text\">Image via Wikipedia</p></div>\n<p>Startups in general care more about results than how you actually do something. If you can make a good case for why you chose to do something they way you chose to do it, and if it works, nobody really cares.</p>\n<p>In a corporation with many layers of management it becomes much more important for managers to feel useful and so they get int he way. This is also a self-fullfiling prophecy since all the good people leave and in the end you actually _need_ tiger management.</p>\n<p><strong>7. Simpler money on clearer terms</strong></p>\n<p>Wasn&#8217;t sure if I should include this at first, but it&#8217;s kind of important.</p>\n<p>When it comes to money, big organizations and government-like entities are always convoluted, take forever to pay up and it never goes smoothly. Probably stems from the fact that everyone involved has their cushy job, gets paid a fixed amount of money on the same date every month and they simply have no empathy for the poor freelancer trying to make a living client to client.</p>\n<p>I mean, obviously, why should it be a problem to deliver a project quickly and then wait a month to get paid? And what do you mean you&#8217;re annoyed when it takes us two weeks to process the paperwork because that one guy is on vacation?</p>\n<p>Almost no matter how much you charge these people it always feels like you aren&#8217;t being paid enough to deal with their bullshit.</p>\n<p>In a startup there&#8217;s none of that. Everyone involved is much more down to earth and respects the feeling of urgency when it comes to money. I like that.</p>\n<h2>Conclusion</h2>\n<p>To sum it all up, working for startups is more enjoyable and personal, more interesting on a technical level and generally free of that feeling like you&#8217;re trying to run with an open parachute strapped to your back.</p>\n<p>Anyone working with big corps care to disagree?</p>\n<h6 class=\"zemanta-related-title\" style=\"font-size: 1em;\">Related articles</h6>\n<ul class=\"zemanta-article-ul\">\n<li class=\"zemanta-article-ul-li\"><a href=\"http://holykaw.alltop.com/how-to-keep-your-startup-employees\">How to keep your startup employees</a> (holykaw.alltop.com)</li>\n<li class=\"zemanta-article-ul-li\"><a href=\"http://freelanceswitch.com/the-business-of-freelancing/pitching-to-startups/\">4 Questions to Ask Startups Before Pitching</a> (freelanceswitch.com)</li>\n<li class=\"zemanta-article-ul-li\"><a href=\"http://davidcummings.org/2011/07/30/when-good-people-work-on-bad-startups/\">When Good People Work on Bad Startups</a> (davidcummings.org)</li>\n<li class=\"zemanta-article-ul-li\"><a href=\"http://avichal.wordpress.com/2011/11/14/build-something-people-want-is-not-enough/\">&#8220;Build something people want&#8221; is not enough</a> (avichal.wordpress.com)</li>\n<li class=\"zemanta-article-ul-li\"><a href=\"http://techcrunch.com/2011/11/14/looking-to-hire-top-talent-for-your-startup-here-are-five-things-you-should-know/\">Looking To Hire Top Talent For Your Startup? Here Are Five Things You Should Know.</a> (techcrunch.com)</li>\n<li class=\"zemanta-article-ul-li\"><a href=\"http://venturebeat.com/2011/10/24/how-to-know-when-to-leave-your-startup/\">How to know when to leave your startup</a> (venturebeat.com)</li>\n</ul>\n<div class=\"zemanta-pixie\" style=\"margin-top: 10px; height: 15px;\"><a class=\"zemanta-pixie-a\" title=\"Enhanced by Zemanta\" href=\"http://www.zemanta.com/\"><img class=\"zemanta-pixie-img\" style=\"border: none; float: right;\" src=\"http://img.zemanta.com/zemified_e.png?x-id=2baecdf4-23e4-4ba0-b85c-ede9cef82393\" alt=\"Enhanced by Zemanta\" /></a></div>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"d13f0958-a9ae-56da-9d5d-5c54302db649"}}