{"data":{"wordpressPost":{"title":"Internet drama","content":"<p>\n The internet is vast and it is large, but most of all it&#39;s huge beyond comprehension. Today we are going to look into a very interesting aspect of internet life &#8211; drama. Just why exactly does it exist and why the hell is it even remotely tolerated?\n</p>\n<p>\n Well I have no idea, but I can tell you a little bit about it. Many people get very personal with online communities and that&#39;s good, it&#39;s very good in fact, but it can go a bit too far. For example when people leave for extended periods of time and then return, they mostly tend to announce their return with a thread and try making a big fuss about it. This isn&#39;t too bad, it shows them who&#39;s still available that they remember and it brings old friends together &#8230; all around pretty decent.\n</p>\n<p>\n The really annoying ones are those who choose to publicly announce their leaving and try making it a big deal. Almost like &quot;Look at me, I&#39;m leaving because I don&#39;t like you all, now I want you all to cry over me even though I claim I will never check back again at all.&quot; Firstly, why would you need a thread that you&#39;re never checking again? Secondly why should we feel bad about loosing you? Clearly you don&#39;t like us and we probably don&#39;t like you either.\n</p>\n<p>\n A forum I&#39;m frequenting lately is going through this right now. A person was being a total tart in the IRC channel, or so rumour has it, and it was so bad as to make the poor admin-lass claim she hates IRC all over and that it reminded her of why she hated people in the first place &#8230; she isn&#39;t returning. The person got banned and then walced onto the forum, made a big triumphant post about leaving forever and eve, and that they blocked everyone from the board they had on MSN or any other IM. Yay, good for you mr. person, why are you telling us this again? Being an attention seeking spoilt brat are we?\n</p>\n<p>\n In conclusion, don&#39;t make internet drama, it makes you look like a twelve year old.</p>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"31815e3e-9867-5495-a610-801dc50225b9"}}