{"data":{"wordpressPost":{"title":"jQuery imageless buttons a la Google take two","content":"<p>On Monday I released these buttons and as many of you noted I seriously didn&#8217;t do nearly enough testing and what&#8217;s worse, I even bragged about the fact. But some of you perhaps noticed my edits to the blogpost where I said I&#8217;d make it all better. Well, here&#8217;s Wednesday and I made it all better while still, as promised, spending much less time than Google probably did. Think I&#8217;ve spent under 20 hours for the whole thing from inception to finish (now). If you&#8217;re lazy just head over to the <a href=\"http://swizec.com/code/styledButton\">jQuery imageless buttons a la Google examples/documentation</a> page.</p>\n<p>Let&#8217;s start off with a screenshot of what the buttons look like on modern browsers</p>\n<img src=\"http://swizec.com/code/styledButton/normal_example.png\" border=\"0\" alt=\"Imageless buttons on proper browsers\" title=\"Imageless buttons on proper browsers\" width=\"723\" height=\"174\" />\n<p>I spent a good deal of last night making sure they also look like this on many older browsers, in fact these are now officially supported:<br /> Opera 9.6x<br /> Firefox 3<br /> Firefox 2<br /> Safari 3<br /> Safari 2<br /> Internet Explorer 8 beta<br /> Internet Explorer 7<br /> Internet Explorer 6<br /> Chrome</p>\n<p>And I seriously hope that&#8217;s enough for your needs, if supporting all of those isn&#8217;t enough for you then I&#8217;m not certainit&#8217;s even possible to satisfy your needs. Personally I must admit I&#8217;ve learned a lot in getting all of these browsers to work. Most of all that Firefox 2 doesn&#8217;t have an inline-block, but rather a -moz-inline-block for some strange reason. It&#8217;s also interesting to not that Safari 2 and IE break when you have trailing commas in your lists of properties, which I&#8217;m used to so it&#8217;s easier to add stuff.</p>\n<p>Anyhow, here&#8217;s what the buttons look like in Firefox 2</p>\n<img src=\"http://swizec.com/code/styledButton/FF2_example.png\" border=\"0\" alt=\"Imageless buttons in Firefox 2\" title=\"Imageless buttons in Firefox 2\" width=\"736\" height=\"171\" />\n<p>And what they&#8217;re like Internet Explorer 6</p>\n<img src=\"http://swizec.com/code/styledButton/ie6_example.png\" border=\"0\" alt=\"Imageless buttons in IE6\" title=\"Imageless buttons in IE6\" />\n<p>I should probably also note that there are two known issues with the buttons. Namely that in Internet Explorer onchange events don&#8217;t work since it doesn&#8217;t allow firing them on noninput elements and that in IE the darker border on the right vanishes on activated buttons for some reason, I was simply too tired to hunt this one down and you know what, I can live with a minor glitch such as that.</p>\n<p>Since you&#8217;re still reading, please head over to the <a href=\"http://swizec.com/code/styledButton\">jQuery imageless buttons a la Google</a> examples now.</p>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"73027541-7763-5d83-b88a-6db88158f828"}}