{"data":{"wordpressPost":{"title":"What happened to React + D3v4?","content":"<p><iframe width=\"853\" height=\"480\" src=\"https://www.youtube.com/embed/fk7QJuVK3FM\" frameborder=\"0\" allowfullscreen></iframe></p>\n<p>In December or November last year, I made a string of big promises. I&#8217;m gonna have the <a href=\"https://gum.co/mTWg\">all new version of React+D3v4</a> ready by Christmas, it&#8217;s gonna be amazing, there&#8217;s an interactive video course coming in January or February, and a brand new D3v4 cheatsheet. All the things!</p>\n<p>It is now May.</p>\n<p>All I&#8217;ve achieved is that I pissed off my girlfriend. Working over Christmas was a dumb idea, and I&#8217;m dumb for having thought of it.</p>\n<p>Book… good progress, valiant effort, still not done. I have all the new examples and projects. I&#8217;ve finished all the theoretical parts and the big fat practical part. I&#8217;ve done the animation bits as well.</p>\n<p>Interactive course and videos… haven&#8217;t even started. Gotta finish the source book first!</p>\n<p>Here&#8217;s what happened:</p>\n<p>In November, I started talking with Shoutem, and we came up with <a href=\"http://reactnative.school\">React Native School</a>. Originally my plan was to finish React+D3v4, leave a month of buffer to recuperate, then dive into building a new React Native app every two weeks for React Native School.</p>\n<p>That did not quite work out. But I still had to start React Native articles in February. That&#8217;s <a href=\"http://reactnative.school\">been going pretty well</a>. New app almost every two weeks, the trip to Europe messed up my schedule a bit, but I&#8217;m getting back into it.</p>\n<p>Because of the increased workload though, I haven&#8217;t been able to work on the book as much. Or at all, really.</p>\n<p><strong>BUT</strong> on my flight back from Europe, I was able to touch up and fix the Redux animation particles example. It&#8217;s shiny and useful and fits React 15.5.x now.</p>\n<p>Then over the last week of jetlag early mornings, I kept writing and writing, and now the canvas section is done. A whole brand new section on using HTML5 Canvas to build declarative bitmaps and making your animations speedy.</p>\n<p>Even finished the first React + Canvas example. The particle generator pushed to 20,000 elements. It&#8217;s great.</p>\n<p>So here&#8217;s the deal: By the end of this month, I&#8217;ll have the book fully finished. The missing parts are:</p>\n<ul>\n<li><a href=\"https://swizec.com/blog/n-body-collision-simulation-react-d3-mobx/swizec/7497\">n-body collision simulation with D3, MobX, and Canvas</a> example</li>\n<li><a href=\"https://swizec.com/blog/dancing-tree-fractal-react/swizec/7288\">Dancing tree fractal</a> and comparison of React alternatives</li>\n<li>some tips on performance</li>\n</ul>\n<p>That&#8217;s it. That&#8217;s all I have to write to finish the book. I can totally do that in the next 3 weeks even while doing React Native School. Especially because the two big chapters already exist as blog posts. That makes it easier.</p>\n<p>Wish me luck.</p>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"d113fa66-b5df-538b-9f96-693968bdb142"}}