{"data":{"wordpressPost":{"title":"Advent of Code Day 13, Packet Scanners","content":"<p><iframe width=\"580\" height=\"326\" src=\"https://www.youtube.com/embed/3abrq1N5ITU?feature=oembed\" frameborder=\"0\" gesture=\"media\" allow=\"encrypted-media\" allowfullscreen></iframe></p>\n<p><a href=\"https://adventofcode.com/\">Advent of Code</a> is an advent calendar for coders. A daily puzzle that exercises that algorithmic part of coding that you don&#8217;t usually get to use in day to day programming.</p>\n<p>Here&#8217;s what mine looks like right now 👇</p>\n<img class=\"alignnone size-full wp-image-7960\" src=\"https://swizec.com/blog/wp-content/uploads/2017/12/Screen-Shot-2017-12-13-at-08.14.34-inline.png\" width=\"800\" height=\"711\" srcset=\"https://swizec.com/blog/wp-content/uploads/2017/12/Screen-Shot-2017-12-13-at-08.14.34-inline.png 800w, https://swizec.com/blog/wp-content/uploads/2017/12/Screen-Shot-2017-12-13-at-08.14.34-inline-300x267.png 300w, https://swizec.com/blog/wp-content/uploads/2017/12/Screen-Shot-2017-12-13-at-08.14.34-inline-768x683.png 768w\" sizes=\"(max-width: 800px) 100vw, 800px\" />\n<p>The game works like this: Every day at midnight, a new puzzle opens up. It follows a storyline of traveling through a computer. You start with some memory access, go through registers and CPUs, and on Day 13, we dealt with some firewalls.</p>\n<p><a href=\"https://www.youtube.com/playlist?list=PLF8WgaD4xmjWaUkBRoQiYGCV3WSKRH0pU\">I&#8217;ve been playing with it</a> in Haskell and Python. Python because it&#8217;s perfect for algorithmic puzzles like this, Haskell because I wanted to brush up. Been years since I did Haskell. I miss Haskell.</p>\n<p>JavaScript is clunky for this sort of thing. 🤷‍♀️</p>\n<p>You can <a href=\"https://github.com/Swizec/advent-of-code-2017\">see my code on Github</a>. You should join my leaderboard, too. Some friendly competition that I am currently losing. 👉 <code>193241-e9880d10</code></p>\n<h2>Packet Scanners in Haskell</h2>\n<p>On Day 13, we had to fly through a firewall without getting found by the scanners.</p>\n<blockquote><p>\nYou need to cross a vast firewall. The firewall consists of several layers, each with a security scanner that moves back and forth across the layer. To succeed, you must not be detected by a scanner.\n</p></blockquote>\n<blockquote><p>\nBy studying the firewall briefly, you are able to record (in your puzzle input) the depth of each layer and the range of the scanning area for the scanner within it, written as depth: range. Each layer has a thickness of exactly 1. A layer at depth 0 begins immediately inside the firewall; a layer at depth 1 would start immediately after that.\n</p></blockquote>\n<p>Visually that looks like this:</p>\n<pre><code>Picosecond 0:\n 0   1   2   3   4   5   6\n[S] [S] ... ... [S] ... [S]\n[ ] [ ]         [ ]     [ ]\n[ ]             [ ]     [ ]\n                [ ]     [ ]\n</code></pre>\n<p>Vertical columns are the firewall layers, <code>S</code> symbols are the packet scanners. Each picosecond they move down by <code>1</code>. At the bottom, they bounce back.</p>\n<p>We move one layer to the right on each picosecond. Always on the top row. Each time we are seen by a scanner (same position at same time), it adds <code>depth*range</code> to our travel cost.</p>\n<h3>Star 1</h3>\n<p>For the first star, we have to calculate how much it costs to get through the scanner.</p>\n<p>Rather than simulate the firewall and our travel through it, we can rely on two key insights:</p>\n<ol>\n<li>The depth of a layer is the same as the number of picoseconds it takes to get to it. Layer 0 is at 0 picoseconds, layer 10 at 10, 90 at 90, and so on.</li>\n<li>Scanners return to their 0th position periodically. We can calculate if a scanner is at 0 for any particular picosecond.</li>\n</ol>\n<p>Finding the series formula for #2 was the tricky part because I suck at finding series formulas by inference. This is the pattern 👇</p>\n<pre><code>A scanner with range 1, is at 0 every 1 picosecond.\n\nWith range 2, every 2 picoseconds\n3, every 4 picoseconds\n4, every 6 picoseconds\n5, every 8\n6, every 10\n...\n</code></pre>\n<p>You might find it obvious, but it wrinkled my brain six ways to Sunday. A scanner returns to 0 every <code>range*2-2</code> picoseconds.</p>\n<p>That means we can see if a scanner is at zero at any particular time by checking the modulus with time 👉 <code>time % (range*2-2) == 0</code></p>\n<p>Since we know we reach each layer at the depth of that layer, we can substitute <code>time</code> for <code>depth</code> and calculate the cost, or severity, at each layer with this function 👇</p>\n<pre lang=\"haskell\">\nseverity::(Int, Int) -> Int\nseverity (depth, range)\n    | mod depth (range*2-2) == 0 = depth * range\n    | otherwise = 0\n</pre>\n<p><code>severity</code> takes a tuple of two integers, a depth and a range, and checks if the scanner on that layer is at position <code>0</code> when we reach it. If it is, it returns <code>depth*range</code> the cost of getting caught; otherwise, it returns <code>0</code>. No cost.</p>\n<p>We can then use this function to <code>sum</code> the cost of our entire trip.</p>\n<pre lang=\"haskell\">\nstar1::[String] -> Int\nstar1 input = sum $ map severity $ prepInput input\n</pre>\n<p><code>star</code> takes a list of strings and returns an integer. First, it parses the list of strings into a list of <code>(depth, range)</code> tuples. That&#8217;s <code>prepInput</code>, and it&#8217;s <a href=\"https://github.com/Swizec/advent-of-code-2017/blob/master/13.hs#L50\">not very interesting</a>.</p>\n<p>After the input is parsed, we <code>map</code> through with the <code>severity</code> function to get a list of costs for every layer, and <code>sum</code> them up. That&#8217;s our result.</p>\n<h3>Star 2</h3>\n<p>Star 2 adds an interesting twist to the story. We have to avoid getting caught.</p>\n<blockquote><p>\nNow, you need to pass through the firewall without being caught &#8211; easier said than done.\n</p></blockquote>\n<blockquote><p>\nYou can&#8217;t control the speed of the packet, but you can delay it any number of picoseconds. For each picosecond you delay the packet before beginning your trip, all security scanners move one step. You&#8217;re not in the firewall during this time; you don&#8217;t enter layer 0 until you stop delaying the packet.\n</p></blockquote>\n<p>Our goal is to find the smallest delay that gets us through the firewall uncaught.</p>\n<p>Uncaught is the same as cost of the trip being 0. That means we can use the <code>severity</code> function from before.</p>\n<p>Since we think of each layer&#8217;s depth as the picosecond when we reach that layer, we can fake the delay by making the entire firewall deeper. That means adding <code>+1</code> to every layer until the cost of our trip becomes zero.</p>\n<pre lang=\"haskell\">\nsmallestDelay::[(Int, Int)] -> Int\nsmallestDelay input\n    | sum severities == 0 = delay\n    | otherwise = smallestDelay $ map (\\(a,b) -> (a+1, b)) input\n    where severities = map severity input\n          (delay, _) = head input\n</pre>\n<p><code>smallestDelay</code> takes a list of <code>(depth, range)</code> tuples and returns an integer. If the <code>sum severities</code> (cost of our trip) is <code>0</code>, we return the current delay; otherwise, we construct a new faux firewall whose layers are shifted by <code>+1</code>.</p>\n<p>Each time we do this, we use <code>map severity input</code> to get a list of costs and take the <code>head</code> of our input firewall to see the delay. Since we&#8217;re shifting the whole firewall, the &#8220;depth&#8221; of the first layer represents our delay.</p>\n<p>And that&#8217;s the solution in Haskell 🤓</p>\n<p>Happy hacking.</p>\n<p>PS: in <a href=\"https://www.youtube.com/watch?v=3abrq1N5ITU\">the video</a>, you can see me trying to solve Day 12 as well. That&#8217;s because I&#8217;m behind and playing catchup.</p>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"9c6c5423-e870-5298-af42-cfe88607c460"}}