{"data":{"wordpressPost":{"title":"Fool of an april","content":"<p>\n April fools has been a long honoured tradition in society, in fact dating way way back to the days of the calendar change from Julian to Gregorian. If you happen to be ignorant, Gregorian is the one we use today. The change switched the time of new year&#39;s from what was before new year&#39;s day to what is now 1st of April. I must say I don&#39;t quite understand how this happened since both calendars seem only to be out of sync by something like 20 days. So perhaps the said change happened at an even earlier calendar change and I&#39;ve been misinformed?\n</p>\n<p>\n Anyhow, the tradition used to be to make fun of those still celebrating new year&#39;s on the wrong day, whereas now it is just to &#8230; make fun of people. Usually I don&#39;t partake in this fun because it&#39;s always felt a bit silly, mostly because everyone got me and I never managed to get anyone and I happened to be a little cross about that. It sort of hurt my ego you know? Of course you do.\n</p>\n<p>\n But this year I got a really amazing idea because on the last of March I was reading about pranks a geek can pull. So &#8230; I pulled one and it was awesome. I changed the website of hte company I&#39;ve been working for lately into a rickroll, just to the inside of course, I&#39;m not that mean. It was really interesting seeing the people be bewildered by what&#39;s going on. A coworker, she&#39;s a bit of a gullible person, actually watched the whole video twice and not properly realise what&#39;s going on.\n</p>\n<p>\n The best reaction came from my boss who suddenly, a few hours after coming in, rushed to my desk and told me to open the website. I did. He looked at me all serious and asked if the site had been hacked and what the bloomin&#39; hell is going on? So I calmly, like I was explaining something very technical and contemplating reasons for the event, said that it was a prank I pulled for april fools. He seemed to be thinking for about thirty seconds when he finally got what was going on. He proved that he&#39;s a great boss by laughing wholeheartedly. In fact, right before leaving he even congratulated me on the great prank.\n</p>\n<p>\n Don&#39;t think anyone got me, if they did it wasn&#39;t very obvious and they didn&#39;t tell me afterwards &#8230; all in all, a good april fools.</p>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"c80c112a-50b5-52bc-9ba6-380b4c3a32eb"}}