{"data":{"wordpressPost":{"title":"I love being a geek","content":"<a href=\"http://www.flickr.com/photos/aaronbassett/3817371960/\"><img class=\"alignnone\" title=\"Geek shelf by Aaron Bassett\" src=\"http://farm3.staticflickr.com/2554/3817371960_1d173bd07f_z.jpg\" alt=\"Geek shelf by Aaron Bassett\" width=\"640\" height=\"360\" /></a>\n<p>I have always seen myself as a stereotypical geek. Kind of introverted, not very athletic, infinitely excitable about the strangest of things, spends more time with people on the internet than talking face-to-face, prefers it even.</p>\n<p>And I love being that. The infinite freedom that comes with being a geek is intoxicating.</p>\n<p>While normal people have to worry about keeping appearances, about maintaining a fine-knit web of social interaction through a series of carefully maintained half truths, I can just be myself. Because I&#8217;m a geek.</p>\n<p>People pretending they like certain things, pretending they care about this or that issue, just to fit in. Just so they&#8217;ll be liked. As a geek I don&#8217;t have to do any of that.</p>\n<p>As a geek I can shout at the top of my lungs <em>&#8220;I don&#8217;t understand football&#8221;</em> at the height of football fever during a world championship. Nobody minds, nobody laughs, they just explain the game. <em>&#8220;Don&#8217;t mind him, he&#8217;s a geek you see, he doesn&#8217;t get normal people stuff&#8221;</em></p>\n<p>When I was about ten years old I couldn&#8217;t get enough of <a class=\"zem_slink\" title=\"Five on a Treasure Island (Famous Five)\" href=\"http://www.amazon.com/Five-Treasure-Island-Famous/dp/0340796146%3FSubscriptionId%3D0G81C5DAZ03ZR9WH9X82%26tag%3Dageewitahat-20%26linkCode%3Dxm2%26camp%3D2025%26creative%3D165953%26creativeASIN%3D0340796146\" rel=\"amazon\" target=\"_blank\">The Famous Five series</a> by <a class=\"zem_slink\" title=\"Enid Blyton\" href=\"http://www.enidblytonsociety.co.uk\" rel=\"homepage\" target=\"_blank\">Enid Blyton</a>. Library copies were always tattered to bits and that just made them better. I don&#8217;t remember much, but I do remember one character clearly &#8211; The Scientist. He was <a class=\"zem_slink\" title=\"George Kirrin\" href=\"http://en.wikipedia.org/wiki/George_Kirrin\" rel=\"wikipedia\" target=\"_blank\">George</a>&#8216;s dad or uncle and his defining characteristic was that he was always kind of grumpy and locked up in his room where he was &#8220;doing science&#8221;.</p>\n<p>Not to be bothered. Not to be disturbed. Not to even be thought about too loudly. Lunch was often taken to his room because he would forget to eat.</p>\n<p>Imagine that!</p>\n<p>A guy who gets peace and quiet to work. All summer. In a house full of 12 year olds. That&#8217;s the power of being a geek.</p>\n<p>Geeks &#8211; the only people who get to truly be themselves even as adults. I love it! (said with my best Tennant impersonation)</p>\n<p>It&#8217;s all starting to unravel for me though. People are suggesting I might want to &#8220;grow up&#8221; &#8230; whatever that means.</p>\n<p>Just the other day someone mentioned I do a lot of sports. Ironically this happened at boxing practice; she spends 5 days a week there. A person who goes to practice 5 days a week thinks I do a lot of sports &#8230; I have never been so confused.</p>\n<p>A few days later I had a call with someone looking for &#8220;somebody older&#8221; to be a technical lead. An old sage to look over the rabble of Stanford grads he&#8217;s built a team out of. I&#8217;M TWENTY-FIVE!</p>\n<p>I hope it&#8217;s not too late for me. Save yourselves! Be geeky!</p>\n<div class=\"zemanta-pixie\" style=\"margin-top: 10px; height: 15px;\"><a class=\"zemanta-pixie-a\" title=\"Enhanced by Zemanta\" href=\"http://www.zemanta.com/?px\"><img class=\"zemanta-pixie-img\" style=\"border: none; float: right;\" src=\"http://img.zemanta.com/zemified_e.png?x-id=438c823e-3724-451f-9fb5-14ac805cded3\" alt=\"Enhanced by Zemanta\" /></a></div>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"61d80542-2275-52ad-a232-8afefb9ba0d9"}}