{"data":{"wordpressPost":{"title":"The story behind React + D3v4","content":"<p><iframe width=\"853\" height=\"480\" src=\"https://www.youtube.com/embed/4vTvXThQuXA\" frameborder=\"0\" allowfullscreen></iframe></p>\n<p>347 days ago, <a href=\"https://swizec.com/blog/work-on-reactd3js-es6-v2-begins-in-earnest/swizec/7010\">I said something stupid</a>.</p>\n<blockquote><p>\nHere’s my crazy plan: I want to launch React+D3js ES6 v2 in the first week of October. This time as a free upgrade for current users.\n</p></blockquote>\n<p>That did not happen. <a href=\"https://www.swizec.com/reactd3js\">React+D3v4</a> launched in August, some 10 months later than originally planned and a full 8 months after the preorder promised it would land. And it isn&#8217;t a free upgrade either; it&#8217;s a completely different book now.</p>\n<p>But yes, it was September 2016, and I was being dumb. You can&#8217;t rewrite a technical book in a month.</p>\n<p>Sure, I did write <a href=\"https://github.com/Swizec/react-d3js-ebook/tree/es5-version\">the first version</a> in 2 weeks. Around a month to learn React, combine it with D3, make an app, launch.</p>\n<p>That was fun. <a href=\"https://swizec.com/blog/how-a-book-i-wrote-in-two-weeks-made-4000-in-its-first-month/swizec/6675\">Even made $4,000 in its first month</a>. Not bad for a 79-page book.</p>\n<p>At the end of that post, I had this idea 👇</p>\n<blockquote><p>\nBut the biggest experiment to try is seeing if I can turn this into a system. Learn a tech, write about tech, launch book, once a month or every two months. Produce enough income to live off of.\n</p></blockquote>\n<blockquote><p>\nThat’s the ultimate experiment right there.\n</p></blockquote>\n<p>That has not happened.</p>\n<p>I can&#8217;t live off my books, and I definitely can&#8217;t launch a new one every month. But I <em>have</em> been launching a new one every year, and I’ve made almost $80,000 in lifetime revenue on Gumroad. That&#8217;s pretty cool, too.</p>\n<p>A lot of that revenue has gone to other authors during the <a href=\"https://swizec.com/blog/react-indie-bundle-report-or-how-we-made-31k-in-a-week/swizec/6762\">React Indie Bundle</a> sale. Around $35,000, I&#8217;d say, which still leaves almost $50,000 for me and my freelancers and tech toys and advertising <a href=\"https://swizec.com/blog/how-i-got-boned-by-taxes-two-years-in-a-row/swizec/7582\">and taxes</a>. So many taxes.</p>\n<img src=\"https://i.imgur.com/4vXRGQJ.png\" />\n<p>Fingers crossed I reach the $100k milestone this year 🤞</p>\n<p>Anyway, first version: Spring 2015, 79 pages, single example, happily doing sales at $9 a pop or something like that. That pricing was dumb, but you live and you learn.</p>\n<p>Second version came in Spring 2016. I think it landed around April or something. Improved code samples to use ES6, added a chapter on animation, rewrote most of the explanations. 117 pages, 2 project examples, always planned to make it better later.</p>\n<p>That one made 743 sales for a total of about $20,000. I was super happy about that as it was happening, not so much looking back.</p>\n<p><em>Imagine how well it would&#8217;ve done, if I knew everything I know now!? If I made the book better, if pricing was more aggressive, IF EVERY LITTLE THING WAS AS GOOD AS IT IS TODAY.</em></p>\n<p>Can you imagine? I would&#8217;ve been drowning in readers and fans and people suggesting improvements and making everything even betterer.</p>\n<img src=\"https://i.imgur.com/GUVBkgg.jpg\" />\n<p>Maybe this time! 🤞</p>\n<p><a href=\"https://www.swizec.com/reactd3js\">React+D3v4</a> is the best thing I&#8217;ve ever written [EDITOR’S NOTE: This is true]. 249 pages, 7 example projects, bonus chapter on React Native, learn basics in the browser, deep dive in the usual coding environment. Everything.</p>\n<p>It&#8217;s not just me. Even my editor is saying great things! And not just because I&#8217;m paying him. Hell, <em>test readers</em> agree too. Everyone loves it.</p>\n<blockquote><p>\nThe examples in V4 are off the hook. No wonder it’s been so much work. You have really extended the learning process into fun, interactive projects. I was specifically trying to learn topojson and map visualizations! What a breeze!\n</p></blockquote>\n<p>See. See!? I extended the learning process into fun, interactive projects. Exactly what I was going for 😁</p>\n<p>But here&#8217;s the thing: I fear I&#8217;m too late. I fear everyone who&#8217;s wanted to learn React already knows React. That everyone who wanted to build dataviz with React and D3 already knows how.</p>\n<p>I know on an intellectual level that new people step into JavaScript every day. That old people get new jobs with new challenges. I know that many people simply pick up new projects or decide to learn something new every day.</p>\n<p>A lot of people out there are learning JavaScript and figuring things out. More and more every day. <em>Those</em> are the people I can try to reach and lend a helping hand to.</p>\n<p>And maybe, just maybe, I can reach a stable level of making 2 or 3 sales per day by the end of this year. We&#8217;ll see.</p>\n<p>Until then, researching and writing <a href=\"https://www.swizec.com/reactd3js\">React+D3v4</a> has been fun. Now I gotta update my <a href=\"https://es6cheatsheet.com\">interactive ES6 cheatsheet</a>.</p>\n<p>Peace. ✌️</p>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"55773f62-7879-54e9-abd7-a9d62932523e"}}