{"data":{"wordpressPost":{"title":"Circles? Fuck circles. Hangouts? Buy me beer and we can hang","content":"<p>For the last two days the internets have been absolutely abuzz about the new social network Google has launched. Aptly named Google+.</p>\n<img style=\"float: right; height: 40%; margin: 15px;\" src=\"http://swizec.com/blog/wp-content/uploads/2011/07/KRd0W1.png\" alt=\"\" />\n<p>Everyone has their geeky panties twisted in a bunch over the amazing technical features, the marvelously awesome interface that&#8217;s really a thing to behold, and pretty much everyone is almost frothing at the mouth about how this is that awesome saviour of social networks everyone always needed. My god! Didn&#8217;t you know, social networking is a poor industry that needs to be saved. Saved I say!</p>\n<p>And this is it! Google+ is going to do it!</p>\n<p><em style=\"font-size: 1.3em;\">tl;dr &#8211;&gt; it&#8217;s just awesome enough that everything that&#8217;s wrong makes me rage</em></p>\n<p>Well, now that the initial excitement is over and everyone&#8217;s had their chance to use it. I think it&#8217;s time for us naysayers to come out of the woodwork and share a few words.</p>\n<p>Here&#8217;s the thing, Google+ is a marvelous feat of web engineering, it&#8217;s certainly the best [ab]use of web standards I&#8217;ve ever seen and I could only wish I had the chops to pull off something that worked as smoothly and as awesomely. The interface feels almost more native than my computer&#8217;s actual native interface.</p>\n<p>But &#8230; I don&#8217;t like it. There isn&#8217;t a single thing, outside the shiny interface, that I like about the whole service.</p>\n<p>As soon as I first tried to try it out it started rubbing me the wrong way by saying I&#8217;m not awesome enough to use it. Come on, really? Just because the default google account I&#8217;m signed in with isn&#8217;t gmail.com but swizec.com I have to be greeted with a pretty ugly page telling me I suck and not even giving me the option of switching?<br />\n<!--more--></p>\n<p>Ok, granted, small thing to fix and they&#8217;ll get around to it eventually. Multiple login is pretty new anyway.</p>\n<h2>My hard earned social graph. Gone!</h2>\n<p>The biggest thing that rubs me the wrong way is the complete and utter ignorance of my social graph. There&#8217;s a sort of lame feature of saying &#8220;hey, here are some random people from your email &#8230; try them&#8221;. And they were really really random, people I almost never exchange emails with, while at the same time people I actually do exchange emails with are nowhere to be found.</p>\n<p>What happened to all my friends on twitter? The close-ish friends I have on facebook? And really facebook is the best guess for me, I keep it somewhat tidy with exactly 42 friends, no more, no less. It&#8217;s a special place. Sure, there are some third party tools available to export my facebook graph and import it into Google+ &#8230; I think.</p>\n<p>But what I would have expected from Google is something I&#8217;ve grown accustomed to with <em>every single social startup ever</em>. Give me an option to login with facebook and twitter, perhaps even foursquare and others. Then just copy paste my friends. I want you to do this for me. I don&#8217;t want to do it myself.</p>\n<p>Look, Google, I know you&#8217;re this big company and are incredibly awesome. I even understand that you&#8217;re simply going to force everyone to use your social network. You&#8217;ve indicated as much. But here&#8217;s the thing, I&#8217;ve spent years, <em>years</em> building relationships with the people I have on different social networks. Starting from scratch is the last thing I want to do. The very fucking last.</p>\n<p>I&#8217;m just too lazy for that.</p>\n<p>Oh, but I can import from Yahoo &#8230; that&#8217;s a joke right?</p>\n<h2>Circles. Fuck circles</h2>\n<p>And then there&#8217;s circles. While a very awesome idea at first glance. You get to arrange your friends into discrete-ish groups of people you would want to share different things with.</p>\n<p>This makes a lot of sense, most people don&#8217;t want to share photos of their drunken debauchery with, say, their grandmother. And nobody really cares about that boring new year&#8217;s party at work other than other people at work &#8230; sort of.</p>\n<img style=\"float: left; width: 60%; height: 60%; margin: 15px;\" src=\"http://swizec.com/blog/wp-content/uploads/2011/07/hfzUX.jpg\" alt=\"\" />\n<p>But how many of you really have sooooo many friends that your social groups are discrete? What happens when you go for some drunken debauchery with your boss? Ok, now he&#8217;s both a friend and a coworker &#8230; but then, there&#8217;s still a different level of friends and &#8230; gah, it just gets so confusing.</p>\n<p>I&#8217;m far too lazy to deal with taxonomies of friends and figuring out just which exact group of people they fall into. <a class=\"zem_slink\" title=\"RuPaul People Are People\" rel=\"youtube\" href=\"http://www.youtube.com/watch?v=59LXx_eyIVQ\">People are people</a> and I treat most of them pretty much the same &#8230; give me a person and I have no idea how to label them. I don&#8217;t even <em>want</em> to label them. Labeling people is lame. What &#8230; am I supposed to put people into circles labeled &#8220;nigger&#8221;, &#8220;chink&#8221;, &#8220;whitey&#8221;? Of course not. So why according to number and type of interactions per month? Put them in a certain circle and you&#8217;ve doomed the relationship.</p>\n<p>Furthermore, how pathetic do you and your friends have to be that you can&#8217;t handle actually knowing each other? Maybe I&#8217;m too European, or just too liberal, but I really don&#8217;t understand why my grandmother should have a problem with understanding that I&#8217;m 23 years old and that, yes, sometimes I get drunk. Hell, I bet she could probably show me a thing or two about partying properly if I asked.</p>\n<p>I&#8217;m sure my gramps could &#8230; hell, even my dad was probably cool once upon a time and knew how to down a drink or two.</p>\n<p>But maybe that&#8217;s just me, I have the style of: &#8220;This is me. Deal with it or please kindly fuck off&#8221;. Not really used to holding things back too much &#8230; and the things I don&#8217;t want everyone seeing &#8230; I just don&#8217;t put online. Shocker! Imagine that. Refraining from publishing embarrassing things on the most public of public places! :O</p>\n<p>What a concept!</p>\n<h2>Hangouts? Buy me beer instead!</h2>\n<p>Also Google+ has this hangouts thing. From what I infer it&#8217;s a place you can have group webcam chats with people. Sure, this might seem fun and all, but I have a policy. If you want to kick the shit with me, buy me alcohol or at least caffeine. Do not even attempt to waste my time with social phone calls, social webcam chats or anything that requires me to focus solely on you. If I can&#8217;t do other things while talking to you, I expect drinks to be involved.</p>\n<p>I know this might come as a shock to people. Especially coming from a colossal geek such as myself. But alcohol is the lube, ducttape and wd-40 of social networks. Not TCP/IP.</p>\n<p>The reason I use social networking at all is because it&#8217;s event based and lets me focus on other things while still keeping in touch with people. Everything a phone call or a webcam chat doesn&#8217;t do.</p>\n<p>Everything.</p>\n<p>All in all &#8230; the thing I hate most about Google+ is that it&#8217;s just awesome enough that every huge major thing it doesn&#8217;t do perfectly really bothers me.</p>\n<h6 class=\"zemanta-related-title\" style=\"font-size: 1em;\">Related articles</h6>\n<ul class=\"zemanta-article-ul\">\n<li class=\"zemanta-article-ul-li\"><a href=\"http://www.omgubuntu.co.uk/2011/06/googleplus/\">Hangouts, Sparks, Circles and Huddles &#8211; we make sense of Google+</a> (omgubuntu.co.uk)</li>\n<li class=\"zemanta-article-ul-li\"><a href=\"http://theinformativereport.com/2011/07/01/what-you-should-know-about-googles-new-social-network/\">What you should Know about Google&#8217;s new social network</a> (theinformativereport.com)</li>\n<li class=\"zemanta-article-ul-li\"><a href=\"http://blog.360i.com/social-media/google-plus-faq\">Social Media Insider: Your Google Plus FAQ</a> (360i.com)</li>\n<li class=\"zemanta-article-ul-li\"><a href=\"http://thedigitalconsultant.wordpress.com/2011/06/29/sparks-circles-and-hangouts/\">Sparks, Circles And Hangouts</a> (thedigitalconsultant.wordpress.com)</li>\n<li class=\"zemanta-article-ul-li\"><a href=\"http://scobleizer.com/2011/07/01/why-yo-momma-wont-use-google-and-why-that-thrills-me-to-no-end/\">Why yo momma won&#8217;t use Google+ (and why that thrills me to no end)</a> (scobleizer.com)</li>\n</ul>\n<div class=\"zemanta-pixie\" style=\"margin-top: 10px; height: 15px;\"><a class=\"zemanta-pixie-a\" title=\"Enhanced by Zemanta\" href=\"http://www.zemanta.com/\"><img class=\"zemanta-pixie-img\" style=\"border: none; float: right;\" src=\"http://img.zemanta.com/zemified_e.png?x-id=745658ef-f771-4515-9a98-4cf2885eb160\" alt=\"Enhanced by Zemanta\" /></a></div>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"42e452cc-63ae-516d-9304-d3b48f3aafef"}}