{"data":{"wordpressPost":{"title":"Slovenia Php Conference 2009 (live blogging)","content":"<div class=\"zemanta-img\" style=\"margin: 1em; display: block;\">\n<div>\n<dl class=\"wp-caption alignright\" style=\"width: 250px;\">\n<dt class=\"wp-caption-dt\"><a href=\"http://www.flickr.com/photos/21369373@N00/2414420607\">:12<img title=\"Passwords are the whipping boy\" src=\"http://farm3.static.flickr.com/2389/2414420607_5c1716696c_m.jpg\" alt=\"Passwords are the whipping boy\" width=\"240\" height=\"180\" /></a></dt>\n<dd class=\"wp-caption-dd zemanta-img-attribution\" style=\"font-size: 0.8em;\">Image by <a href=\"http://www.flickr.com/photos/21369373@N00/2414420607\">leeleblanc</a> via Flickr</dd>\n</dl>\n</div>\n</div>\n<p>Wet, late and hungry I arrived at the IJS venue where I&#8217;ll be staying all day listening to odd people talking about interesting stuff &#8211; very interesting I hope. Just so you know, I have a valid excuse for being late and missing the event&#8217;s introduction and everything, but let&#8217;s not get into that now (just so you know, I didn&#8217;t oversleep).</p>\n<p>Right now I&#8217;m listening to Dusan Omercevic, I believe, talking about openID. Don&#8217;t really know what&#8217;s going on since I missed about half his lecture 😀</p>\n<p><strong>10:23</strong> Currently we&#8217;re discussing what the biggest problem of openID is and why it will never be used as a service but rather as a technology. Apparently the crux of the matter is that users like simplicity and corporations want huge databases of their users. Personally I think this will effectively kill openID, because every site or group of sites will have their own openID and users will still end up having twenty different usernames and passwords &#8230; except they&#8217;ll be called openID&#8217;s.</p>\n<p><strong>10:45</strong> We&#8217;ve reached the other portion of this openID talk and it&#8217;s &#8230; not very interesting. A lot of technical stuff, which is just discouraging me from using this protocol. I still don&#8217;t exactly understand why I should. Coding a regular login system is easy as hell, this just seems needlessly complex for probably around 90% web devs out there.</p>\n<p><strong>11:28</strong> Very interesting invitation to try along this guy&#8217;s hacking techniques on our websites. Should be useful to test Chlorine Boards. Hope I don&#8217;t do too much damage, &#8217;cause I don&#8217;t have anywhere else to test than production websites.</p>\n<p><strong>12:12</strong> Wow I think I need a new pair of trousers &#8217;cause I just shat brix! The methods for doing crazy fun things on other people&#8217;s websites that Ga</p>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"9f23d5c5-d5f8-5df9-bd71-11a4adb08118"}}