{"data":{"wordpressPost":{"title":"How a book I wrote in two weeks made $4,000 in its first month","content":"<div style=\"width: 663px\" class=\"wp-caption alignnone\"><img title=\"React+d3.js total revenue\" alt=\"React+d3.js total revenue\" src=\"https://draftin.com:443/images/28694?token=B9SaeTmPBoZWjEpNjjmnA84vZu0BK_Z-9HxAmBxporEg1AaMhuI4fRpekmHMVurpXyYfGewTc78IofFvMX7NdKA\" width=\"653\" height=\"370\" /><p class=\"wp-caption-text\">React+<a class=\"zem_slink\" title=\"D3.js\" href=\"http://protovis.org/\" target=\"_blank\" rel=\"homepage\">d3.js</a> total revenue</p></div>\n<p>It all started with a challenge from a friend.</p>\n<p><em>&#8220;You know, you should self-publish a book on React and d3.js. I want to see if it&#8217;s useful.&#8221;</em></p>\n<p><em>&#8220;I don&#8217;t know man, I&#8217;ve got a lot going on &#8230; &#8220;</em></p>\n<p><em>&#8220;If it&#8217;s important enough, you&#8217;ll find the time :)&#8221;</em></p>\n<p><em>&#8220;Fuck you man, I&#8217;ll do it in two weekends!&#8221;</em></p>\n<p>Five weeks later <a href=\"http://swizec.com/reactd3js\">React+d3.js</a> was launched. A 63 page book that shows you how to build interactive data visualization components with React and d3.js.</p>\n<p>In the month and a half since launch, it sold 329 copies, made $4,022 in revenue and some $3,000 in pure profits if you don&#8217;t count my time. With an effective hourly rate of $40/hour it has more than surpassed either of my two other books.</p>\n<p>My friend may have won the bet, but I learned a lot.</p>\n<h2 id=\"some-things-that-worked-before-launch\">Some things that worked before launch</h2>\n<p>Two weeks before launch the example my book would be based on was complete. It had taken me two weeks to learn React and find a good way to marry it with d3.js to produce a shiny visualisation.</p>\n<div style=\"width: 839px\" class=\"wp-caption alignnone\"><img title=\"H1B histogram made with React and d3.js\" alt=\"H1B histogram made with React and d3.js\" src=\"https://draftin.com:443/images/28692?token=MxWIY3SpWMvAb2VO1dNSWdK7D0X8yHFe-2vRhOujb5lOS85GNo2Xk0d7udLZouTAIwQvUtVDE_LJ2QmiVyDRzGI\" width=\"829\" height=\"476\" /><p class=\"wp-caption-text\">H1B histogram made with React and d3.js</p></div>\n<p>That graph was seen by 40,000 people in the first week. It stayed on first place of <a class=\"zem_slink\" title=\"Hacker News\" href=\"http://news.ycombinator.com/\" target=\"_blank\" rel=\"homepage\">Hacker News</a> for over a day and made it as far as Slashdot. Yeah, Slashdot still exist, who woulda thunk it &#8230;</p>\n<p>It isn&#8217;t the sexiest graph out there, but it does show some cool features of React. Whenever you click a button everything changes. The graph, the description, the title, everything.</p>\n<p>This got people excited about what&#8217;s possible and some of them signed up to learn about the book.</p>\n<p>When the book was done two weeks later, I had a mailing list of about 180 people. Graph-&gt;signup conversion rate, 0.45%. Half a percent, not <em>too</em> shabby.</p>\n<p>I told the mailing list that the book was done and promised a free copy to everyone who wants to read the draft and give me feedback. 20 people raised their hand. Email-&gt;test reader conversion rate, ~11%.</p>\n<p>Of those twenty people, four or five came back with feedback early enough for me to act before hitting the launch line in the sand. Not only was this early feedback invaluable in improving the book, but it gave me some great reader testimonials to put on the landing page.</p>\n<p>Handraise-&gt;feedback conversion rate, ~25%.</p>\n<h2 id=\"some-things-that-worked-after-launch\">Some things that worked after launch</h2>\n<p>I launched the book on a Monday. Evening European time, morning-ish Pacific.</p>\n<p>The email went out to my mailing list immediately. Sales started instantly. I sold 30 packages that first day. 35 the next. Then sales per day started falling.</p>\n<p>Right now it&#8217;s selling about three copies a day with organic traffic. But I have to work on that.</p>\n<div style=\"width: 710px\" class=\"wp-caption alignnone\"><img title=\"React+d3.js sales\" alt=\"React+d3.js sales\" src=\"https://draftin.com:443/images/28696?token=lT00sGl1kNaoMoC5QJrMQRz2q9xT9szyfBeeynEJhTSRPxAgbSQIOfm729h9yLF_kOVeuJDRtt-eNU5Y8r87NwQ\" width=\"700\" height=\"420\" /><p class=\"wp-caption-text\">React+d3.js sales</p></div>\n<p>A day after launch I made a new landing page. Bought a theme that looks like one of those converty book landing page things and modified it. Took four or five hours, but I&#8217;m really happy with it.</p>\n<p>Maybe I&#8217;m weird, but I love those long sales pages because they give me enough time to explain why the book is worth your time and money. And if you can&#8217;t even be bothered to read a 500 word landing page, you won&#8217;t read the 7000 word book either.</p>\n<p>The landing page conversion rate is 3% session-&gt;$$ and 4.8% session-&gt;sale (the super basic package is free for reasons). I&#8217;m told those conversion rates are really good, but I calculated them naively so I&#8217;m not sure if they&#8217;re super accurate.</p>\n<p>Asking a few popular mailing lists to include me in their email proved fruitful as well. Javascript Weekly converted into about $600 worth of sales. HTML5 Weekly performed a bit less well, followed by DashingD3.js.</p>\n<p>Another big win was bundling with the incredibly popular D3 Tips and Tricks. Most of my sales these days come straight from being bundled with that book and the initial email blast to 18,000 readers produced as many sales as the launch did.</p>\n<p>But the caveat of that deal was introducing a free tier with just the pdf. @d3noob is an idealist and thinks knowledge should be free. Which is kind of true, but it was well worth tweaking the parameters of my experiment for.</p>\n<p>In terms of profit, tiered pricing worked great. The basic package with just the book and a bit of code has made $2,082 in revenue with 296 sales. The Premium and Team packages combined made $1,939 on just 33 sales between them.</p>\n<p>So far nobody has bought the full platinum package.</p>\n<h2 id=\"some-things-that-failed\">Some things that failed</h2>\n<p>My biggest fail was asking those early supporters whose email addresses I had to upvote my Show HN post. This worked great with some 18 upvotes in the first twenty minutes.</p>\n<p>But it worked too well. The post got flagged into oblivion and sank further with every upvote. One subscriber even complained that it&#8217;s really not kosher of me to ask for upvotes.</p>\n<p>And he&#8217;s right. And the post must have gotten as many flags as it did upvotes.</p>\n<p>That was a fail on my part. Should have trusted the book to make it on its own merits. Considering how much traffic Hacker News produces, this mistake cost me $10,000++.</p>\n<p>Oops.</p>\n<p>Another silly mistake was giving early readers a bigger discount than I intended to. I promised 25% and gave 50% because I had assumed Leanpub&#8217;s pay-what-you-want sliders work with coupons as well. They don&#8217;t.</p>\n<p>Oops. But happier readers so that&#8217;s okay.</p>\n<p>A really really huge fail on my part was providing a crappy video with the Premium package. It was supposed to be a sexy hour-long screencast showing how everything fits together.</p>\n<p>But I ran out of time and launched before it was done. I promised to get it done in a week or so.</p>\n<p>Then I got sick for a week. Then I found out I suck at video editing. Then <a class=\"zem_slink\" title=\"Packt\" href=\"http://www.packtpub.com\" target=\"_blank\" rel=\"homepage\">Packt</a> blindsided me with a tight deadline on a d3.js video course that&#8217;s about to launch.</p>\n<p>A month later and still no good video. But production is starting again and this time around I have an awesome freelancer to do the editing for me.</p>\n<p>But I launched and I learned my lesson. Delegate the things you suck at!</p>\n<p>Somewhat of a fail but not too bad was launching a better landing page the day after launch launch. It&#8217;s not too bad, but I think it converts better and it would just be more consistent. Especially with the whole attempt at HN publicity and such.</p>\n<p>But at least all those mailing lists got the better landing page so that&#8217;s good.</p>\n<p>Another fail was that I didn&#8217;t write those guestposts I had arranged. Four people promised to publish my guest post about React and d3.js on their website. This would be awesome for publicity and driving traffic to the book. But things happened and I haven&#8217;t gotten around to writing them.</p>\n<p>I&#8217;ll write them now and hope everyone&#8217;s still willing to publish. Next time, I will have those opportunities arranged before launch <em>and</em> write the posts before launch as well. That way a bigger press push can happen on launch.</p>\n<p>And I think I didn&#8217;t tweak the tiered pricing well enough. The incentive to pick a higher tier package isn&#8217;t big enough. Something to think about.</p>\n<h2 id=\"things-left-to-try\">Things left to try</h2>\n<p>All in all this has been a great experiment.</p>\n<p>My initial line in the sand for success was $1,000 in revenue. The book made 4x more. \\o/</p>\n<p>The second line in the sand, reaching 10k before end of April didn&#8217;t happen. Mostly because I was too busy with the Packt deadline on that video course project.</p>\n<p>A few things I&#8217;m going to try so I can get the 10k milestone in May:</p>\n<ul id=\"draft_check_box_list_0\">\n<li>set up a drip campaign for the book</li>\n<li>a system to check-in with readers a week or two after buying to get feedback and ensure they liked it (happy readers tell their friends)</li>\n<li>play with advertising</li>\n</ul>\n<p>But the biggest experiment to try is seeing if I can turn this into a system. Learn a tech, write about tech, launch book, once a month or every two months. Produce enough income to live off of.</p>\n<p>That&#8217;s the ultimate experiment right there.</p>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"c37fae0e-b4b1-59ed-81cb-dd1cbf926ba2"}}