{"data":{"wordpressPost":{"title":"The greatest story I have to tell","content":"<p>War veterans tell the best stories &#8211; testosterone-filled men crammed in compact spaces doing something dangerous/awesome produce the best stories.</p>\n<div style=\"width: 352px\" class=\"wp-caption alignright\"><img class=\"  \" title=\"The bike central to this story\" src=\"http://swizec.com/blog/wp-content/uploads/2012/02/11fdb5d3700d4fbd96b168de05ed2c21_77.jpg\" alt=\"The bike central to this story\" width=\"342\" height=\"342\" /><p class=\"wp-caption-text\">The bike central to this story</p></div>\n<p>Geeks? We have deployments to <a class=\"zem_slink\" title=\"Silicon Valley\" href=\"http://maps.google.com/maps?ll=37.37,-122.04&amp;spn=1.0,1.0&amp;q=37.37,-122.04 (Silicon%20Valley)&amp;t=h\" rel=\"geolocation\">Silicon Valley</a>, that&#8217;s where our best stories come from.</p>\n<p>The greatest story my life has to offer comes from my first stint at Silicon Valley &#8211; this summer, interning for a <a class=\"zem_slink\" title=\"Y Combinator\" href=\"http://www.ycombinator.com\" rel=\"homepage\">YCombinator</a> team. I&#8217;ve probably mentioned it before in passing, but it needs a proper writeup.</p>\n<h2>The Story</h2>\n<p>After a month of being stuck in a four bedroom house with six guys and only going out once every week or so &#8230; to <a class=\"zem_slink\" title=\"Palo Alto, California\" href=\"http://maps.google.com/maps?ll=37.4291666667,-122.138055556&amp;spn=0.1,0.1&amp;q=37.4291666667,-122.138055556 (Palo%20Alto%2C%20California)&amp;t=h\" rel=\"geolocation\">Palo Alto</a>, I needed something better.</p>\n<p>Palo Alto is where fun goes to die. Marvelous for startups, venture capital just waiting to dump shitloads of money on hapless startups &#8211; shake a tree and money falls out.</p>\n<p>It is a sea of guys. Nerdy, geeky, guys. Whatever girls there are, aren&#8217;t looking for people like me. Why would they? I haven&#8217;t cashed out of a startup and I don&#8217;t even have a car, let alone a Porsche.</p>\n<p>After a month it was finally time. I&#8217;m going to San Francisco and having some proper fun. Researched some clubs on <a class=\"zem_slink\" title=\"Google Maps\" href=\"http://maps.google.com\" rel=\"homepage\">Google Maps</a>, asked around a little bit, and found a place I liked &#8211; the <a class=\"zem_slink\" title=\"DNA Lounge\" href=\"http://maps.google.com/maps?ll=37.7710083333,-122.412694444&amp;spn=0.01,0.01&amp;q=37.7710083333,-122.412694444 (DNA%20Lounge)&amp;t=h\" rel=\"geolocation\">DNA Lounge</a>.</p>\n<p>Looked like a nice alter club with cool music, good people and a lack of gold-diggers. There might even be a girl in there wearing sneakers instead of high heels! Score!</p>\n<p>Next Saturday I hopped on a bike, cycled to the nearest <a class=\"zem_slink\" title=\"Caltrain\" href=\"http://en.wikipedia.org/wiki/Caltrain\" rel=\"wikipedia\">Caltrain</a> station and when I got to San Francisco it was already dark. But hey, what could possibly go wrong? Just a lonesome guy on a bike in a huge city at night!</p>\n<h2>The Club</h2>\n<p>The club was everything I had imagined and more. There was a line out the front just like in the movies, bouncers everywhere and I even had to show my ID! Sweet, right? They didn&#8217;t even bat an eyelid when I showed them my expired <a class=\"zem_slink\" title=\"Identity document\" href=\"http://en.wikipedia.org/wiki/Identity_document\" rel=\"wikipedia\">ID card</a>from Slovenia; I love that in a bouncer.</p>\n<div id=\"attachment_3636\" style=\"width: 430px\" class=\"wp-caption alignright\"><a href=\"http://swizec.com/blog/wp-content/uploads/2012/02/1074032723_aJTtC-M.jpeg\"><img class=\" wp-image-3636 \" title=\"Bootie at DNA Lounge\" src=\"http://swizec.com/blog/wp-content/uploads/2012/02/1074032723_aJTtC-M.jpeg\" alt=\"Bootie at DNA Lounge\" width=\"420\" height=\"280\" srcset=\"https://swizec.com/blog/wp-content/uploads/2012/02/1074032723_aJTtC-M.jpeg 600w, https://swizec.com/blog/wp-content/uploads/2012/02/1074032723_aJTtC-M-300x200.jpg 300w\" sizes=\"(max-width: 420px) 100vw, 420px\" /></a><p class=\"wp-caption-text\">Bootie at DNA Lounge</p></div>\n<p>Inside &#8230; a sea of women. There were women everywhere, bouncing to good music, drinking overpriced cocktails and the atmosphere was just amazing. For every guy in the club there were at least two chicks. A magnificent sight to behold!</p>\n<p>But I&#8217;m kind of shy so when there is a sea of women I just enjoy the company and mostly dance by myself. And then I notice &#8211; hey, I&#8217;m dancing with someone! There is a cute chick and I think I&#8217;m dancing with her! Am I dancing with her? Hey she just grabbed my hand, I <em>am</em> dancing with her! Awesome!!</p>\n<p>Before I knew it, I was sitting on the sidelines chatting with a cute chick in my lap and her friend. I think I remember telling her about where I&#8217;m from and what I&#8217;m doing in the US. And she told me what she was studying and that she was soon leaving for Africa &#8230; to study monkeys or something.</p>\n<p>Doesn&#8217;t matter. There was a chick in my lap and all I cared about was &#8230; nothing. There were words coming out of her mouth and I just didn&#8217;t care.</p>\n<p>She may have told me her name too &#8230;</p>\n<p>Then. Last call. Club closes. Chick disappears into the night. Suddenly all alone in a huge foreign city in the middle of the night with nowhere to go.</p>\n<p>The chick&#8217;s words start coming back to me &#8220;Hey, you know, San Francisco is a pretty big place. You really don&#8217;t want to be alone at night &#8230; at least not in some areas&#8221;</p>\n<p>I didn&#8217;t remember what areas. There were boobs! How <em>could</em> I remember!?</p>\n<p>I didn&#8217;t really have a plan for the rest of the night, so in my inebriated state it seemed like a cool idea to hop on the borrowed bike and cycle back to Palo Alto.</p>\n<p>At 3am.</p>\n<p>56 kilometers.</p>\n<p>Roads I&#8217;ve never even seen before.</p>\n<p>But hey, google maps can help right! Oh wait, I only have wi-fi on my phone, no 3G. Eh, the cache is good enough, I&#8217;ll just cache the whole map.</p>\n<p>Only 20% battery left. Marvelous!</p>\n<p>Plotted a rough course, cached as much as I could, hopped on the bike and off I was into the night.</p>\n<h2>An adventure!</h2>\n<div id=\"attachment_3632\" style=\"width: 524px\" class=\"wp-caption alignnone\"><a href=\"http://swizec.com/blog/wp-content/uploads/2012/02/Screen-Shot-2012-02-07-at-4.47.27-PM.png\"><img class=\" wp-image-3632 \" title=\"Adventure!\" src=\"http://swizec.com/blog/wp-content/uploads/2012/02/Screen-Shot-2012-02-07-at-4.47.27-PM.png\" alt=\"Adventure!\" width=\"514\" height=\"481\" srcset=\"https://swizec.com/blog/wp-content/uploads/2012/02/Screen-Shot-2012-02-07-at-4.47.27-PM.png 734w, https://swizec.com/blog/wp-content/uploads/2012/02/Screen-Shot-2012-02-07-at-4.47.27-PM-300x280.png 300w\" sizes=\"(max-width: 514px) 100vw, 514px\" /></a><p class=\"wp-caption-text\">Adventure!</p></div>\n<p>I cycled and I cycled. San Francisco was sleeping. Met three people all night. They seemed either too scary or too drunk to talk to.</p>\n<p>I found myself near something resembling the docks. There was an ocean and what looked like peers and some ships &#8211; not the big kind, but still ships. Isn&#8217;t this where a lot of people get killed in the movies?</p>\n<p>But I pressed on and got into a more normal looking area. Single storey buildings everywhere, places that looked like businesses, not very residential. But hey, I wasn&#8217;t worried, it didn&#8217;t look too dangerous this time.</p>\n<p>After about 40 minutes of cycling I was out in the open. No more houses, just distant lights. On one side was the ocean, on the other what looked like an open meadow with no discernible features.</p>\n<p>And it was dark. So very very dark. No street lights anywhere. Just the full moon and stars &#8211; luckily California isn&#8217;t a very cloudy place.</p>\n<p>Without lights all I could use to navigate was a white line on the side of the road. A meter of white line disappearing into the night in front of me.</p>\n<h2>Dark</h2>\n<p>Darkness. Black tarmac. White line.</p>\n<div id=\"attachment_3635\" style=\"width: 361px\" class=\"wp-caption alignright\"><a href=\"http://swizec.com/blog/wp-content/uploads/2012/02/IMGP2951_thumb1.jpeg\"><img class=\" wp-image-3635 \" title=\"Pretty much the view\" src=\"http://swizec.com/blog/wp-content/uploads/2012/02/IMGP2951_thumb1.jpeg\" alt=\"Pretty much the view\" width=\"351\" height=\"265\" srcset=\"https://swizec.com/blog/wp-content/uploads/2012/02/IMGP2951_thumb1.jpeg 502w, https://swizec.com/blog/wp-content/uploads/2012/02/IMGP2951_thumb1-300x225.jpg 300w\" sizes=\"(max-width: 351px) 100vw, 351px\" /></a><p class=\"wp-caption-text\">Pretty much the view</p></div>\n<p>That white line was the only thing keeping me alive. I hugged it as much as I could, veer too much to the right and you&#8217;re out of road &#8211; can&#8217;t even see the edge. Veer too much to the left and you&#8217;re in traffic &#8230; traffic that can&#8217;t see you until they almost run you over.</p>\n<p>A hill started. Now I was in deep shit. Small bump in the road and I&#8217;m eating tarmac &#8211; life slipping away by the drop most likely. I later checked the Runkeeper recording &#8211; I was doing 40 kilometers an hour.Enough to seriously die without a helmet on.</p>\n<p>Oh and did I mention it was cold? Very cold! Hands wrapped in sleeves, holding the handlebars &#8230; sort of. Scarf around my face. Nothing warmer but a sweater to wear. And I held on for dear life.</p>\n<p>A few cars passed me. Some lorries. Scary.</p>\n<p>There is so much roar coming from your tyres you can&#8217;t hear approaching vehicles. Something just whizzes out of your peripheral vision and is gone before you fully realize what happened.</p>\n<p>Every time you get spooked and veer to the right a bit. But there&#8217;s an invisible road edge there. Veer too much and *poof*, gone.</p>\n<p>I was very happy when street lights started somewhere around the <a class=\"zem_slink\" title=\"San Francisco International Airport\" href=\"http://maps.google.com/maps?ll=37.6188888889,-122.375&amp;spn=0.03,0.03&amp;q=37.6188888889,-122.375 (San%20Francisco%20International%20Airport)&amp;t=h\" rel=\"geolocation\">SFO airport</a>. I could see! But it felt like I was in some seedy part of town again. Switching from that big road to El Camino was pretty interesting.</p>\n<p>A backroad somewhere near the airport. Strange crossroads. Gang cars everywhere. At least they looked like the typical car mexican gangs drive in movies, wouldn&#8217;t know if they actually were gang cars. Might be a stereotype.</p>\n<p>Oh and Google Maps didn&#8217;t cache this bit.</p>\n<p>El Camino is a good road. I like it. Just following it I would eventually come to Palo Alto and that nothing could possibly go wrong from this point onward.</p>\n<p>Well, you know, other than getting run over by a car. Killed by some weirdo in a backtown. Or just dying from exhaustion.</p>\n<p>I didn&#8217;t even have a bottle of water with me! Nothing. Just my hat, the bike and sheer determination to get home and survive the greatest adventure I was ever on.</p>\n<p>Eventually daylight started. The cold was replaced with just too much warmth for my clothes but not enough to take anything off. I could see! Life was simple again.</p>\n<h2>Just keep pedalling.</h2>\n<p>By this point I was getting very tired. Had been cycling for hours and I&#8217;m not in the best of shapes &#8211; especially not for cycling.</p>\n<p>This part of the trip is slightly hazy. I dozed off a couple times, but magically kept pedalling. It was muscle memory by now, didn&#8217;t even have to think about it. Pedalling? Oh that&#8217;s just something legs do on their own, not my business.</p>\n<p>I got to Palo Alto, found the house and at 7am. 1% of battery left. An hour before the first Caltrain leaves from <a class=\"zem_slink\" title=\"San Francisco\" href=\"http://maps.google.com/maps?ll=37.7793,-122.4192&amp;spn=0.1,0.1&amp;q=37.7793,-122.4192 (San%20Francisco)&amp;t=h\" rel=\"geolocation\">San Francisco.</a></p>\n<p>After about two liters of Cedevita and a shower I collapsed into bed. Couldn&#8217;t think straight to save my life.</p>\n<p>The next day I was woken up at 10am. It was all hands on deck to help prepare a picnic for all the Silicon Valley friends of the startup.</p>\n<p>How I survived that day, I&#8217;m not sure. All I remember is an all-consuming numbness in my legs and an inability to stand.</p>\n<h6 class=\"zemanta-related-title\" style=\"font-size: 1em;\">Related articles</h6>\n<ul class=\"zemanta-article-ul\">\n<li class=\"zemanta-article-ul-li\"><a href=\"http://www.mercurynews.com/breaking-news/ci_19906706\">Man punched during Palo Alto soccer game</a> (mercurynews.com)</li>\n<li class=\"zemanta-article-ul-li\"><a href=\"http://www.mercurynews.com/peninsula/ci_19741327\">Wushu takes flight at Palo Alto&#8217;s Nixon Elementary</a> (mercurynews.com)</li>\n<li class=\"zemanta-article-ul-li\"><a href=\"http://www.sfgate.com/cgi-bin/article.cgi?f=/c/a/2011/11/26/BA2L1M4JH5.DTL\">New fatal on Caltrain line in Palo Alto</a> (sfgate.com)</li>\n</ul>\n<div class=\"zemanta-pixie\" style=\"margin-top: 10px; height: 15px;\"><a class=\"zemanta-pixie-a\" title=\"Enhanced by Zemanta\" href=\"http://www.zemanta.com/\"><img class=\"zemanta-pixie-img\" style=\"border: none; float: right;\" src=\"http://img.zemanta.com/zemified_e.png?x-id=f5c50df4-886a-4fc9-a03d-118a1963b574\" alt=\"Enhanced by Zemanta\" /></a></div>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"291880ae-09f8-58ac-9790-af61a142b991"}}