{"data":{"wordpressPost":{"title":"Seven christmas truths","content":"<p>Was going to write a post about anything, pour out some thoughts for you, one of my boring essays that for some reason you all keep reading, yes both of you. But since, given my current mood, that would instill too much fear and spoil someone&#8217;s holidays I&#8217;ve decided just to play the tag game of spouting seven truths about oneself. <a href=\"http://blog.mozganostroj.com/2008/12/24/sedem-resnic-ali-sedem-prasic/\" target=\"_blank\">Sparkica tagged me</a>, now I feel so included and recognised it&#8217;s almost heartwarming.</p>\n<ol>\n<li>I find miss piggy extremely sexy, always have, always will. For some reason this extends to real girls, just keep them round and juicy, I need something to hug comfortably without fear of breaking myself on a bone.</li>\n<li>I often go out of my way to say something in such a manner as to allow for it to become a quote later on. Most of the time they won&#8217;t become quotes, but it&#8217;s a valiant effort.</li>\n<li>Political correctness is bullshit. Nobody cares people and you should understand that any time you do something politically correct it just makes the rest of us laugh.</li>\n<li>I severely dislike people who get hung up on petty and frivolous crap all the time. Sadly this means I also hate most women because it often seems they don&#8217;t do much else than get hung up on petty frviolous crap and in silly ways nontheless.</li>\n<li>Emos &#8230; don&#8217;t even get me started, you guys ruined perfectly good music with your stupid behaviour and clothes so that now we can&#8217;t listen to it just because it&#8217;s emo. Fuck you.</li>\n<li>I hate that at times I&#8217;m still too teenagery and care about something being emo or not. Why should I care? All that matters is whether I like it or not. Bah, stupid silly person.</li>\n<li>I wear only black not because it&#8217;s such an awesome colour, not becuase it&#8217;s simple and neither because it&#8217;s slimming. I wear it because according to traditional colour theory black staves off evil and protects a person from bad crap. Sadly some people don&#8217;t know this and continue to throw bad crap my way despite my clothes.</li>\n</ol>\n<p>So there you have it, seven truths about myself and now I&#8217;m supposed to list seven other bloggers, but here&#8217;s the catch. I don&#8217;t really know seven other bloggers who aren&#8217;t niche specific, but follow the slovene convention of blogs being personal nonsense sputtering places. So here&#8217;s a list of what I can think of: <a href=\"http://www.had.si/\" target=\"_blank\">had</a>, <a href=\"http://ratoncrack.blogspot.com/\" target=\"_blank\">rat on crack</a>, <a href=\"http://robertbasic.com/blog/\" target=\"_blank\">robert basic</a>, <a href=\"http://dronyx.wordpress.com/\" target=\"_blank\">dr. onyx</a> and fuck, that&#8217;s it.</p>\n<p>No wonder I have so few readers! I&#8217;m not doing much reading myself, crud.</p>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"fdb60ebc-4ddc-5b7b-9a8e-483352160a17"}}