{"data":{"wordpressPost":{"title":"Week 19: Relativity theory and time perception","content":"<p><em>[This post is part of an ongoing challenge to understand 52 papers in 52 weeks. You can read previous entries, <a href=\"http://swizec.com/blog/category/52-papers-in-52-weeks\">here</a>, or subscribe to be notified of new posts by <a href=\"http://swiz.ec/52papers-list\">email</a>]</em></p>\n<blockquote><p>&#8220;When a man sits with a pretty girl for an hour, it seems like a minute. But let him sit on a hot stove for a minute and it&#8217;s longer than any hour.&#8221; ~ Albert Einstein</p></blockquote>\n<p>Time sometimes flies by, sometimes drags along shuffling its feet. But how does that work? How come context affects the way we perceive time?</p>\n<p>Neurobiological evidence has been found that people use different areas of their brain to time different lengths of time, but the traditional view of psychological time is still that there is a timer, a counter, and simple arithmetic. In <a href=\"http://www.plosone.org/article/info%3Adoi%2F10.1371%2Fjournal.pone.0006268\"><em>Relativity Theory and Time Perception: Single or Multiple Clocks?</em></a> Buhusi and Meck use rats to see whether their brain uses independent clocks or not.</p>\n<h2 id=\"the-experiment\">The experiment</h2>\n<p>They used a tri-lever set up to train rats to recognise three different time intervals &#8211; 10s, 30s and 90s &#8211; using something called a tri-peak procedure.</p>\n<p>The paper treats this as common understanding in psychology research, so it&#8217;s never explained in great detail. From what I can tell, a light in rats&#8217; cages acted as a signal. When it turned on, the experiment started.</p>\n<p>When it either turned off or flashed again after X seconds, I&#8217;m not sure, it counted as a signal or a gap. If the rat pulled the correct lever, it was given a food pellet.</p>\n<p>Now I&#8217;m not sure whether the light was still used for anything other than starting the trial after the rats had learned how to time correctly, but the variable we&#8217;re looking at is by how much they miss the target time.</p>\n<p>The fun part is inserting gaps into the timing. First a small gap, then a larger and larger gap. When this happens rats can do one of three things with their <a class=\"zem_slink\" title=\"Clock\" href=\"http://en.wikipedia.org/wiki/Clock\" target=\"_blank\" rel=\"wikipedia\">internal clock</a>:</p>\n<ul>\n<li><em>run</em>, timer ignores the gap</li>\n<li><em>stop</em>, timer is paused for the duration of the gap, then continues</li>\n<li><em>reset</em>, timer starts from scratch after the gap</li>\n</ul>\n<p>I&#8217;m not sure how researches communicated the gap to their rats, but if the same effect happens for all three intervals, rats are using a simple clock+accumulator setup. If the actions happen independently for each timer, then they are using several parallel clocks.</p>\n<p>Put simply, if you miss the first lever by 10s and still hit the third lever perfectly, then you have independent clocks. If you miss the first lever by the same amount as the last lever, then you aren&#8217;t.</p>\n<h2 id=\"effect-of-gaps-on-response-rates\">Effect of gaps on response rates</h2>\n<div style=\"width: 846px\" class=\"wp-caption alignnone\"><img class=\" \" title=\"Response rates during probe trials and with 10s gap\" alt=\"Response rates during probe trials and with 10s gap\" src=\"https://draftin.com:443/images/13949?token=aGlaeutUe9kQI-P4htfSJxUNnnihzpFxEiJRwORhrltva8BI2MM9ASCOXsXp2hItic9r4jedvXd6zu2yp-ZTgZs\" width=\"836\" height=\"241\" /><p class=\"wp-caption-text\">Response rates during probe trials and with 10s gap</p></div>\n<p>In baseline tests response rates were just around the target times, which means rats successfully learned how to time the three intervals.</p>\n<p>But when researchers inserted a fixed gap at the 15 second mark, the three timing functions behaved differently. The effect of a gap seems to increase with the relative duration of a gap to the timed interval.</p>\n<p>A 10s gap delayed the 10s timer by 30s (reset rule), by 20s the 30s clock (intermediate between stop and reset), and by 10s the 90s clock (stop rule). This suggests the clocks are operated independently.</p>\n<p>To see if this affects only responses, or actual timers, researchers tried progressively expanding the gap. A 1s gap had no effect on timing. A 3s gap reset the 10s clock, but did not affect the other two. A 10s gap reset the 10s and 30s clocks, and a 30s gap reset all clocks.</p>\n<p>One way to model this effect is to think of gaps as spending resources in the brain. This is essentially memory decay rate, which is proportional to the relative gap to criterion duration &#8211; <em>-salience*g/T<sub>k</sub></em>, where <em>g</em> is the gap and <em>T<sub>k</sub></em> is each clock&#8217;s criterion.</p>\n<p>If the criterion is short, <em>g/T<sub>k</sub></em> is large and memory decays quickly (the reset rule), if it&#8217;s long then the ratio is smaller and memory decays slower (run or stop rule). Using this we can simulate what happens in experiments &#8211; clocks resetting in a hierarchical manner as the gap increases.</p>\n<h2 id=\"psychological-models-of-interval-timing\">Psychological models of interval timing</h2>\n<p>Several models have been proposed to explain data from past interval-timing experiments, but they fail to predict the multiple parallel clocks behaviour.</p>\n<p>A <em>switch</em> model, which assumes that a switch stops accumulation of time in <a class=\"zem_slink\" title=\"Working memory\" href=\"http://en.wikipedia.org/wiki/Working_memory\" target=\"_blank\" rel=\"wikipedia\">working memory</a>, would predict that all three clocks should use the <em>stop</em> rule when a gap occurs. But present data clearly indicates that rats flexibly change behaviour of each clock independently.</p>\n<p>Another model says that <em>instructional-ambiguity</em> would reset clocks based on how similar the gap is to the timed signal. If it&#8217;s similar, the clock stops, if not, it resets. But in this experiment the signal and gap were identical and rats still used different rules for different clocks.</p>\n<p>The <em>passive memory-decay</em> model proposed by Cabeza de Vaca is a step in the right direction, but predicts clock behaviour should depend solely on gap duration. This experiment shows it depends on criterion duration as well.</p>\n<p>The <em>resource allocation</em> model suggested by the authors, assumes that during a gap resources are diverted from timing, which means working memory can&#8217;t maintain its current time. The gap&#8217;s effect is primarily a function of the contrast between the gap and timed interval. Memory decays with a ratio of <em>g/T<sub>k</sub></em>.</p>\n<p>Better still, this model can be used to model any type of distractor, not just timing intervals.</p>\n<h2 id=\"conclusion\">Conclusion</h2>\n<p>The authors found that multiple independent clocks are likely always running in our brain, timing separate events depending on the relative context they occur in. Their findings also have direct support from neurobiological studies showing that physically separate neurons handle the different clocks.</p>\n<p>I&#8217;m not sure what all this entails, but it&#8217;s definitely interesting. And I guess practical for multitasking.</p>\n<div class=\"zemanta-pixie\" style=\"margin-top: 10px; height: 15px;\"><a class=\"zemanta-pixie-a\" title=\"Enhanced by Zemanta\" href=\"http://www.zemanta.com/?px\"><img class=\"zemanta-pixie-img\" style=\"border: none; float: right;\" alt=\"Enhanced by Zemanta\" src=\"http://img.zemanta.com/zemified_e.png?x-id=e68bea08-dd21-4352-940b-7787d46d946c\" /></a></div>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"d7767c32-3f1a-56fd-9371-73fd9a66db3f"}}