{"data":{"wordpressPost":{"title":"Setting up a server only takes a while","content":"<p>\nYou know I&#39;ve always lived in this fantasy land where setting up a server only took five minutes at most. It was a simple as browsing to a certain directory on your computer, clicking a few times and voila it was all there. A brand new website ready for the people.\n</p>\n<p>\nBut you know what? It&#39;s apparently not quite that easy with real servers as I&#39;ve somehow managed to find out a few times already. First we had the incident of a german VPS where nothing quite worked, ever. At first it was, admitedly, my own fault as I did many a thing quite wrong. But then later on it started being purely the server&#39;s fault, the OS was old, nothing worked as it should and I was forced to coerce the boss into getting a new server. His words were: &quot;Find one and go ahead&quot;.\n</p>\n<p>\nSo I did. I did find two actually. This time I decided to throw frugality to the wind and find a local provider in Slovenia that would offer VPS hosting (because no sane shared hosting provider would ever suffice our needs) &#8230; turns out that&#39;s harder than it seems. I&#39;ve heard rumours of Domenca offering VPS, but apparently they haven&#39;t quite got there yet so in the end there were only two: sloHosting and Hostko. Wicked.\n</p>\n<p>\nAsked some questions and finally went with sloHosting because they provided Hardy Heron, which is what I use on the development server so I could be certain everything would work. Yesterday I was notified that hey, the server is up and ready, hope you love us. I did think I loved them until I found out the bitter truth &#8211; nothing, absolutely nothing, worked. After some nagging I found out today that they had forgotten to update the kernel (seriously guys, you&#39;re <em>actual</em> sysadmins and it takes a developer to notify you of something like this?).\n</p>\n<p>\nRight, everything did work this time. And so it began, the setting up of users, installing all the fancy weirdo things we need and so on. Since I&#39;m no sysadmin, or at best a hobbyist one, I was browsing google for almost anything I wanted to do, but I had learned some lessons from the german server and managed to do everything pretty cleanly, no major issues at all. In the end <strong>five bloody hours later</strong> everything ended up working and the web app is lovably installed and working well.\n</p>\n<p>\nNow we&#39;re left to hoping it&#39;ll be able to handle the load of alpha testing, because hell, everything worked, even with the dirty hacks, on the german host until semi-serious load came into play.</p>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"68979717-e76f-5c25-add1-e35b2d9d38ac"}}