{"data":{"wordpressPost":{"title":"How CV-driven development shapes our industry","content":"<img class=\"alignnone size-full wp-image-7868\" src=\"https://swizec.com/blog/wp-content/uploads/2017/10/quote.jpg\" width=\"2560\" height=\"1340\" srcset=\"https://swizec.com/blog/wp-content/uploads/2017/10/quote.jpg 2560w, https://swizec.com/blog/wp-content/uploads/2017/10/quote-300x157.jpg 300w, https://swizec.com/blog/wp-content/uploads/2017/10/quote-768x402.jpg 768w, https://swizec.com/blog/wp-content/uploads/2017/10/quote-1024x536.jpg 1024w\" sizes=\"(max-width: 2560px) 100vw, 2560px\" />\n<blockquote><p>\nAll that once was new is old again\n</p></blockquote>\n<p>You&#8217;re a beginner programmer. You landed your first job. You didn&#8217;t go to a famous college 👉 your job is at a small company making widgets.</p>\n<p>They hired you in part because the company can&#8217;t afford someone with experience. In return, you get to choose your own tech as long as the widgets work.</p>\n<p>You face a problem.</p>\n<p>How do you choose which technology to use? You don&#8217;t know.</p>\n<p>Your boss sees a lot of potential and knows you&#8217;re a bright young programmer full of piss and vinegar. They trust you to make the right choice. As long as the widget works.</p>\n<p>You read some blogs, buy some books, and do your research.</p>\n<p>You decide to do what the people you look up to are doing. You choose to build your widget using Docker deployed with Kubernets on top of AWS backed by a serverless queue infrastructure with MapReduce jobs for processing data and a React isomorphic frontend for server-side rendering.</p>\n<p>It takes you 5 months to build, costs $1,000/month to run, and serves your 100 users/month perfectly. You fix the minor hiccups pretty quickly.</p>\n<p>Your boss is worried about the cost, but you assure him all this machinery is necessary in case the widget suddenly takes off.</p>\n<p>You learn a lot.</p>\n<p>1 year passes. You&#8217;ve played with many technologies and learned all you could. None of your widgets took off.</p>\n<p>It is time to move on.</p>\n<p>You put &#8220;1 year experience in Kubernets and React and serverless and Firebase and Docker and Redux and Native and Vue and Angular and AWS&#8221; on your CV. You&#8217;ve earned it.</p>\n<hr />\n<p>You get a job at a funded startup. You continue to play with cool technologies.</p>\n<p>This time, the boss knows to rein you in, but gives you some slack so you don&#8217;t get bored.</p>\n<p>Some widgets take off, and your tech proves useful. The company card runs out of money and gets blocked.</p>\n<p>You raise a few more millions, get an article on TechCrunch and Forbes, and hit the front page of HackerNews five times.</p>\n<p>You keep your Kubernets and Firebase and Vue and AWS and Docker and Redux running through these trying times of rapid growth. Everyone loves your articles about the amazing tech stack you&#8217;ve built and how it keeps the startup afloat.</p>\n<p>You are the shit.</p>\n<p>3 years pass. You&#8217;ve learned all you could, so it is time to move on.</p>\n<hr />\n<p>You put &#8220;4 years experience in All The Things&#8221; on your CV. You get a job at a famous Name-Brand CompanyStartup.</p>\n<p>You breezed through the interviews and the onboarding. You have experience with all the tech Name-Brand CompanyStartup uses.</p>\n<p>You continue to play with cool tech.</p>\n<p>Everything works smoothly. Your Kubernets and Docker and Firebase and serverless isomorphic React and MapReduce are firing on all cylinders. The scale pushes your stack to its limits. You&#8217;re running on as many computers as you can buy.</p>\n<p>You now understand what all that tech was actually meant for. It&#8217;s barely keeping up.</p>\n<p>Your boss thinks you can squeeze a little more out of it. Get a little bit more scale. Drive the costs down just a little.</p>\n<p>But you can&#8217;t. Existing tech just can&#8217;t do it.</p>\n<p>You write articles and HackerNews comments and give talks at conferences and meetups about how all your favorite tech has failed you. It just doesn&#8217;t scale. You can&#8217;t push it to do enough, it&#8217;s expensive, and really ,it&#8217;s time for something new.</p>\n<p>You start work on something new.</p>\n<p>Your company gives you plenty of time and resources to improve their stack. You&#8217;re the wunderkind, and they have time. If you can&#8217;t make it cheaper, then who?</p>\n<hr />\n<p>2 years pass.</p>\n<p>Your new tech lowers cost by 5% and improves conversions by 2% and users rave about how great all the widgets are. Your engineering team loves working with their new stack, it&#8217;s great.</p>\n<p>You make it open source. You talk at all the conferences about how you made all the widgets better, you write articles and you write comments and you become a world-leading expert in your new tech.</p>\n<p>A young programmer reads your article and thinks, <em>&#8220;I need this in case my widget takes off.”</em></p>\n<p>The cycle repeats.</p>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"a6c54db5-dd8e-53a9-85db-5fcbcff03870"}}