{"data":{"wordpressPost":{"title":"What I learned from teaching StubHub about React and Redux","content":"<blockquote><p>\nHey Swiz,<br />We have a 2-day Intro to React and Redux workshop scheduled at Big Company next next Tuesday and our instructor dropped out.<br />1 day of React, 1 day of Redux a week later. 7 to 8 hours each.</p>\n<p>Can you jump in?</p>\n<p>~ Ben\n</p></blockquote>\n<p>It was Ben from <a href=\"http://www.realworldreact.com\">Real World React</a>, the React training company with a great meetup here in San Francisco, but no real website. They do things the hard way: sales and networking.</p>\n<p>By the time we met with StubHub to discuss what they were looking for, solidified that I was in fact doing it, and agreed on the business side of our arrangement, it was 4 days until the first workshop.</p>\n<p>I was trembling. How the hell do you prepare a full day workshop in just 4 days? From scratch because all your materials are <a href=\"https://swizec.com/reactd3js/\">React+D3v4</a>.</p>\n<p>2 days into that weekend from hell, I got an email:</p>\n<blockquote><p>\nWorkshop pushed to Friday. 2x people signed up. Needed bigger conference room.\n</p></blockquote>\n<p>Phew… Now I gotta entertain ~26 people, and I have 3 extra days to prepare 😅</p>\n<p><iframe width=\"580\" height=\"326\" src=\"https://www.youtube.com/embed/ix5iqTZ8WCo?feature=oembed\" frameborder=\"0\" allowfullscreen></iframe></p>\n<p>My previous workshops had been with <a href=\"https://github.com/freddyrangel\">Freddy</a>. He did React in the morning, I did D3 and React+D3 integration in the afternoon. All of our workshops were either at conferences or self-organized for people who wanted to improve their careers and paid for their own ticket.</p>\n<p>A full day workshop… that&#8217;s new territory.</p>\n<p>Can I even keep people engaged for 7 hours all on my own? Are corporate training people just as motivated? If your boss says <em>&#8220;Yo, we&#8217;re moving to React. Here&#8217;s a workshop we organized for you. Go learn,”</em> will you still care enough to pay attention?</p>\n<p>Like… challenge accepted, I guess?</p>\n<img src=\"https://swizec.com/blog/wp-content/uploads/2017/10/DLeFQVjU8AAPDrb-1-1024x768.jpg\" alt=\"\" class=\"alignnone size-large wp-image-7864\" srcset=\"https://swizec.com/blog/wp-content/uploads/2017/10/DLeFQVjU8AAPDrb-1-1024x768.jpg 1024w, https://swizec.com/blog/wp-content/uploads/2017/10/DLeFQVjU8AAPDrb-1-300x225.jpg 300w, https://swizec.com/blog/wp-content/uploads/2017/10/DLeFQVjU8AAPDrb-1-768x576.jpg 768w, https://swizec.com/blog/wp-content/uploads/2017/10/DLeFQVjU8AAPDrb-1.jpg 1200w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" />\n<p>Stressss</p>\n<p>The first workshop… well, I wouldn&#8217;t say it was a disaster. People learned React fundamentals and asked a lot of questions about state management. My answer to most of those was <em>&#8220;We&#8217;re going to talk more about that next week.”</em></p>\n<p>I think I aimed the content a little low for the room. Half the feedback said that we could have covered more content in a whole day workshop and spent less time coding things that aren&#8217;t super relevant to React principles.</p>\n<p>Examples are hard. Balancing how much to let your audience code on their own and how much to hold their hands is tough as nails.</p>\n<p>On the first day, I missed the mark.</p>\n<p>Everyone started super engaged then drifted off and got bored. By 4pm, I lost half the room. The rest stuck with me until 5 even though it was Friday.</p>\n<div id=\"attachment_7859\" style=\"width: 730px\" class=\"wp-caption alignnone\"><img class=\"alignnone size-full wp-image-7859\" src=\"https://swizec.com/blog/wp-content/uploads/2017/10/DLfgfdUUEAAk9xJ.jpg\" alt=\"See how tired I get towards the end?\" width=\"720\" height=\"540\" srcset=\"https://swizec.com/blog/wp-content/uploads/2017/10/DLfgfdUUEAAk9xJ.jpg 720w, https://swizec.com/blog/wp-content/uploads/2017/10/DLfgfdUUEAAk9xJ-300x225.jpg 300w\" sizes=\"(max-width: 720px) 100vw, 720px\" /><p class=\"wp-caption-text\">See how tired I get towards the end?</p></div>\n<p>I had exactly a week to prepare the 2nd workshop. It was focused on Redux, but I don&#8217;t use Redux on the day to day! A lot of my code uses MobX because there&#8217;s less to type. Hell, my day job is still all Backbone 😅</p>\n<p>But so is StubHub. Their goal with my workshops was to accelerate the transition from Backbone to React.</p>\n<p>Objective for the week: Create and prep a more ~~boring~~ real world example, something more e-commercey, the kind of stuff these people do in their jobs. Reduce the gap between what you&#8217;re teaching and what they&#8217;re doing so it&#8217;s easier for them to apply later.</p>\n<p>Less coding, more hand holding.</p>\n<blockquote class=\"twitter-tweet\" data-width=\"550\">\n<p lang=\"en\" dir=\"ltr\">Wow this post-it stuff really works. I shall continue this practice. Thanks for the idea <a href=\"https://twitter.com/levelsio?ref_src=twsrc%5Etfw\">@levelsio</a> and <a href=\"https://twitter.com/AndreyAzimov?ref_src=twsrc%5Etfw\">@AndreyAzimov</a> <a href=\"https://t.co/KQpqFdvnjM\">pic.twitter.com/KQpqFdvnjM</a></p>\n<p>&mdash; Swizec (@Swizec) <a href=\"https://twitter.com/Swizec/status/918871504347021313?ref_src=twsrc%5Etfw\">October 13, 2017</a></p></blockquote>\n<p><script async src=\"//platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></p>\n<p>And you know what? The 2nd workshop day went much better. People didn&#8217;t get bored, they didn&#8217;t drift off, and there was a palpable reluctance in everyone who left at 4pm.</p>\n<p>That&#8217;s just the way it is in the corporate world, you know. Friday 4pm, you&#8217;re out. Can&#8217;t blame &#8217;em. It was hard to stay focused and engaged for 7 hours straight for me, too.</p>\n<p>We did take breaks, but when that 3:30pm/4pm hits… you just start fading and becoming less and less engaging and vivacious as one audience member put it. &#8220;Very Vivacious presenter”… what a lovely compliment. ❤️</p>\n<p>The hard part of leading a workshop like that is that your energy dictates the room of the whole energy. <em>You</em> have to bring the energy. <em>You</em> have to be engaged and engaging and vivacious and high energy. <em>You</em> have to pull everyone back when their eyes start to close and their mind starts to wander.</p>\n<p><iframe width=\"580\" height=\"435\" src=\"https://www.youtube.com/embed/FaAlBSVp9M0?feature=oembed\" frameborder=\"0\" allowfullscreen></iframe></p>\n<p>Questions were much better at the Redux workshop, too. It&#8217;s hard to put my finger on it, but I think that&#8217;s because Redux is a bigger intellectual leap from how they already do things than React is.</p>\n<p>With React, you get HTML as a first-class citizen of JavaScript. Great.</p>\n<p>With Redux, you get a completely new way of thinking about the architecture of your webapp. Whoa.</p>\n<blockquote class=\"twitter-tweet\" data-width=\"550\">\n<p lang=\"en\" dir=\"ltr\">Teaching StubHub about Redux 😜 <a href=\"https://t.co/Q0hYUyPoEi\">pic.twitter.com/Q0hYUyPoEi</a></p>\n<p>&mdash; Swizec (@Swizec) <a href=\"https://twitter.com/Swizec/status/918934965051461632?ref_src=twsrc%5Etfw\">October 13, 2017</a></p></blockquote>\n<p><script async src=\"//platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></p>\n<p>So… what did I learn from all of this? A few things 👇</p>\n<ol>\n<li><strong>You <em>can</em> prepare a good full day workshop in 1 week</strong>. It&#8217;s stressful as fuck, but doable.</li>\n<li><strong>Materials don&#8217;t matter</strong> as much as you think. With a good example project, you can wing it for 5 hours and everyone will love it.</li>\n<li><strong>Use your livecoding practice</strong>. Write code live, talk about what you&#8217;re doing, take questions.</li>\n<li><strong>Leave smaller blanks for people to fill</strong>. At a workshop, people want to write code and see it run on their laptop. But the blanks you leave for them should be small. Smaller than you think is worth leaving.</li>\n<li><strong>Show some code, leave a blank, fill the blank, repeat</strong>. People are most engaged with short 2 to 3-minute blanks to fill. Write a bunch of code, leave a blank, tell them what to do, give them a few minutes, fill it in yourself, continue showing code.</li>\n<li><strong>Take anonymous feedback</strong>. In person, everyone says they loved your thing. Or they say nothing. When it&#8217;s anonymous, they don&#8217;t fear telling you exactly how it is.</li>\n<li><strong>Just do what the feedback says</strong> When you get that feedback, you know what, just do whatever it says and everyone&#8217;s happy. Who woulda thought, eh?</li>\n<li><strong>This stuff is still new to a lot of people</strong> My biggest surprise was that when you step away from the bleeding edge conversation Twitter, the world is gigantic and huge. We live in a little bubble where everyone knows more than we do and is far more advanced and we feel left behind. People at big corporations, the people writing JavaScript every day for billions of dollars, they still struggle with fat arrow functions and spread operators and transpiling and all the things we take for granted.</li>\n<li><strong>Enterprise sales are hard</strong> Ben says it took him around 6 months to organize this workshop from when he first started talking with StubHub. Corporate training is an enterprise sales business.</li>\n</ol>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"c7b8ff9a-b946-5b55-81e8-494d6a7614c6"}}