{"data":{"wordpressPost":{"title":"How our engineering team got 12x faster using these 5 lessons about integrating 3rd-party services","content":"<img src=\"https://media.giphy.com/media/mYqaRkXyoGbcY/giphy.gif\" alt=\"Rube goldberg machine\" />\n<p>At <a href=\"https://www.yup.com\">Yup</a>, we&#8217;ve been integrating a lot of 3rd-party services lately to help our sales team. First, we added <a href=\"https://getbase.com/\">BaseCRM</a> to the mix to help us manage leads, then we added <a href=\"https://www.activecampaign.com/\">ActiveCampaign</a> to help with email campaigns. A while ago, we integrated <a href=\"https://mixpanel.com/\">Mixpanel</a>.</p>\n<p>It took us 6 months to discover our Mixpanel integration had problems. Scaling hurt. <em>Small</em> scaling that is.</p>\n<p>It took us 3 months to get BaseCRM to work reliably.</p>\n<p>ActiveCampaign took just 1 week and it’s working great. 👌</p>\n<p><strong>That&#8217;s a 12x improvement in engineering team performance. </strong></p>\n<img src=\"https://media.giphy.com/media/CDJo4EgHwbaPS/giphy.gif\" />\n<p>You might think ActiveCampaign is much easier to integrate. Or maybe that it&#8217;s more reliable and has better documentation. Mixpanel, by far, has the best documentation of all three. BaseCRM… ugh.</p>\n<p>Really, it&#8217;s because we learned a couple painful lessons 👇</p>\n<h2>What makes 3rd party hard</h2>\n<p>Adding a 3rd party service is easy in theory. Every service out there claims to be one and done.</p>\n<p>Copy this code. Plop it in your app. You&#8217;re done. Hooray \\o/</p>\n<p>Stripe famously takes just 7 lines of code to integrate. Mixpanel says you can do it with just a few function calls.</p>\n<p>Basic integrations are easy. But most basic integrations take control away from you and your team and hand it over to the 3rd party service’s preferred setup.</p>\n<p><strong>But 👇</strong></p>\n<p>When something goes wrong, how do you debug it? You don&#8217;t.</p>\n<p>When the service errors out, what do you do? You crash your app.</p>\n<p>When your business folks want to get metrics, how do they do it? They use ten different dashboards for ten different services and hope for the best.</p>\n<p>That&#8217;s no way to build a unicorn. That&#8217;s how you build a sidehustle.</p>\n<h2>Track your own stuff</h2>\n<blockquote><p>\nHow are we going to know when something is wrong? How do we know what&#8217;s wrong?\n</p></blockquote>\n<p>Every 3rd party integration can go wrong. Services fall down, networks get crappy, traffic gets spikey.</p>\n<p>Hell, you could just forget to fill up your credit card and get your access revoked. Things happen ¯<em>(ツ)</em>/¯</p>\n<p>When something does happen, it&#8217;s important that you find out before your users do. Most services give you some ability to tell when something isn&#8217;t working. You can go into their dashboards, see metrics, and make sure things are wiggling in the right direction.</p>\n<p>But that means someone has to remember to check.</p>\n<img src=\"https://media.giphy.com/media/5fBH6zc5cLWMCWrISHK/giphy.gif\" />\n<p>Now, monitoring is a whole science of its own. If you have the funds, I warmly recommend getting a real monitoring expert to check your infrastructure and make suggestions. Read a book or three if you have time.</p>\n<p>In lieu of expert monitoring, adding rows to your database every time you ping a service is good enough. Store who you called, what you sent them, why you did it, when you did it, and build a chart that wiggles around when you add stuff.</p>\n<p>This helps you know things are working <em>and</em> gives you enough information to debug issues later. You can even replay requests and see what happens.</p>\n<h2>Keep your own data</h2>\n<p>Adding rows to the database for every service call brings us to the next lesson learned: Save your own data.</p>\n<p>3rd party services looooove to say you can rely on them, keep all of your data there, and live a carefree life with not a worry on your mind. This is great for them because the more data they have, the harder it is for you to leave. This is bad for you because the more data they have, the harder it is for you to leave.</p>\n<p>Storing your own data, even in a raw format, means you can pull the plug any time. Don&#8217;t like a service anymore? Find an alternative and switch.</p>\n<p>You can import your old data (or not). At least you have it. No need to worry about whether a service offers data export. No need to fret about how useful or not useful that export.</p>\n<p>Services love to offer data export without giving you anything crazy useful. You won&#8217;t find out until you try.</p>\n<p>Besides, if you keep all your data, you can run your own analytics, build a common dashboard for business metrics, correlate stuff across services, etc. Your product managers will love you.</p>\n<h2>Encapsulate &amp; isolate errors</h2>\n<p>You know all those places where you make a call to a service either through a library or directly? Each of those can fail.</p>\n<p>I wrote about <a href=\"https://swizec.com/blog/always-put-side-effects-last/swizec/8057\">building distributed transactions</a> before. Correctness across multiple services is <em>really</em> hard to ensure.</p>\n<p>When a call does go wrong, it&#8217;s important that it doesn&#8217;t break the rest of the system.</p>\n<p>A common problem is when you decide to process a bunch of entries in a loop.</p>\n<pre><code>for entry in queue\n    thirdParty(entry)\nend\n</code></pre>\n<p>If that <code>thirdParty</code> call fails, the queue stops processing. When you try again, it fails at the same spot. Your queue never processes, and it keeps growing.</p>\n<p>Ouch.</p>\n<p>You can wrap each call in a <code>try/catch</code> statement for your language. Skip over the failures, process everything else, and make a note in a database that the particular entry failed.</p>\n<p>Much better.</p>\n<p>An even better fix I&#8217;ve found is to make as many calls as possible in isolated background workers of their own. Tiny workers with one per 3rd party service call.</p>\n<p>It gives you error isolation, only 1 call per worker, and an easy way to retry calls. Most queue systems offer that, <em>and</em> you ensure entries don&#8217;t have to wait for each other. This makes your system fast.</p>\n<h2>Eventual consistency is your friend</h2>\n<p>The background worker approach to error isolation and call retrying brings us to the last lesson we learned: <strong>Eventual consistency is your friend</strong>.</p>\n<p>Eventual consistency was all the rage a few years ago when Cassandra and other NoSQL databases topped the charts of internet hype. Those continue to be great ideas. Your team is probably too small to make good use of them. Ours definitely is.</p>\n<p>You can use eventual consistency even if you&#8217;re in Postgres. Process stuff in workers.</p>\n<p>When a request comes in that involves a 3rd party service (or a webhook <em>from</em> a service), store  the raw payload in your database and have a background worker checking every few minutes to process those requests. Most things don&#8217;t have to happen inbound.</p>\n<p>When you&#8217;re sending things to a service, put them in the database instead and send them later. Then update whatever needs to update as a result of that call.</p>\n<p>It makes your system harder to test and understand, but it&#8217;s totally worth it. Would you rather have a more Rube-Goldbergian architecture or hotpatch a bug in production at 3am when everything falls apart and users are crying?</p>\n<img src=\"https://media.giphy.com/media/TfItZ1HqJCTza/giphy.gif\" />\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"74f72e48-5ce8-5761-8a5c-651639b4d178"}}