{"data":{"wordpressPost":{"title":"Significance","content":"<p>\n  In the past humanity has regarded itself as the single most significant thing in the universe. All stars circulated us and so did all other celestial bodies. Then came alone one Nicolaus Copernicus who defined the heliocentric system and suddenly we weren&#39;t quite the most important thing in the universe as far as planetary motion went, but we were still the most important in all other aspects.\n</p>\n<p>\n  Right now humanity seems to be at a stage where humans are the most developed life form in the whole known universe. To me this seems rather silly because it&#39;s based on absolutely nothing other than vanity and the feeling that we are the masters of our planet, even though we haven&#39;t explored even that fully.\n</p>\n<p>\n  The thing is in mainstream science it was for a long time believed that Earth is the only place suitable for life and when all the incidents with UFOs and such came out they were pushed into hearsay and science fiction. I&#39;m almost certain most sightings aren&#39;t aliens because when you think about it, why would aliens want to explore and befriend us? There is no reason behind it as for them to even be able to get here they would have to be far more technologically advanced and I believe humans dont&#39; try befriending ants.\n</p>\n<p>\n  Problem is that even with this idea in our heads we still only look for bacteria and even only fossil to prove there is perhaps, or once was, life outside our planet. Isn&#39;t that just a little bit pretentious? To basically be looking for proof that we&#39;re still the most significant force in the universe, yet we can&#39;t even get to another planet let alone solar system.\n</p>\n<p>\n<a href=\"http://video.google.com/videoplay?docid=-3974466981713172831\" target=\"_blank\">This video</a>, for example, shows just how insignificant we actually are.</p>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"231f2fed-fe01-52f2-835d-7c78b08ee406"}}