{"data":{"wordpressPost":{"title":"Loops are the hardest","content":"<p>There is an old truism in software engineering that <a href=\"https://blog.codinghorror.com/why-cant-programmers-program/\">199 out of 200</a> job applicants can&#8217;t code. Like, forget fizz buzz, can&#8217;t even write a loop.</p>\n<p>I don&#8217;t know if that&#8217;s true. Guess I got lucky. And I don&#8217;t interview that much anyway.</p>\n<p>But I do work with a lot of brilliant engineers in my React + D3 workshops. Go into a company, meet with a team who wants to learn some new tech, show them around for a day or two, and create a better team.</p>\n<p>It&#8217;s great.</p>\n<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">Workshopin’s fun <a href=\"https://t.co/3F2eTAMkBk\">pic.twitter.com/3F2eTAMkBk</a></p>\n<p>&mdash; Swizec (@Swizec) <a href=\"https://twitter.com/Swizec/status/963537340571398144?ref_src=twsrc%5Etfw\">February 13, 2018</a></p></blockquote>\n<p><script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></p>\n<p>My workshops involve a lot of coding. Practice makes perfect, and I find that a little struggle really helps the learning process.</p>\n<p>You know, code a bit, give them a challenge, let them solve it for a few minutes, show them how it&#8217;s done. It engages their brain, lets my voice rest a bit, and makes the workshop more interactive.</p>\n<p>People love it.</p>\n<p>Wanna know what all these brilliant, gainfully employed engineers struggle with the most?</p>\n<p>My hardest example is a color swatch. I show them this:</p>\n<p class='codepen'  data-height='365' data-theme-id='0' data-slug-hash='oYNvpQ' data-default-tab='js,result' data-animations='run' data-editable='' data-embed-version='2'>\nSee the Pen <a href='https://codepen.io/swizec/pen/oYNvpQ/'>d3 color scale</a> by Swizec Teller (<a href='https://codepen.io/swizec'>@swizec</a>) on <a href='https://codepen.io'>CodePen</a>.0</p>\n<script async src=\"//codepen.io/assets/embed/ei.js\"></script>\n<p>It&#8217;s a row of colorful rectangles that’s using D3 to get colors and React to render components in a loop.</p>\n<p>The idea is to show workshop participants how React makes code reuse simple, that D3 doesn&#8217;t have to be scary, and that all the basic JavaScript and programming concepts work great. It&#8217;s just code, the same kinda code you write all day.</p>\n<p>Then I ask them to turn this row into a checkerboard.</p>\n<p class='codepen'  data-height='565' data-theme-id='0' data-slug-hash='BYdZXd' data-default-tab='js,result' data-animations='run' data-editable='' data-embed-version='2'>\nSee the Pen <a href='https://codepen.io/swizec/pen/BYdZXd/'>d3 color checkerboard</a> by Swizec Teller (<a href='https://codepen.io/swizec'>@swizec</a>) on <a href='https://codepen.io'>CodePen</a>.0</p>\n<script async src=\"//codepen.io/assets/embed/ei.js\"></script>\n<p>And I don&#8217;t think anyone has ever solved it.</p>\n<p>We&#8217;re not talking beginners here. These are hard-working, smart engineers. The kind of people who grok Redux in an afternoon. Learn React in a few hours. Keep <em>massive</em> engineering infrastructure working smoothly every day. The kind of software projects that would make me shit my pants. They do it every day. It&#8217;s easy.</p>\n<p>Systems, processes, really complex fucking things. All easy. Many have forgotten more about software engineering than I ever knew.</p>\n<p>Changing a loop into a nested loop? Impossible.</p>\n<p>I mean, the simplest solution to my challenge is changing this 👇</p>\n<pre lang=\"javascript\">\n render() {\n    return (\n      <g>\n        {d3.range(20).map(i => (\n          <Swatch color={this.colors[i]} width={this.width.step()} x={this.width(i)} y=\"0\" />\n        ))}\n      </g>\n    )\n  }\n</pre>\n<p>To this 👇</p>\n<pre lang=\"javascript\">\n render() {\n    return (\n      <g>\n        {d3.range(20).map(j => d3.range(20).map(i => (\n          <Swatch color={this.colors[j%2 ? i : this.colors.length-i-1]} width={this.width.step()} x={this.width(i)} y={j*20} />\n        )))}\n      </g>\n    )\n  }\n</pre>\n<p>Wrap the iteration in another iteration, use that to change the <code>y</code> coordinate. When you&#8217;re on an even row, take colors from the left, take it from the right on odd rows.</p>\n<p>That&#8217;s all. A nested loop problem.</p>\n<p>When we solve it together as a class, I usually create a <code>&lt;Row&gt;</code> component and use that in a loop. Makes nesting easier to see and makes benefits of React more apparent.</p>\n<p>Maybe I have to change this example. Maybe loops <em>are</em> hard and I&#8217;m just delusional.</p>\n<p>Do people get so used to solving huge engineering problems inside massive systems that they forget how to write code?</p>\n<p>I know designing systems is super hard and takes a special kind of brain. It&#8217;s a whole different skill. How do you make this random process talk to that other mostly random process? How do you design your architecture so 50 engineers can work together? 1000 engineers? What about 10,000?</p>\n<p>But at the cost of forgetting how loops work? 🧐</p>\n<p>I&#8217;m both stumped and intrigued.</p>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"85c40abb-e2a5-536a-b64f-eef684207ad5"}}