{"data":{"wordpressPost":{"title":"Ko je prost dan zaposlen","content":"<div style=\"text-align: justify;\">Danes je bil prvi dan v seriji 6ih uradno prostih dni, zaporedja praznikov, ki nikogar pravzaprav ne zanimajo. Vse se vrti le okoli tega, da ni pouka, sluzb in podobnega, vendar pa je vsega skupaj pravzaprav le en ubogi dan pocitnic, vse ostalo so prazniki, ko teh stvari tako-ali-tako ni.</p>\n<p>Vendar pa danasnji dan vseeno ni bil prost in brez obligacij, saj sem pogumno sel na pomoc bivsemu sosolcu pri izdelavi seminarske naloge za maturo, da bi clovek dobil dobro oceno in podobne reci. Po deseturnem garanju se je uspelo spisati nekaj spodobnega in dolgega kar 17 strani, vendar pa to naj sploh ne bi bilo veliko. Stvar je prav strasna in me ustrahuje, da se bojim naslednjega leta, ko isto doleti tudi mene in se bo potrebno podajati v te vode za samega sebe&#8230; to je bil le nekaksen pripravljalni boj.</p>\n<p>Tudi danes, v bistvu bol danasnji vecer, sem gledal film <a href=\"http://www.imdb.com/title/tt0349683/\">Kralj Artur (King Arthur)</a>, ki je zelo odlicen film. Super rezija in izjemna zgodba z ravno pravim kanckom dobre stare zgodbe or Kralju Arturju in vitezih Okrogle mize. Tu je zgodba seveda sla malo drugac, naj bi bilo po bolj resnicnih zgodovinskih zapisih, a kdo bi vedel, vazno, da je zgodba super.</p>\n<div style=\"text-align: center;\"><img width=\"200\" height=\"150\" src=\"http://www.rapper.it/King%20Arthur-Guinevere.jpg\" alt=\"\" /></p>\n<div style=\"text-align: justify;\">V drugih novicah, pred nekaj dnevi mi je uspelo zrisati prvo zamenjavo stripa, ki bo zapolnjevala prostor dokler se ne naredi prvi strip, ki bo po nacrtih izdan nekje v prvem tednu maja. Pasic mi nekako ni uspelo narediti, ker se je izkazalo, da je izdelava pasice s katero bi bil clovek zadovoljen veliko tezja, kot pa se kaze na prvi pogled. Upam torej, da se bo dalo kaj narediti do konca praznikov.</div>\n</div>\n</div>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"d304effd-b3b4-551f-a830-fd525c426c6d"}}