{"data":{"wordpressPost":{"title":"Write sitting down, edit standing up","content":"<p>On March 26th I giddily said <a href=\"http://swizec.com/blog/it-takes-about-two-months-to-write-a-technical-book/swizec/6076\" target=\"_blank\">it takes about two months to write a technical book</a>. Still high from the recent success it seemed like the thing to do.</p>\n<div style=\"width: 274px\" class=\"wp-caption alignright\"><img title=\"Hemingway writing\" src=\"http://images.elephantjournal.com/wp-content/uploads/2010/04/Picture-359.png\" alt=\"Hemingway writing\" width=\"264\" height=\"454\" /><p class=\"wp-caption-text\">Hemingway writing</p></div>\n<p>It is now May 9th. I am <a class=\"zem_slink\" title=\"Film editing\" href=\"http://en.wikipedia.org/wiki/Film_editing\" rel=\"wikipedia\" target=\"_blank\">editing</a>.</p>\n<p>Well, sort of. I had thought my writing was awesome, that there will be hardly any editing needed and on 9th of April, just two weeks later, there was a reality check in my inbox.</p>\n<p>It was the editor: &#8220;Hey this is really great, solid writing, I just fixed some spelling and markup for ya.&#8221;</p>\n<p>And truly, all the fixes were either typos or <a class=\"zem_slink\" title=\"British English\" href=\"http://en.wikipedia.org/wiki/British_English\" rel=\"wikipedia\" target=\"_blank\">British English</a> &#8211; they want American. Something about markets.</p>\n<p>&#8220;Oh and shorten the book by 60 pages. We said 100, you wrote 180, we can do 120 tops.&#8221;</p>\n<p><em>*gulp*</em></p>\n<p>It is now May 9th. I am editing.</p>\n<p>The stickler is that my beta readers said they&#8217;d like even <em>more</em> content in the book, definitely not less. Obviously I can&#8217;t cut any content out of the book and I can&#8217;t make the code examples shorter either. People have already complained the examples are a bit terse and hard to understand at moments.</p>\n<p>I could take out some screenshots, but this is a book about creating shiny visualisations for the internet. Screenshots must stay.</p>\n<p>Only thing left is the writing. I have to go through the whole book and use less words to say more.</p>\n<p><em>*gulp*</em></p>\n<p>Facing such a monumental task it is therefore not a surprise I&#8217;ve only spent about 30 hours editing my book in the last month. That&#8217;s averaging just an hour per day &#8211; the average for writing was two and a half.</p>\n<p>And editing time isn&#8217;t even half as efficient as writing time. For every two minutes of staring bleary eyed at the screen, dragging the words through my mind like so much barbed wire, I spend five minutes prancing about on the internet feeling like I&#8217;m riding a unicorn in comparison.</p>\n<p>Editing really is sheer drudgery. There is no flow. There is no inspiration. Just a constant ruthless cutting and rewording. All those little things you thought added a special flair to the writing, let your personality shine through, entertained the reader.</p>\n<p>Waste. Plain old waste. Vomit of a writer who&#8217;s been staring at the screen too long.</p>\n<p>It all has to go.</p>\n<p>And the writing is <em>much</em> better for it. But you&#8217;re still sad to see it all go.</p>\n<p>Actually, not so much sad, as indifferent. You don&#8217;t feel anything but the monotonous drudgery of rewriting something you&#8217;ve already written and not coming up with anything new. You can&#8217;t, add something new and the word count goes up not down. Can&#8217;t have that!</p>\n<p>It&#8217;s been fairly successful too. I&#8217;ve finished the first two chapters. One cut down from 14 to 9 pages, the other from 51 to 40. Just by improving the writing. No loss of content.</p>\n<p>But it&#8217;s just so &#8230; it&#8217;s terrible.</p>\n<p>This weekend I discovered a trick, though. I was at a friend&#8217;s place and as I was editing in the kitchen I realized that the chairs are terrible and the table is the wrong height.</p>\n<p>Peeved, I moved to the counter. Editing standing next to the kitchen counter, shoulders slouched to stare at the screen &#8230;</p>\n<p>&#8230; before I knew it, two hours had passed and I edited five pages of text. Amazing! I had fallen into flow. <em>Editing!</em> Flow!</p>\n<p>I don&#8217;t actually know if this was because of my friend&#8217;s kitchen or because I was standing while writing. But I&#8217;m going to repeat the experiment today.</p>\n<p>Fingers crossed it works!</p>\n<div class=\"zemanta-pixie\" style=\"margin-top: 10px; height: 15px;\"><a class=\"zemanta-pixie-a\" title=\"Enhanced by Zemanta\" href=\"http://www.zemanta.com/?px\"><img class=\"zemanta-pixie-img\" style=\"border: none; float: right;\" src=\"http://img.zemanta.com/zemified_e.png?x-id=1c1fccc8-b519-4743-bf53-a2da2f56481a\" alt=\"Enhanced by Zemanta\" /></a></div>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"a7a63d2a-9acc-59f0-a301-c4dcf9831570"}}