{"data":{"wordpressPost":{"title":"How I got a visa normally reserved for nobel laureates","content":"<p>On December 31st, 2015, I became an alien of extraordinary ability.</p>\n<p>I still have to make a trip abroad to get my passport stamped with the new O-1 visa, but there&#8217;s a piece of paper in a lawyer&#8217;s office somewhere saying that I&#8217;m official. United States Citizenship and Immigration Services (USCIS) was even kind enough to tick a checkbox that says my visa starts working right away.</p>\n<p>According <a href=\"https://docs.google.com/viewer?url=https%3A%2F%2Ftravel.state.gov%2Fcontent%2Fdam%2Fvisas%2FStatistics%2FAnnualReports%2FFY2014AnnualReport%2FFY14AnnualReport-TableXVIB.pdf\">to statistics</a> only about 13,000 people got an O-1 visa in 2015. Compare that to the very-hard-to-get H1B visa which was awarded to <a href=\"http://money.cnn.com/2015/04/13/technology/h1b-cap-visa/\">85,000</a>.</p>\n<p>So how did a schmuck like me get a visa that&#8217;s normally reserved for world-renowned artists, Nobel laureates, top models, and others at the pinnacle of their industry?</p>\n<p>I had a great lawyer, and I had a guy who believed in me enough to pay that lawyer.</p>\n<p>That&#8217;s the gist of it. I would never have been able to pull it off on my own. A large part of getting a visa for those with an <em>&#8220;extraordinary ability in the sciences, arts, education, business, or athletics, …[that] has been recognized nationally or internationally for those achievements [or that ability]&#8221;</em> <a href=\"https://en.wikipedia.org/wiki/O_visa\">[1]</a> is having a lawyer who knows what kind of achievements impress USCIS and who can build a coherent application out of whatever scraps of info you can find that proves you&#8217;re extraordinary.</p>\n<p>It took me nearly two decades to amass those extraordinary scraps. It&#8217;s been:</p>\n<ul id=\"draft_check_box_list_0\">\n<li>2 years since I first asked a lawyer <em>&#8220;So, do I have a case?&#8221;</em></li>\n<li>5 years since I first said to myself <em>&#8220;The O-1 is best. What do I need to get it?&#8221;</em></li>\n<li>8 years since I first said to myself <em>&#8220;Fuck building websites for $7/hour. I wanna be a rockstar developer!&#8221;</em></li>\n<li>19 years since I first said to myself <em>&#8220;Books will be written about the things I invent.&#8221;</em></li>\n</ul>\n<p>I was a weird 9 year old … But that&#8217;s a story for another time.</p>\n<p><em>This</em> story started way back in freshman year of high school. I had just convinced my mum to spend my college fund on installing broadband internet in our house.</p>\n<p>The first thing I did when we got it was to download Jurassic Park 3 and K-Pax. The second thing I did was to start teaching myself how to build websites.</p>\n<p>I fell in love with PHP and CSS. Building websites was more fun than the DOS and Windows apps I had been building since 6th grade, and way more enjoyable than solving abstract algorithmic puzzles in my computer class.</p>\n<p><em>I could build things, man! I could right-click any website to see how it was built and then make my own! Holy shit!</em></p>\n<h3 id=\"at-15-i-got-my-first-job\">At 15 I got my first job</h3>\n<p>The following summer, my mum convinced the IT department at her work to take me on as an intern. They didn&#8217;t take interns, but they had a closet full of old computer parts that needed cleaning, so eh why not.</p>\n<p>I built a tiny widget for their intranet which crashed the entire website. I didn&#8217;t understand why my pure PHP bubble sort was so slow, but <em>&#8220;Oh-em-gee, somebody gave me money to write code. Holy shit!&#8221;</em>.</p>\n<p>I was also spending tons of time in forums, <em>the</em> social networks of the early 2000&#8217;s. Every popular site had one, and talking to people from around the world opened my eyes.</p>\n<p>I often read in the forums that <em>&#8220;To get a job as a programmer, you need experience. Doing open source is good for that.&#8221;</em></p>\n<p>So I started contributing to the thriving open-source ecosystem of modifications for phpBB &#8211; the most popular forum software. My most successful mod, a way to add descriptions under topic titles, had over 10,000 downloads. This was my first claim to fame.</p>\n<p>Eventually, I got frustrated with phpBB, so I started building my own forum software that would be easier to modify. It was based on modules from the ground up, and with time, it became a full-blown CMS. Even if it was never popular, it helped land me a job at an agency creating websites.</p>\n<h3 id=\"by-19-i-had-a-real-job\">By 19 I had a real job</h3>\n<p>At that job, I single-handedly built the City Museum of Ljubljana website based on my own open-source CMS system with just PDF design specs and a lot of project-manager handwaving to work off of. That agency owner must have had a great deal of faith (and cojones) to let a high school senior run the whole tech side of the agency.</p>\n<p>After working 10-hour days and saving money all summer, I took a hard-earned vacation: two weeks by myself in London.</p>\n<p>In the London Science Museum, I discovered that my childhood heroes &#8211; people like Watt, Edison, and Bell &#8211; weren&#8217;t famous because they were inventors. They were famous because they were businessmen.</p>\n<p>Something clicked.</p>\n<p>I started reading about startups, and I saw that programmers made <em>way</em> more than $7/hour. I learned about a special class of programmer who can charge however much they want &#8211; the rockstars. They have fame and fortune and travel the world to speak at conferences and write blogs and have pockets lined with wads of cash.</p>\n<h3 id=\"at-20-i-decided-to-become-a-rockstar-ninja\">At 20 I decided to become a rockstar ninja</h3>\n<p>So naturally, I started blogging.</p>\n<p>Through my blog, I started connecting with the local tech community on Twitter. Meeting them in person would have been far too strange. I wouldn&#8217;t know what to say! I made plenty of time for Twitter and quickly became a mini-celebrity. Everyone knew about @swizec.</p>\n<p>That next year, <a href=\"http://www.zemanta.com/company\">Zemanta</a> won the first ever <a href=\"http://seedcamp.com\">Seedcamp</a>. These were guys from my hometown in Slovenia, and their startup was making it big in the tech world, getting VC money from the UK, the US, and who knows where else.</p>\n<p>They were my heroes.</p>\n<p>It seemed like all you needed to make it big and become a rockstar was an idea and some luck. Then VC investors would throw money at you.</p>\n<p>I started building my own product that could make shitloads of money and become VC-backed &#8211; a Twitter client. Like TweetDeck, but oh-so-much smarter.</p>\n<p>Zemanta came back from the UK with something far more important than just inspiration for an entire generation, though. They came back with an injection of real startup culture.</p>\n<p>Their community manager &#8211; Gandalfar &#8211; brought back his experience with <a href=\"https://en.wikipedia.org/wiki/BarCamp\">barcamps</a>: community-driven un-conferences where regular developers gather, slap together a schedule of talks, and exchange ideas.</p>\n<p>He organized Ljubljana&#8217;s very first Barcamp in January 2009.</p>\n<h3 id=\"i-gave-my-first-talk-at-ljubljana's-first-barcamp\">I gave my first talk at Ljubljana&#8217;s first Barcamp</h3>\n<p>The internet told me that rockstars give talks, so I showed up and put my &#8220;Better Twitter Client&#8221; talk on the list. I was going to pitch this thing and I was going to become a famous startup founder.</p>\n<p>It got a ton of hype. People I&#8217;d never even heard of came up to me and asked about this thing I was building. <em>gulp</em></p>\n<p>But my talk tanked. I ran out of things to say after 5 minutes. A guy I didn&#8217;t know (an angel investor who later became a VC) asked me questions I couldn&#8217;t answer. People grumbled in the hallways <em>&#8220;Fuck that guy. He wasted a 45 minute slot. We could&#8217;ve had a real talk.&#8221;</em></p>\n<p>Things did not go well.</p>\n<p>But I kept building. I kept blogging. I kept tweeting.</p>\n<p>One of the inventors of the PNG format is from Slovenia, and he also gave a talk at that Barcamp . We didn&#8217;t meet that day, but I blogged about <a href=\"http://swizec.com/blog/my-barcamp-ljubljana-report/swizec/16\">liking his talk</a>. A few years later, we connected via email and stayed in touch.</p>\n<p>His reference letter was instrumental in getting my visa. Few things impress a government official more than a letter saying <em>&#8220;I invented one of the most popular image formats, and I say this guy is cool.&#8221;</em></p>\n<h3 id=\"then-my-side-project-became-a-startup\">Then my side-project became a startup</h3>\n<p>That failed Barcamp talk turned into an invitation to join the inaugural cohort at Ljubljana&#8217;s first startup incubator. I quit my job and turned my side-project into my full-time project.</p>\n<p>My next chance to &#8220;be a rockstar&#8221; was the first <a href=\"http://hancic.info/php-konferenca-2009\">PHP Conference in Ljubljana</a>. This time, I had enough to say to last the full 45 minutes.</p>\n<p>My talk was shitty, and meeting people in person was still weird. I overheard someone say about my talk: <em>&#8220;Oh, that nervous dude? Yeah, you could tell HE knew what he&#8217;s talking about, but I have no idea what he said.&#8221;</em></p>\n<p>I was scared shitless, and I had no idea what I was doing, but I was going to be a rockstar even if it killed me. I couldn&#8217;t go back to building websites for $7/hour.</p>\n<p>So I kept building, I kept blogging, and I did a presentation anywhere they&#8217;d have me. I was shitty, but I was entertaining, and I was getting better.</p>\n<p>It took 1444 posts, but eventually my first taste of broader fame came when <a href=\"http://swizec.com/blog/apples-ping-is-a-big-pile-of-steaming-dung/swizec/1444\">I was the first to shit on Apple Ping</a>. This was my first post to make the frontpage of HackerNews.</p>\n<p>Even <a href=\"https://en.wikipedia.org/wiki/Fred_Wilson_(financier)\">Fred Wilson</a> used my Apple Ping post to say <em>&#8220;Swizec said everything I wanted to say!&#8221;</em>. I thought I had died and gone to heaven. This was the main investor in Zemanta, and he mentioned <em>me</em> by name! Mum, I made it! I have arrived!</p>\n<p>My problem was that I didn&#8217;t have the know-how or the cojones to turn that event into an opportunity for our startup.</p>\n<p>After two years, the startup tanked. But in the process, we got a government grant, became Seedcamp finalists in Prague, and appeared in local press a few times. These were the first achievements to make it into my O-1 visa application.</p>\n<h3 id=\"in-2011,-i-tasted-silicon-valley-for-real\">In 2011, I tasted Silicon Valley for real</h3>\n<p><a href=\"http://doublerecall.com/\">DoubleRecall</a> got into YCombinator the summer after my startup tanked. They were the first Slovenian startup ever to get in, and I convinced them to take me on as an intern. They thought my blog was dumb, but they couldn&#8217;t deny that I had built a bunch of cool shit.</p>\n<p>The experience taught me how successful startups work and what makes them tick, particularly in the US.</p>\n<p>In turn, my blog got better, my tweeting got more popular, and I made regular appearances on the HackerNews front page.</p>\n<p>Now even people outside of Slovenia knew about @swizec, that crazy dude with a hat.</p>\n<p>That winter I wrote <a href=\"http://swizec.com/blog/why-programmers-work-at-night/swizec/3198\">Why Programmers Work At Night</a>. It&#8217;s the most popular thing I&#8217;ve ever written. I even turned it into a book, which I still haven&#8217;t finished, but anyway.</p>\n<p>It got me noticed by Business Insider, by the Huffington Post, even by BBC radio.</p>\n<p>My time had come. My blog was famous. I had become a Rockstar Programmer &#8482;.</p>\n<h3 id=\"in-2012,-i-dropped-out-of-college\">In 2012, I dropped out of college</h3>\n<p>While researching Github data to look for programmer work patterns, I built a visualization. Because my blog was famous now, a <a href=\"https://www.packtpub.com\">Packt</a> acquisition editor noticed my post. That lead to a book deal with a real publisher to write <a href=\"https://www.packtpub.com/web-development/data-visualization-d3js\">Data Visualization With d3.js</a>.</p>\n<p>Around the same time, I decided to drop out of college to work as a freelance developer for startups from Silicon Valley. My client acquisition strategy amounted to &#8220;I have a famous blog and I&#8217;m popular on HackerNews&#8221;.</p>\n<p>Surprisingly, I had no problem getting clients, and I got a taste of working for US companies. I became familiar with their payment ethic, their approach to work, and their culture. I decided I had to move to the US. It&#8217;s the center of the tech world; only an idiot wouldn&#8217;t take that chance.</p>\n<p>However, work visas are damn near impossible to get if you haven&#8217;t graduated college, and I&#8217;m still too young to have the 15 years of full-time employment experience that you need to compensate for the lack of a college degree.</p>\n<p>I had a famous blog though. And a real publisher book on the way. <em>And</em> a self-published book.</p>\n<p>Let&#8217;s try for an O-1!</p>\n<p>I kept blogging, I kept writing, I kept building my freelance business, and I kept giving talks at local events whenever I could.</p>\n<p>In 2013, I started working more closely with a Menlo Park startup I really liked. We asked a lawyer if I could get an O-1 visa. They said my chances were slim because even though I was great at talking about programmers, I wasn&#8217;t that great at programming.</p>\n<p>And really, I just wasn&#8217;t as great as I thought I was.</p>\n<h3 id=\"in-2013,-i-still-wasn't-good-enough\">In 2013, I still wasn&#8217;t good enough</h3>\n<p>Instead of giving up, I started building a better case.</p>\n<p>In April 2014, I gave my first talk abroad &#8211; Write The Docs in Hungary. A speaker had dropped out at the last minute, and based on videos of my older talks, the organizers thought I had an interesting presentation style.</p>\n<p>One of the conference recap blogs said: <em>&#8220;Swizec had every­one simulta­ne­ously laugh­ing, com­mis­er­at­ing and applaud­ing with his epic tale of blood, sweat, tears and rewrites.&#8221;</em></p>\n<p>That summer, I was invited to give a 2nd-day keynote at DrupalCamp Alpe Adria about why programmers work at night. The organizers knew me from the internet, had seen my older talks, and generally thought I could help.</p>\n<p>One of the audience members had this to say: <em>&#8220;First talk of the conference that made me want to close my laptop.&#8221;</em></p>\n<p>Much better than that first Barcamp talk in 2009!</p>\n<h3 id=\"in-2014,-it-started-snowballing\">In 2014, it started snowballing</h3>\n<p>I spent much of 2014 working with the kind of startups that enabled me to say that my code has been used by MasterCard, Mashable, Google, and other fancy names. My contribution may not have been huge, but it&#8217;s there, and they used it.</p>\n<p>In March 2015, I was the &#8220;committee chair&#8221; for Webcamp, which meant I helped Gandalfar pick talks. This looked <em>amazing</em> on my visa application.</p>\n<p>Also in early 2015, I published a visualization video course through Packt, and I launched my second self-published book &#8211; React+d3.js.</p>\n<p>I became more involved with another startup who was then mentioned in Forbes, on TechCrunch, and in various other noteworthy places. I&#8217;m not mentioned by name, but it looked great in my visa application.</p>\n<h3 id=\"in-2015,-i-got-it\">In 2015, I got it</h3>\n<p>In October 2015, I got to speak at one of the biggest web conferences &#8211; <a href=\"http://html5devconf.com/\">html5devconf</a> &#8211; because when they looked me up on the internet, they saw my rather impressive library of stuff.</p>\n<p>This also looked great on my visa application.</p>\n<p>But what I think looked best on my application for the coveted O-1 visa were the reference letters: one from the founder of that startup that made it onto Forbes; another from the inventor of PNG; and yet another from the organizer of Webcamp, the biggest conference series in Slovenia.</p>\n<hr />\n<p>So here we are. It&#8217;s 3:30am, I&#8217;m sitting in an overpriced apartment in San Francisco, and a piece of paper in a lawyer&#8217;s office says that I&#8217;m an alien with extraordinary achievements. Cool, huh?</p>\n<p>The things that looked particularly good on my application were:</p>\n<ul id=\"draft_check_box_list_1\">\n<li>consulting and advising other companies (freelancing)</li>\n<li>global recognition (speaking at conferences)</li>\n<li>significant contributions to the field (semi-popular books/courses)</li>\n<li>having published materials in recognized journals (Business Insider, HuffPost, etc.)</li>\n<li>high income (income arbitrage: US client thinks you&#8217;re cheap, Slovenia thinks you&#8217;re rich)</li>\n<li>judging the work of others (picking talks)</li>\n<li>amazing reference letters (thank you!) (result of chance encounters)</li>\n</ul>\n<p>If there is any point to all this, it&#8217;s to show you that you <em>can</em> do it. Do the thing, then keep doing the thing. Whatever your thing might be.</p>\n<p>The more you do, the more you&#8217;ll get a chance to do.</p>\n<p><strong>Thanks</strong> to Will Fanguy, Morgane Suel, Anze Pecar, and Jure Cuhalev for reading draft versions of this post.</p>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"08258ee3-bb6a-54ce-addb-4d01b014e089"}}