{"data":{"wordpressPost":{"title":"Top 10 iPhone Apps for Web Designers","content":"<p><em>This is a guest post by Jan Pierce &#8211; a 4th grade teacher who has over 20 years of experience in the classroom. Her interests include educational technology and online learning. She also owns the site <a href=\"http://www.elementaryeducationdegree.com\">Elementary Education Degree</a> for students interested in earning a degree in elementary education.</em></p>\n<p><strong>1. </strong><a href=\"http://itunes.apple.com/us/app/ego/id306785502?mt=8\"><strong>Ego</strong></a><strong> – </strong>This is an essential app for anyone in the web business. Ego allows you to check statistics like visits, feed subscriptions, Twitter followers, and more on a daily or hourly basis. Instead of visiting a bunch of different websites, all you need to do is open this single application. It supports sites like Google Analytics, Twitter, Squarespace, Vimeo, and more. ($1.99)</p>\n<p><strong>2. </strong><a href=\"http://itunes.apple.com/us/app/palettes/id297157708?mt=8\"><strong>Palettes</strong></a><strong> – </strong>Don’t you wish you had a way to capture a color you see online? Now you can with this application. Take a color directly from any online image and create a palette, or import a palette from another photo program. This is a great way to use Professional color schemes without wasting time to create them for every site you make. (Free)</p>\n<p><strong>3. </strong><a href=\"http://itunes.apple.com/us/app/whatthefont/id304304134?mt=8\"><strong>WhatTheFont</strong></a><strong> – </strong>Identify fonts wherever you go with this handy application. Take a photo of a word and find out what its font is in seconds to help you gain quick inspiration for your own sites. This app has gained a cult status among web designers for a very good reason. (Free)</p>\n<p><strong>4. </strong><a href=\"http://itunes.apple.com/us/app/ftp-on-the-go/id286479936?mt=8\"><strong>FTP On The Go</strong></a><strong> – </strong>This app allows you to perform maintenance on your website, no matter where you are. You can also edit files on an FTP server and check other applications while staying in the FTP all. This is one of the most downloaded web business apps on the market. ($6.99)</p>\n<p><strong>5. </strong><a href=\"http://itunes.apple.com/us/app/zeptopad-free-brainstorming/id299173403?mt=8\"><strong>ZeptoPad</strong></a><strong> – </strong>Forget the tiny keypad on your iPhone. This app lets you draw on the screen with you finger to brainstorm and jot down notes. You can also save what you make in a JPEG format to send to your friends and colleagues. (Free)</p>\n<p><strong>6. </strong><a href=\"http://itunes.apple.com/us/app/css-cheat-sheet/id301093674?mt=8\"><strong>CSS Cheatsheet</strong></a><strong> – </strong>Even experienced developers need to look up CSS commands every once in a while. This is a reference sheet for those on the go who just need a little reminder so that they don’t have to waste their time searching online. ($0.99)</p>\n<p><strong>7. </strong><a href=\"http://itunes.apple.com/us/app/seo-pro/id377980606?mt=8\"><strong>SEO Pro</strong></a><strong> – </strong>Track the progress of all your domains by viewing various page rank factors from Google, Yahoo, and more. Since this app allows you to monitor unlimited urls, you can even track your competitors’ sites as well. ($0.99)</p>\n<p><strong>8. </strong><a href=\"http://itunes.apple.com/us/app/worktimer/id293280857?mt=8\"><strong>WorkTimer</strong></a><strong> – </strong>Do you have trouble keeping track of how many hours you work on each of your projects? This app will track them for you so that you can provide clients with accurate billing information. At the end of each month, you can send out emails with project records. ($0.99)</p>\n<p><strong>9. </strong><a href=\"http://itunes.apple.com/us/app/cliqcliq-colors/id291725775?mt=8\"><strong>CliqCliq Colors</strong></a><strong> – </strong>Find and edit colors with a precise, easy-to-use functionality. Quickly convert scales and formats that are compatible with all the major types of photo editing software. You can also extract colors from your iPhone photos or Flickr. (Free)</p>\n<p><strong>10. </strong><a href=\"http://itunes.apple.com/us/app/analytics-app/id303689911?mt=8\"><strong>Analytics</strong></a><strong> – </strong>If you already have a Google Analytics account, this app will bring all of its amazing features to your iPhone. View 55 different reports as well as information for site traffic and e-commerce. You won’t find an analytics app nearly as detail-oriented as this one. ($6.99)</p>\n<h6 class=\"zemanta-related-title\" style=\"font-size: 1em;\">Related articles</h6>\n<ul class=\"zemanta-article-ul\">\n<li class=\"zemanta-article-ul-li\"><a href=\"http://appleissimo.com/2012/01/25/iphone-ipad-tutorial-how-to-get-settings-shortcuts-on-your-home-screen/\">iPhone / iPad Tutorial &#8211; How To Get Settings Shortcuts On Your Home Screen</a> (appleissimo.com)</li>\n<li class=\"zemanta-article-ul-li\"><a href=\"http://hypebeast.com/2012/02/nooka-iphone-application/\">Nooka iPhone Application</a> (hypebeast.com)</li>\n<li class=\"zemanta-article-ul-li\"><a href=\"http://www.phonehour.com/how-to/how-to-control-your-pc-with-your-iphone/\">How To Control Your PC with Your iPhone</a> (phonehour.com)</li>\n<li class=\"zemanta-article-ul-li\"><a href=\"http://www.cultofmac.com/144193/apple-going-to-war-against-devs-who-use-white-iphones-to-advertise-apps/\">Is Apple Going To War Against Devs Who Use White iPhones To Advertise Their Apps?</a> (cultofmac.com)</li>\n</ul>\n<div class=\"zemanta-pixie\" style=\"margin-top: 10px; height: 15px;\"><a class=\"zemanta-pixie-a\" title=\"Enhanced by Zemanta\" href=\"http://www.zemanta.com/\"><img class=\"zemanta-pixie-img\" style=\"border: none; float: right;\" src=\"http://img.zemanta.com/zemified_e.png?x-id=add1a9cb-5491-48a5-8f9e-0974c3696f29\" alt=\"Enhanced by Zemanta\" /></a></div>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"6afd1000-4ea4-59db-ae10-094476b05453"}}