{"data":{"wordpressPost":{"title":"The surprising difficulty of paying the US government","content":"<p>You have to pay taxes to the United States government if you’re in the country for more than 180 days. It doesn’t matter why you’re here. It doesn’t matter how you’re here. When you’re here for more than half the year, you have to file a tax return and pay your taxes.</p>\n<p>Of course, nobody is going to notice if you don’t. They’re not gonna chase after you. Or even care, really.</p>\n<p>Until they do.</p>\n<p>Did you know the government can retroactively get you for tax evasion for up to five years post facto? You can’t file and pay your taxes post facto.</p>\n<p>Which is kind of unfair, but if you’re filing your tax returns and paying your taxes anyway, you’ve got nothing to worry about.</p>\n<p>And so I paid my taxes. On June 15th, 2016.</p>\n<h2>So it begins…</h2>\n<p>The story begins back in November 2015. I realized, “<em>Holy shit. I’m gonna have to pay taxes in April, and I have no idea how much I should save up for the occasion. Do I need $1k, $30k, $5k, $20k … how much should I have?</em>”</p>\n<p>Most people don’t care &#8211; their taxes happen automagically. Mine don’t. Even in Slovenia, there is some work involved because I’m technically a business, not a person.</p>\n<p>In the US, Uncle Sam is all <em>“Swizec who?”</em> right up until a potential moment in the future when he suddenly begins to care.</p>\n<p>So I did the adult thing, and I asked my immigration lawyer to recommend a good CPA who knows about foreigners and immigration and the intricacies involved.</p>\n<p>That CPA got scared and stopped responding to my emails.</p>\n<p>Eventually, I teased an intro out of a friend of mine who’s done this before. This CPA firm was promised to be “good, but expensive”. The “expensive” part was true; the invoice nearly made me shit my pants.</p>\n<p>Along with the cost though, the new firm wasn’t just good. They were amazing. They answered all of my questions over the phone, and they agreed to take me on for a thorough investigation of “what we can do”. Our goal: pay Uncle Sam as little as possible.</p>\n<h2>Mission: Improbable</h2>\n<p>In March, we had a meeting. The security guard almost kicked me out of the fancy FiDi skyscraper. Boosted Boards are frowned upon.</p>\n<p>After the main CPA guy vouched for me, I was allowed to stay. First hurdle cleared! \\o/</p>\n<p>Three of us pored over bilateral agreement after bilateral agreement. We investigated the realities of some things, the plausible deniability of other things, the fluid interpretations of it all. At the very least, we figured I’d only have to pay US taxes for the part of 2015 that I was, in fact, in the US.</p>\n<p>Note to self: When your business is tied to your laptop, the US government does not care where it’s incorporated. If you’re in the US, that’s US income.</p>\n<p>Inconveniently, Slovenia counts it as Slovenian income because that’s where the business is registered.</p>\n<p>Joy.</p>\n<p>With all of that figured out, the firm suggested I get a Social Security Number (SSN). This makes it easier (and a bit cheaper) to pay taxes. Getting the alternative Tax Identification Number (TIN) is a long and painful process. In addition, I can use the SSN for a bunch of other stuff, too.</p>\n<p>So in March, I applied for a SSN.</p>\n<h2>A Hitch in the Plan</h2>\n<p>By April 15th – the tax filing deadline – I still didn’t have my SSN.</p>\n<p>The accounting firm suggested I give it up and move on. The government doesn’t have a filing option for <em>“Please give me an extension because I’m waiting for my SSN”</em>. You can only ask for an extension if you already have an SSN or if you’re waiting for a TIN.</p>\n<p>My corner case is not in the system. Best to ignore the problem and hope nobody notices, right?</p>\n<p>In May, I gave up waiting for my SSN to arrive. A 30-min early morning queueing later, the social services clerk said that my SSN probably got lost in the mail.</p>\n<p>Oops, sorry. The US Postal Service lost it. But it’s okay, we’ll send you a new one. Probably tonight, maybe later.</p>\n<p>You’ll know when you get it.</p>\n<p>Ugh.</p>\n<p>Get it, I did. Only a week later. Hooray!</p>\n<p>It was now the end of May and my CPA could finally calculate my taxes for real, prepare all the documents, and do the other necessary things. Then they sent the documents to me. On paper. On a <em>bunch</em> of paper.</p>\n<p>Why paper, you ask? Because as a dirty foreigner, I can’t file my tax returns digitally. Or was it because it’s my first time? Either way, I could only file my tax returns on paper by snail mail.</p>\n<p>The same snail mail that once lost my SSN. If they lose this, I can potentially go to jail. Ain’t that grand?</p>\n<p>Then again, I have two nondescript tiny pieces of paper saying <em>&#8220;Yes, he did send <strong>something</strong> to the tax authorities on 15th of June”</em>, but no real proof of <strong>what</strong> that something was.</p>\n<p>Is that enough to prove I did my best to file on time? Who knows.</p>\n<p>Notice, it took from the beginning of March to mid-June to file the things. Four months. Four.</p>\n<h2>Problem solved, right?</h2>\n<p>That’s not even the best part.</p>\n<p>Because this is my first time filing taxes, I can only pay by check. You know, that thing that’s been illegal in Europe for 20 years because it’s too insecure to act as a payment mechanism?</p>\n<p>Well, I’m now paying a few tens of thousands of dollars using it.</p>\n<p>To make it more fun, I was asked to write my SSN on that flimsy piece of paper as well. You know, just in case embezzling a few thousand dollars from me wasn’t enough, anyone can also use them to steal my identity.</p>\n<p>So I hope the USPS is honest and no thievery happens, and I pray that nobody at the tax authorities’ mailroom gets any ideas. There’s totally no chance anything in the long chain of trusting disgruntled minimum wage employees could ever go wrong. Nope, not a thing.</p>\n<p>And yes, before you ask, the US government <em>does</em> allow paying taxes digitally with a bank transfer. But they only allow a transfer from a US account, and even then only if you know details about your past tax returns to prove your identity.</p>\n<p>Guess who doesn’t have past tax returns? Me.</p>\n<p>So I had to transfer a bunch of money from my savings account in Europe to my day-to-day bank account in the US. That cost some $200 on <a href=\"http://transferwise.com/\">TransferWise</a> and was almost painless. TransferWise needed some hoop jumping, but overall, it was the most painless part of the entire process.</p>\n<p>Then I had to buy checks from my bank (wtf?). I asked my girlfriend to fill them out for me because I have never even seen a check in my life. They were banned about 5 years before I got my first bank account and about 10 years before I could actually use one on my own.</p>\n<p>Now those checks, with my SSN and all of my banking info and all of my personal info and some other magic numbers, are in a big white envelope on their way to some random post office box that my CPA says is correct. And I have to keep all of the money for a year’s worth of taxes in my day-to-day account until somebody somewhere cashes the checks and my money goes <em>poof</em>.</p>\n<p>It could be today. It could be tomorrow. It could be <em>never</em> because the mail gets lost. And don’t forget that there’s still a chance my identity gets stolen and we do the spiel all over again.</p>\n<p>?? ?? ??</p>\n<p>\\*headdesk\\*</p>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"afae9103-5c59-5af5-97f7-d8d348e1fe0a"}}