{"data":{"wordpressPost":{"title":"Week 18: the role of diet in periodontal disease","content":"<p><em>[This post is part of an ongoing challenge to understand 52 papers in 52 weeks. You can read previous entries, <a href=\"http://swizec.com/blog/category/52-papers-in-52-weeks\">here</a>, or subscribe to be notified of new posts by <a href=\"http://swiz.ec/52papers-list\">email</a>]</em></p>\n<p><a class=\"zem_slink\" title=\"Periodontitis\" href=\"http://en.wikipedia.org/wiki/Periodontitis\" target=\"_blank\" rel=\"wikipedia\">Periodontitis</a> is a terrible disease that causes gums to detach from teeth, the bones holding your teeth to melt away, and can cause your teeth to fall out. You likely have it <em>right now</em>!</p>\n<p>About 43% of all adults in the UK have some form of periodontitis. 85% of those older than 65. Yikes!</p>\n<p>In their 2013 paper, <a href=\"http://www.bsdht.org.uk/res/DH%20May%20p18-21.pdf\">The Role of Diet in Periodontal Disease</a>, MR Milward and ILC Chapple wrote about what sort of diet makes you more susceptible to periodontitis and how. The gist of it is: avoid refined carbs, antioxidants are good.</p>\n<h2 id=\"periodontitis\">Periodontitis</h2>\n<p>Periodontitis is a set of <a class=\"zem_slink\" title=\"Inflammation\" href=\"http://en.wikipedia.org/wiki/Inflammation\" target=\"_blank\" rel=\"wikipedia\">inflammatory diseases</a> that affect the tissues holding your teeth in place &#8211; the periodontium. This includes both the soft (gums, periodontal ligament) and hard (cementum, alveoral bone) tissues.</p>\n<p>The root cause are microorganisms that build up on your teeth, if you don&#8217;t floss and brush as much as your dentist would like you to. I don&#8217;t think anyone does &#8230; dentists are hard to please.</p>\n<div style=\"width: 424px\" class=\"wp-caption alignnone\"><img title=\"How microorganisms cause inflamation\" alt=\"How microorganisms cause inflamation\" src=\"https://draftin.com:443/images/12921?token=4VNxJ9yngm9uISQP286a_Q4Vs6u6s5yvhYZO1DQrFSq6eGzyJ81CnxGJk2R9FrVevXii3vjpfBm-nMApY0mWF8A\" width=\"414\" height=\"389\" /><p class=\"wp-caption-text\">How microorganisms cause inflamation</p></div>\n<p>Your immune system wages war against these microorganism with inflammation. Acute inflammation helps, but chronic inflammation leads to all sorts of bad things.</p>\n<p>It starts with bleeding gums when brushing teeth or when your dentist pokes you with that sharp metal poker. If left untreated this leads to periodontitis.</p>\n<p>Gums become detached from teeth, which causes pockets to form. These pockets fill up with more and more microorganisms and when they are deeper than 3mm, you can no longer clean them yourself. Without regular professional cleanings, this is the point where things spiral out of control.</p>\n<p>With time [and no treatment], the inflammation starts attacking bone, your teeth become loose and fall out. You don&#8217;t want that.</p>\n<h2 id=\"nutritional-mechanisms-of-inflammation\">Nutritional mechanisms of inflammation</h2>\n<div style=\"width: 426px\" class=\"wp-caption alignnone\"><img title=\"Oxidative stress causes inflammation\" alt=\"Oxidative stress causes inflammation\" src=\"https://draftin.com:443/images/12920?token=uJzz0WI_6z473wy379UVprGhcidvcC8JKB1ZXsO7Gm0Zgu2K_Lr8ZDt0yWzDxxfgdj4C2jVnHubO3pnKXq3-8uc\" width=\"416\" height=\"322\" /><p class=\"wp-caption-text\"><a class=\"zem_slink\" title=\"Oxidative stress\" href=\"http://en.wikipedia.org/wiki/Oxidative_stress\" target=\"_blank\" rel=\"wikipedia\">Oxidative stress</a> causes inflammation</p></div>\n<p>Oxidative stress is a key driver of chronic inflammation. Recently defined as <em>&#8220;an imbalance between oxidants &amp; antioxidants in favour of the oxidants, leading to a disruption of redox signalling &amp; control and/or molecular damage&#8221;</em>, it causes all sorts of terrible things.</p>\n<p>This imbalance can cause direct tissue damage by altering molecules (lipids, proteins, DNA) or by activating redox-sensitive transcription factors, which leads to production of pro-inflammatory molecules called cytokines. In susceptible patients this creates a vicious cycle that ensures gun inflammation never gets resolved.</p>\n<p>Oxidative stress comes from a combination of <a class=\"zem_slink\" title=\"Metabolism\" href=\"http://en.wikipedia.org/wiki/Metabolism\" target=\"_blank\" rel=\"wikipedia\">cellular metabolism</a> via mitochondrial electron leakage, and the host response to periodontal bacteria triggered by pattern recognition receptors on the cell surface.</p>\n<p>Essentially, it&#8217;s like your periodontal tissues are slowly burning whenever they are inflamed.</p>\n<p>Fighting this are local antioxidants that come in the form of various vitamins and other chemicals, most important of which is glutathione. Glutathione comes in either an <a class=\"zem_slink\" title=\"Redox\" href=\"http://en.wikipedia.org/wiki/Redox\" target=\"_blank\" rel=\"wikipedia\">oxidised</a> or a reduced form, which hunts for free radicals so it can turn into the oxidised form.</p>\n<h2 id=\"effect-of-diet-on-oxidative-stress\">Effect of diet on oxidative stress</h2>\n<p>Since oxidative stress comes partially from normal cell metabolism, it can be affected by diet. Sugars, processed carbohydrates, and <a class=\"zem_slink\" title=\"Saturated fat\" href=\"http://en.wikipedia.org/wiki/Saturated_fat\" target=\"_blank\" rel=\"wikipedia\">saturated fats</a> in particular.</p>\n<p>I&#8217;m not sure I fully understand the mechanism because my molecular biology is rather poor, but the paper mentions two mechanisms.</p>\n<p>Cells performing <a class=\"zem_slink\" title=\"ATP synthase\" href=\"http://en.wikipedia.org/wiki/ATP_synthase\" target=\"_blank\" rel=\"wikipedia\">ATP synthesis</a> to generate energy for themselves, produce mitochondrial superoxide radicals as a side-effect. The more simple food, the more radicals. Possibly related to the fact that simple carbs start digestion in the mouth.</p>\n<p>Another mechanism is receptor binding of neutrophils, which are a type of white blood cell. Something about glucose binding to proteins and activating oxidation enzymes. And saturated fats doing something similar, but with cholesterol.</p>\n<p>The result is <em>&#8220;meal induced inflammation&#8221;</em>. A result of increased glucose and lipid levels in the blood stream.</p>\n<p>But diet can also reduce oxidative stress. Avoiding simple carbohydrates and saturated fats is obviously going to reduce their effect.</p>\n<p>More importantly, with the right kind of antioxidants, you can help restore the balance between oxidants and antioxidants. But this only works reliably as part of whole foods like spinach, red beans, berries, and fancy dark chocolate (70%+ cocoa).</p>\n<p>Turns out there is a large body of research showing that <a class=\"zem_slink\" title=\"Antioxidant\" href=\"http://en.wikipedia.org/wiki/Antioxidant\" target=\"_blank\" rel=\"wikipedia\">antioxidant supplements</a> do not work. A healthy <a class=\"zem_slink\" title=\"Human nutrition\" href=\"http://en.wikipedia.org/wiki/Human_nutrition\" target=\"_blank\" rel=\"wikipedia\">balanced diet</a> is where it&#8217;s at, so flush those vitamin pills, they&#8217;re just making your pee expensive.</p>\n<h2 id=\"diet-and-periodontitis\">Diet and periodontitis</h2>\n<div style=\"width: 602px\" class=\"wp-caption alignnone\"><img title=\"Bad diet → inflamation\" alt=\"Bad diet → inflamation\" src=\"https://draftin.com:443/images/12922?token=UtYG2WwN9CaNqddsL6fTJjFZsJ2Ju93XkOeN-SwGcBtmnGlpJppnlCsWSJoMAsRDK_MAYP7TkIqhp7urfK9Fa-w\" width=\"592\" height=\"457\" /><p class=\"wp-caption-text\">Bad diet → inflamation</p></div>\n<p>The paper says that current research on the connection between diet and periodontitis is still inconclusive, but that might be just because of how difficult it is to assess nutritional status. The best approach is measuring serum levels of various micronutrients, which removes the risk of bad self-reporting and issues surrounding supplement absorption.</p>\n<p>That said, a growing body of literature correlates periodontitis with reduced serum levels of key micronutrients.</p>\n<p>The research group has also had some luck reducing pocket depth with a powder of mixed fruits and vegetables. They don&#8217;t specify how it was administered, but it was a double-blind study so I believe them.</p>\n<h2 id=\"conclusion\">Conclusion</h2>\n<p>In conclusion, periodontitis is very prevalent, current ways of treating it haven&#8217;t changed in 50 years, and we have early indication that dietary supplements could be a viable way of treating the disease at least to an extent.</p>\n<p>For the best chance of avoiding periodontitis and to help treatment if you do have it &#8211; brush your teeth regularly, avoid crappy food and don&#8217;t smoke. Smoking makes it worse.</p>\n<p>Other than that there isn&#8217;t much you can do. If you are prone to periodontitis due to any of a number of factors, it is more than likely to develop <em>eventually</em>.</p>\n<div class=\"zemanta-pixie\" style=\"margin-top: 10px; height: 15px;\"><a class=\"zemanta-pixie-a\" title=\"Enhanced by Zemanta\" href=\"http://www.zemanta.com/?px\"><img class=\"zemanta-pixie-img\" style=\"border: none; float: right;\" alt=\"Enhanced by Zemanta\" src=\"http://img.zemanta.com/zemified_e.png?x-id=cd4b15e3-41e4-4fac-a031-5eb7dd73766a\" /></a></div>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"d5329782-2c97-5323-a43b-02b602de00de"}}