{"data":{"wordpressPost":{"title":"Bewbs","content":"<p>\nThat&#39;s right, swizec is writing yet another blog about boobs. I seem to write a lot of these, at least one  a year and if I was less of a lazy bastard I&#39;d actually take this opportunity to link to the lot, but I <em>am</em> a lazy bastard and won&#39;t do it. But let&#39;s explore the range of my vocabulary and attempt to use every term for breasts only once.\n</p>\n<p>\nSo let&#39;s begin &#8230; what was I thinking about the other day &#8230; something about chest &#8230; Ah that&#39;s right. My mind was contemplating the interesting fact about which gender gives more importance to these lumps of flesh bestowed upon women and the more I thought about it the more it was painfully obvious that it&#39;s women.\n</p>\n<p>\nDon&#39;t get me wrong, it&#39;s not that men don&#39;t love a good pair of jugs, it&#39;s just that for us they&#39;re more of an appendage, an added bonus if you will, to the whole package. They&#39;re a fun toy and a soothing place to rest one&#39;s eyes upon, also very awesome for use as pillows, forearm exercise devices, physics studying apparatus, but that&#39;s all they are. We like the woman for the woman not for her knockers.\n</p>\n<p>\nWomen on the other hand, seem to base a lot of their self-worth on the shape, size, firmness, perkiness and whathaveyou of their baby-feeders. They also judge other women based on it and, if I&#39;m not mistaken, hold long discussions over them. It&#39;s weird. There&#39;s even women out there who get their blubber bags enlarged simply because they think men will like them more if they do. You&#39;re wrong, we won&#39;t, but you might.\n</p>\n<p>\nSo in conclusion, to men, it&#39;s the whole package that matters and titties are just a part of it, whereas to women it&#39;s, apparently, the tits that matter.</p>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"4300f39c-e86c-5d7e-9242-f0cd4688aeaa"}}