{"data":{"wordpressPost":{"title":"Malo delo? Poserjem se na vas in vaše demonstracije","content":"<div class=\"zemanta-img\" style=\"margin: 1em; display: block;\">\n<div>\n<dl class=\"wp-caption alignright\" style=\"width: 250px;\">\n<dt class=\"wp-caption-dt\"><a href=\"http://www.flickr.com/photos/49503062604@N01/237431962\"><img title=\"Riot Control\" src=\"http://swizec.com/blog/wp-content/uploads/2010/05/237431962_1444b6dad7_m.jpg\" alt=\"Riot Control\" width=\"240\" height=\"160\" /></a></dt>\n<dd class=\"wp-caption-dd zemanta-img-attribution\" style=\"font-size: 0.8em;\">Image by <a href=\"http://www.flickr.com/photos/49503062604@N01/237431962\">Steve Crane</a> via Flickr</dd>\n</dl>\n</div>\n</div>\n<p>Because this is a local topic the post is in slovene, apologies to both my international readers.</p>\n<p>Zadnje dni ŠOU že kar malo precej najeda z vso propagando okoli malega dela in kako je to oh in sploh konec sveta, pa da sploh ne omenimo ubogih študentekov kako, da ga bomo nasrkali in ne bomo niti za kavico več imeli.</p>\n<p>Pa pustimo, da študent sploh ne rabi kavice ampak se na faksu kaj naučit pa zraven en malo štipendije za knjige in kak sendvič.</p>\n<p>Ok priznam, odkar sem na faksu še ni minil mesec, ko ne bi več časa zapravil za &#8220;službo&#8221; kot za študijske zadeve &#8211; izvzemši seveda izpitna obdobja potem ko sem se pred kakim letom malce spametoval.</p>\n<p>A vseeno podpiram in pozdravljam malo delo, čeprav sem direktor malega startupa sestavljenega izključno iz študentarije. Malo delo bo super.</p>\n<p>Zakaj?</p>\n<p>Ja ker se nič ne bo spremenilo, samo malo se bo povečal obseg kdo vraga lahko dela in tisti ki delajo bodo imeli kako pravico več. Kurba je ko si dva tedna bolan in zato konec mesca ne morš plačat telefona, ali pa greš na malo dopusteka in magično zmanjka vsega denarja.</p>\n<p>Zveni zelo viktorijansko mar ne? Mogoče celo ameriško.</p>\n<p>Pfuj in pfej. Amerika in viktorijanstvo sta kul samo za nadbogate, študentarija in reveži se v nobenem primeru nimajo kaj preveč fino. Pri nas pa? Jah študent je car &#8230;</p>\n<p>&#8230; in tako naj ostane.</p>\n<p>Če znaš dobro delat, kar seveda znaš mar ne, sej te močno srbijo omejitve urnih postavk, to valjda pomeni da zdaj zaslužiš bajno več mar ne? Boš po preračunih z malim delom še vedno lahko zaslužil 6000 eurov na leto. In ja, to ravno pade v tisti minimum, da še ne plačaš davkov.</p>\n<p>Osebno sem tista leta ko sem zaslužil več kot 6k gagal ko majmun cele dneve in naredil prekleto malo izpitov.</p>\n<p>Kar se pa tiče demonstracij &#8230;</p>\n<p>Jaz in ŠOU sva opravila. Današnja automagična prijava na nekakšen SMS klub in to da me zdaj kar nekaj spamajo sta bila pika na i. Ne grem se več.</p>\n<p>Sem hotel it na demonstracije čist samo tako, za špas, mogoče bi bili pa izgredi in po mojem nisi zares živel dokler nisi bil vsaj enkrat v resnih izgredih &#8211; po možnosti v študentskih letih, kasneje ni več fore. Ampak izgredov ne bo, smo preveliki papki.</p>\n<p>Ah kje so cajti, ki jih opisujejo stari ljubljančani, ko je študentarija zavojevala fakse in ohromila Ljubljano, da so povedali svoje. Zdaj so demonstracije samo še show in komerciala. Pa kak alkohol več se proda na ta račun.</p>\n<div class=\"zemanta-pixie\" style=\"margin-top: 10px; height: 15px;\"><a class=\"zemanta-pixie-a\" title=\"Reblog this post [with Zemanta]\" href=\"http://reblog.zemanta.com/zemified/a3a05ea0-525e-4c09-bf92-94aed194ddb5/\"><img class=\"zemanta-pixie-img\" style=\"border: none; float: right;\" src=\"http://img.zemanta.com/reblog_e.png?x-id=a3a05ea0-525e-4c09-bf92-94aed194ddb5\" alt=\"Reblog this post [with Zemanta]\" /></a><span class=\"zem-script more-related more-info pretty-attribution\"><script src=\"http://static.zemanta.com/readside/loader.js\" type=\"text/javascript\"></script></span></div>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"18af7bff-fed6-5d23-b58f-a2b7be5f67fc"}}