{"data":{"wordpressPost":{"title":"Thoughts of a lonesome writer on a Thursday cocktail","content":"<p>Thursday night, cocktails at <a href=\"http://www.prizelenemzajcu.si/\" target=\"_blank\">Zeleni zajec </a>&ndash; I get two for the price of one and it&#39;s still expensive even when compared to whiskey. Doesn&#39;t have as much of an effect either. The taste is calm, peaceful, whiskey shocks your mind open, makes you creative, this, I guess, makes you introspective.</p>\n<p>It&#39;s been a while since I had anything to write, it&#39;s as if my imagination has been dried up. It isn&#39;t writer&#39;s block, I could write if I knew what. God this pen is annoying. Wish I&#39;d brought one of my own. The setting, although creative, is very inappropriate for writing &ndash; the tables are too low and there isn&#39;t enough people to make a proper din, but I like this back ar oom all the same. One of the walls is covered in books, part of the ceiling in antlers. Wonder if I could light up a joint in here or would they mind? Many places allow it &ndash; not as official and proper as this one though.</p>\n<p>Last time I came here was soon after Zeleni zajec opened. Wondered if I could make it my writing place &ndash; it&#39;s seeming more and more likely. Can&#39;t write at home and the tea shop is becoming too expensive and doesn&#39;t have alcomohol. Yes I say alcomohol intentionally since it sounds better.</p>\n<p>It&#39;s chilly and the misc isn&#39;t on back here so I can only hear it through the door, wish my girlfriend were here, don&#39;t know why she decided not to come, she said she would, but it was made obvious today that she never intended to. She does this kind of thing often and I&#39;m getting used to it more and more. Can&#39;t decide whether it&#39;s good that I am or sad it happens os often as to allow me to get used to it.</p>\n<p>I don&#39;t know, guess it doesn&#39;t matter, maybe it&#39;s just because she wants me to do more things on my own. Sinatra on the speakers- lovely mood. She also wants me to get some guyfriends &ndash; doesn&#39;t she realise I don&#39;t really want to? It&#39;s not like having a social life is easy, personally I find it to be a huge hassle. I often simply forget to keep in touch with people who are kind of my friends. Listening to Fred Astaire now, seems to be just the instrumental of Putting on the ritz. Often they take care of keeping in touch, but I guess they eventually get bored.</p>\n<p>Don&#39;t get me wrong, I&#39;m not awkward in social situations, I can talk to anyone, I just find it hard making myself want to. All that pretending you&#39;re interested, you want to hear about them &#8230; boring. Sure I like hearing about people, I&#39;m a writer for fuck&#39;s sake, I need fodder for my characters, but most people I meet simply aren&#39;t interesting enough.</p>\n<p>That noise you would&#39;ve just heard were you in my head was the waitress coming to see whether I was ready for my next cocktail. She used to work at another bar I frequented back then, wonder why she decided to come here. I still remember when I first encountered her. She was fresh, very fumbly, very inexperienced. It&#39;s completely different now, she&#39;s a pro &ndash; can even suggest drinks.</p>\n<p>The music changed again, it&#39;s nice but I don&#39;t like it &ndash; too 1920&#39;s blues, I prefer other types of music from then. Cabaret I call it, though I have no idea what it&#39;s actually called since it&#39;s not cabaret per se.</p>\n<p>New cocktail, this one&#39;s red &#8230; sweeter taste, strawberry through a straw. The previous one might&#39;ve been tastier. Hmmm, believe it&#39;s slowly starting to catch on, my vision doesn&#39;t feel perfect. Oh well, nothing similar to a bottle of vodka or a few too many whiskeys.</p>\n<p>Has it been enough introspection? Hard to tell, there&#39;s seven pages already, counted twice, it&#39;ll be a miracle if I actually retype it all &#8230; guess I should go about doing some creative writing, this was merely gonzo mindflow anyway &#8211;   if not gonzo then at least turn of the century modernism &ndash; previous century that is.</p>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"633ccbff-b84f-5c89-b968-6b9391c76fd5"}}