{"data":{"wordpressPost":{"title":"The daring rescue of a parrot in the streets of San Francisco","content":"<p>Today, we found a pet bird in the street. Well, my coworker found it, but he didn&#8217;t know what to do, so he left it there.</p>\n<figure>\n<img src=\"http://i.imgur.com/o0pFEde.jpg\" alt=\"\" /><br />\n</figure>\n<p>This poor bird was so hungry that it was chewing on a cigarette butt. It didn&#8217;t recognize peanut butter, which is my bird&#8217;s favorite, and even though it&#8217;s definitely a pet, Street Bird did not like to be picked up. It ran away every time I tried.</p>\n<p>Street Bird got hella upset when I took my shirt off and trapped it. Chirpchirpchirp. Like a pissed off tweety bird from a cartoon. Wish I&#8217;d recorded it.</p>\n<figure>\n<img src=\"http://i.imgur.com/HlR0HCS.jpg\" alt=\"\" /><br />\n</figure>\n<p>The rescue was a success. Street Bird was safe from cars and predators, and for almost 5 minutes, he was too tired to protest his fate. I decided Street Bird is a boy.</p>\n<p>&#8220;Bird&#8221; is a noun with male grammatical gender in my native language. Some Wikipediaing and interneting later, I found out that since Street Bird&#8217;s nostrils are blue, that means he&#8217;s a boy.</p>\n<p>Grammar wins again!</p>\n<p>It&#8217;s a good thing I have a bird at home. I had everything I needed, complete with a spare carrier, spare food and water bowls, and spare bird food. That little fucker spent 20 minutes gorging himself on seeds when I put him away.</p>\n<p>He still wouldn&#8217;t let me touch him. He chirpchirped angrily and tried to flutter away if I tried.</p>\n<p>But that&#8217;s okay – fluttering is a huge improvement over feebly running away. Street Bird is starting to feel better.</p>\n<div style=\"width: 580px;\" class=\"wp-video\"><!--[if lt IE 9]><script>document.createElement('video');</script><![endif]-->\n<video class=\"wp-video-shortcode\" id=\"video-7134-1\" width=\"580\" height=\"1031\" preload=\"metadata\" controls=\"controls\"><source type=\"video/mp4\" src=\"http://swizec.com/blog/wp-content/uploads/2016/10/Bird-in-carrier.mp4?_=1\" /><a href=\"http://swizec.com/blog/wp-content/uploads/2016/10/Bird-in-carrier.mp4\">http://swizec.com/blog/wp-content/uploads/2016/10/Bird-in-carrier.mp4</a></video></div>\n<p>For now, Street Bird is our new office pet. We&#8217;ll keep him fed and watered, and I&#8217;ll bring some toys so he&#8217;s not bored.</p>\n<p>I went to check up on him after I&#8217;d gone to the gym, and Street Bird is doing much better. He looks relaxed, he can reach every point in the carrier (he could only do the floor when I first put him in), and aaaaalmost let me touch him. Then he panicked and started fluttering.</p>\n<figure>\n<img src=\"http://i.imgur.com/xfvXGWy.jpg\" alt=\"\" /><br />\n</figure>\n<p>He doesn&#8217;t try to escape if you leave the carrier open and walk away, so maybe he&#8217;s not lost. Maybe he was left out there on purpose? ? That would be sad.</p>\n<p>I hope this is not my new bird. <em>Please</em> tell me someone in downtown SF is desperately looking for a lost parakeet budgie thing. Where could I post to find them?</p>\n<p>PS: My girlfriend named him Dewey.</p>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"384056ef-f5f9-5e5c-9cbe-58bdcb47b4b2"}}