{"data":{"wordpressPost":{"title":"The pain of a dead domain","content":"<p>\nOn June the 5th, that is to say ten days ago, my girlfriend asked what&#39;s wrong with my site? In befuddlement I replied that naught was wrong, but immediately checked it out anyway. What was wrong? The bloody domain expired that&#39;s what!\n</p>\n<p>\nSo ashamed I realised that the two years since registering the domain have passed and because I wasn&#39;t using the e-mail it was registered on I was not advised as to this happening and so found out the hard way. The silliest of all was that my current e-mail didn&#39;t work as a result of domain expiration so trying to register it anew went on completely blind.\n</p>\n<p>\nThere was too much of a fuss trying to re-register with the old registrar because, frankly, their domain administration panel was kind of silly and didn&#39;t agree with me. Transfering to godaddy it was! Clicky clicky the transfer is done, right? Not so. Took me a while to realise that perhaps it didn&#39;t quite go through so check godaddy I did and what did I find &#8230; nothing less than that I have to make some sort of confirmations. But because the confirmation mail was sent to the old address I had to first download and delete all the old messages from it, thus making room for new things. I  confirmed, yay, domain works right?\n</p>\n<p>\nWrong, it doesn&#39;t work. The next day I received mail saying something to the extent of <em>well here&#39;s the deal, if you don&#39;t want it transfered tell us so by friday, if you do then simply wait and don&#39;t do anything.</em> Fucking hell I have to wait a WEEK for it to happen, but I want it <strong>now</strong>! Wait I did and then on friday it STILL wouldn&#39;t work. So I wait a bit, maybe there&#39;s a lag or whatever. In a day or so I checked on godaddy&#39;s administration anyway and found out the bloody nameserver was still set up to the stupid placeholder thing. Changed it I did and then had to wait about a day, or was it two, for the information to properly propagate giving me my site back.\n</p>\n<p>\nAnd so it is that this site was down for ten whole bloody days, verily this will harm my visitation that was just getting back to its regular levels. Oh well &#8230;</p>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"4635ebf1-c3d7-51ef-8742-98e58902cc1f"}}