{"data":{"wordpressPost":{"title":"How I discovered one of the greatest influences on my life","content":"<div class=\"zemanta-img\" style=\"float: right; width: 310px; margin: 1em;\">\n<div>\n<dl>\n<dt><a href=\"http://en.wikipedia.org/wiki/Image:Fear_and_Loathing_in_Las_Vegas.jpg\"><img src=\"http://swizec.com/blog/wp-content/uploads/2009/12/300px-Fear_and_Loathing_in_Las_Vegas.jpg\" alt=\"Fear and Loathing in Las Vegas.\" width=\"300\" height=\"458\" /></a></dt>\n<dd>Image via <a href=\"http://en.wikipedia.org/wiki/Image:Fear_and_Loathing_in_Las_Vegas.jpg\">Wikipedia</a></dd>\n</dl>\n</div>\n</div>\n<p>Last night I was discussing <a class=\"zem_slink freebase/en/gothic_rock\" title=\"Gothic rock\" rel=\"wikipedia\" href=\"http://en.wikipedia.org/wiki/Gothic_rock\">goth music</a> with a mate and somehow the debate turned into my showing him around what goth music was in the first place. Blahblahblah.</p>\n<p>This eventually led to my showing him Velvet Acid Christ, which I still don&#8217;t know whether they&#8217;re goth or industrial. And then I showed him a certain song. It triggered memories, many memories.</p>\n<p>Particularly the whole story of how I discovered <a class=\"zem_slink freebase/en/fear_and_loathing_in_las_vegas\" title=\"Fear and Loathing in Las Vegas\" rel=\"wikipedia\" href=\"http://en.wikipedia.org/wiki/Fear_and_Loathing_in_Las_Vegas\">Fear and Loathing in Las Vegas</a> and <a class=\"zem_slink freebase/en/hunter_s_thompson\" title=\"Hunter S. Thompson\" rel=\"wikipedia\" href=\"http://en.wikipedia.org/wiki/Hunter_S._Thompson\">Hunter Thompson</a> in general &#8211; two of the biggest influences on my life and my art and pretty much everything I&#8217;ve ever done since reading the book, watching the movie and becoming a raging fan.</p>\n<p>It all started out when I was a wee lad of 15-ish and listening to an internet radio &#8211; its name eludes my memory &#8211; that played a certain song a whole lot. It contained clips like <em>Oh god, did you eat all this acid? That&#8217;s right, you see!</em> and uhm &#8230; <em>This is not a good town for psychadelic drugs, extremely menacing vibrations were all around us.</em></p>\n<p>Back then I was quite a regular and chatted a lot with the DJ&#8217;s, yes it was a fucking awesome radio, and eventually this meant I asked what the song was and whether it was any particular mix they themselves created.</p>\n<p>This is how I discovered Velvet Acid Christ.</p>\n<p>So I listened to their music some more and god knows when, I finally decided to look up these sound clips and figure out where they were from.</p>\n<p>This is how I discovered Fear and Loathing in Las Vegas the movie.</p>\n<p>Watching the movie had an instant effect of making a raging drug lover out of me. Unfortunately, I haven&#8217;t managed to get my greedy little paws on most of the stuff I&#8217;ve wanted to try &#8230; have been hunting passively for acid for gawd knows how many years now &#8230; but I did try ether that I&#8217;ve made myself. The effects truly are just like the movie describes, it&#8217;s bloody fun too!</p>\n<p>Anyhow, eventually I decided to read Fear and Loathing in Las Vegas the book.</p>\n<p>Fucking brilliant stuff! My writing style has never been the same again and it only cemented my dire desire to get into psychadelic drugs as soon as I possibly can &#8230; I still haven&#8217;t. For shame.</p>\n<p>The fucking suck part of wanting to do psychadelic drugs is that we&#8217;re not in the 60&#8217;s anymore and everybody just wants to get stoned and drunk and dance for a little longer than usual. Bleh. I want to have <em>fun! </em>But this is really another story, which says more about my lack of connections to the drug world than anything else.</p>\n<div class=\"zemanta-pixie\" style=\"margin-top: 10px; height: 15px;\"><a class=\"zemanta-pixie-a\" title=\"Reblog this post [with Zemanta]\" href=\"http://reblog.zemanta.com/zemified/e3980dd6-72e8-4553-a085-5ee0f56a6451/\"><img class=\"zemanta-pixie-img\" style=\"border: none;float: right\" src=\"http://img.zemanta.com/reblog_e.png?x-id=e3980dd6-72e8-4553-a085-5ee0f56a6451\" alt=\"Reblog this post [with Zemanta]\" /></a></div>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"1c2fb28d-22c9-501d-a419-9b2f32badbe1"}}