{"data":{"wordpressPost":{"title":"Blogres 2k8","content":"<p>\nSo far so good, blogres is being fun and I was given some strange liquid to drink &#8211; smelled like coffee, but tasted well even on just a single pack of sugar &#8230; very strange. Also, and I&#39;m very very frustrated about this, for a blogers&#39; congress these hallway computers from a fancy sponsor could have some other browser than merely IE7 installed &#8230; fucking bastards &#8230; or merely morons?\n</p>\n<p>\n<strong>Update at 13:06 from hallway crappy dell: </strong>\n</p>\n<p>\nThe forum on large company &#8211; blogger integration was rather interesting. Surprising how captivating a 120 slide presentation can be when done even half right. Sadly there wasn&#39;t so much foruming going on as it was a presentation by two guys, but there were something interesting tid bits thrown around at the end. Now let&#39;s go eat another free chocolate bar.\n</p>\n<p>\n<strong>Update at 13:16:</strong>\n</p>\n<p>\nFound out the strange liquid from before was coffee. Doesn&#39;t taste very drinkable this time around &#8230; probably because the caffeine isn&#39;t as terribly needed as before. Strange how sometimes we find out just how much such basic scientific facts hold true.\n</p>\n<p>\n<strong>Update at 16:11:</strong>\n</p>\n<p>\nGot back from lunch and finally managed to get to a computer. Four isn&#39;t by far enough even though rumour seems to be flying around that there were many more people around last year &#8230; who knows, I wasn&#39;t around to notice. Anyway, the previous three speeches were kind of boring, but I <em>was</em> surprised by just how much a speech on law can be fun to listen to. In another strange twist of events I found out that having 300 visits a month isn&#39;t at all too shabby as far as blogs go in slovenia &#8230; always thought I had a fairly unread blog myself.</p>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"99ad2e95-339c-58f7-9ad1-5a031a05a4dc"}}