{"data":{"wordpressPost":{"title":"God and science are in love","content":"<p>God and science are in love and have been since the dawn of time. Ensue the flames! But no, seriously, give me a listen before you bash my head in, that means you religion monger! Yes, you too dear crazy scientist.</p>\n<p>For very long I have listened to you people bicker back and forth on the internet, bicker forth and back in real life, have wars almost all about whether god exists or doesn&#8217;t exist and whether science is real or a fake. For fuck&#8217;s sake people, enough! In the interest of full disclosure, I have until recently fought vehemently in these wars and would take any opportunity I could find to bicker with religious folk over their beliefs.</p>\n<p>Until, one day, I realised just how bad everything I was doing was. I&#8217;ve tried explaining this to one Unimatrix who still fights with great fervor and won&#8217;t let up no matter how much I try to show him the sad trap all warriors on the side of science have fallen into &#8211; they&#8217;re making science into a religion and have forgotten all science is about.</p>\n<p>Aaagh the flames! Stop that, hear me out. Let me show you just how many correlations there are between people defending science against religion and &#8230; religion. It&#8217;s gonna scare the shit out of you, especially if you&#8217;re one of the warriors.</p>\n<h3>Knee-jerk reactions</h3>\n<p>Modern day science warriors have knee-jerk to anything and anyone saying their beliefs could be wrong and that there is an alternate explanation for a phenomenon. You will recall that this is the kind of thing religion prides itself in and has forever, most notably during the inquisition and let&#8217;s not forget about how eager religion is in damning anyone that says God is wrong. Science is about thought and discovery, it&#8217;s not about saying anyone who doesn&#8217;t believe you is an idiot.</p>\n<h3>Nonbelievers are stupid idiots</h3>\n<p>This is very common in modern-day science warriors, they will simply call everyone who isn&#8217;t on their side stupid and ignorant. Even religion didn&#8217;t use to be this bad until the modern day. Science isn&#8217;t about convincing people you&#8217;re right and they&#8217;re wrong, science is about knowledge and it doesn&#8217;t care who believes and who does not. As long as other scientists find you to be correct you&#8217;re good, real scientists don&#8217;t care about nonscientists and their beliefs, many scientists themselves are very religious. For example Newton only found his stuff by trying to explain God&#8217;s modus operandi, Einstein was bent on discovering who or what God is and relativity was the lovely side-product. So why do you care so much?</p>\n<h3>Converting people</h3>\n<p>Ever since its inception religion has been all about converting heathens into followers of the one true God, whichever of the many Gods that would be, science &#8230; science wasn&#8217;t. But these modern day warriors of science care much more about convincing people to follow the one true path of science and leave behind their ancient and stupid belief systems. Why? Why does it matter so much to you that everyone you know should follow the one true path? Are you by any chance religious and science is your religion?</p>\n<h3>We are absolutely correct</h3>\n<p>Religion is dogmatic, science is based on hypotheses and theories. The base of everything scientific is recognition of the fact that you could be wrong if somebody finds a better explanation. The base of everything religious is &#8220;We are right and you are wrong&#8221;. Why are you, dear science warriors, making this same mistake by saying science is infallible and religion is wrong? Do I sense a bit of hypochrisy right there?</p>\n<h3>Conclusion<br /></h3>\n<p>There are probably many other correlations between religion and the mockery people are making out of science. But most of all I believe we should all realise one simple fact: Science <em>and</em> religion are just working models of the world based on our observation. There is no point in figuring out which is better, which is more correct, because they can both be correct. In fact they both quite enjoy coexisting and love each other. Hell, they even each have a perfeclty valid explanation for the other.</p>\n<p>Science says that God is a mix of psycho-social phenomenae created either out of need to explain what we couldn&#8217;t explain mathematically or logically at the time of its inception or created by leaders so as to easier lead their people. A control mechanism if you will. While faith is, according to science, a coping mechanism. Most of all, science explains God as being an idea rather than an entity. That&#8217;s not saying God doesn&#8217;t exist &#8230; science does NOT say God doesn&#8217;t exist. So stop it you fucking morrons, stop trying to convince everyone God doesn&#8217;t exist because you have absolutely no scientific basis to be saying taht.</p>\n<p>God, on the other hand, explains science as a puzzle. God put all of this funny stuff in place for us to figure out, it&#8217;s one giant puzzle and once we&#8217;ve figured it out, become smart enough to face him, we get to see what or who God really is. Some religions also explain it as a test of faith, but that&#8217;s based on the incorrect belief that science is about disproving the existance of God when in fact science has been trying for a long time to explain, rather than disprove, God. So you see, God doesn&#8217;t say science is stupid, God just says science is the explanation while he/she is the reason.</p>\n<p>Now that I&#8217;ve shown you just how morronic all this fighting is. We can get on with our lives, stop fighting, leave religion to its working model, leave science to its working model and &#8230; well I guess the only thing left to do now is endure all of the flames coming from both sides of the fence. That&#8217;s what I get for sitting on the fence I guess.</p>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"e2f5a828-e03e-5869-990a-306bd60596d1"}}