{"data":{"wordpressPost":{"title":"Using d3js transitions in React","content":"<h1 id=\"using-d3js-transitions-in-react\"><img class=\"alignnone size-full wp-image-6800\" src=\"http://swizec.com/blog/wp-content/uploads/2016/04/alphabet_2.gif\" alt=\"alphabet_2\" /></h1>\n<p>One of d3’s biggest selling points is the general update pattern. Add some function calls and voila – animated visualization with transitions.</p>\n<p>You can see it in action in Mike Bostock’s <a href=\"https://bl.ocks.org/mbostock/a8a5baa4c4a470cda598\">General Update Pattern 4.0</a> where he animates an alphabet. Update the alphabet and old letters transition out, new letters transition in, updated letters transition into a new position. It works like magic.</p>\n<p>D3 always works like magic …</p>\n<blockquote class=\"twitter-tweet\" data-lang=\"en\">\n<p dir=\"ltr\" lang=\"en\">.<a href=\"https://twitter.com/Swizec\">@Swizec</a> also with React you&#8217;re not *binding the data*. you&#8217;re just iterating over the data and creating SVG elements. It&#8217;s not data-driven</p>\n<p>— Luca Matteis (@lmatteis) <a href=\"https://twitter.com/lmatteis/status/721351646907863040\">April 16, 2016</a></p></blockquote>\n<p>You totally <em>can</em> achieve the same result with React. Yes, even if you use React to render SVG. Yes, you can use d3’s powerful transitions API too.</p>\n<p>The React version is easier to understand, too. Keep reading and you’ll see why.</p>\n<h2 id=\"enter-update-exit-transitions-in-react\">Enter update exit transitions in React</h2>\n<p>We’re going to build that same animated alphabet. To keep things short, this tutorial focuses on the alphabet itself and ignores all the config and parent components.</p>\n<p>The code is based on React 15 and D3 4.0.0-alpha.29. Don’t worry, it works with the stable version of D3. I’ll explain the subtle differences.</p>\n<p>To make an animated alphabet, we need two components:</p>\n<ul>\n<li><code>Alphabet</code>, which creates random lists of letters every 1.5 seconds, then maps through them to render <code>Letter</code> components</li>\n<li><code>Letter</code>, which renders an SVG text element, and takes care of its enter/update/exit transitions</li>\n</ul>\n<p>We’re going to use React to render SVG elements, and d3 for transitions, intervals, and some maths.</p>\n<p>You can see the full code on GitHub <a href=\"https://github.com/Swizec/react-d3-enter-exit-transitions\">here</a>.</p>\n<h2 id=\"the-alphabet-component\">The Alphabet component</h2>\n<p>The <code>Alphabet</code> component holds the current list of letters in state and renders a collection of <code>Letter</code> components in a loop.</p>\n<p>We start with a skeleton like this:</p>\n<pre lang=\"javascript\">// src/components/Alphabet/index.jsx\r\n\r\nimport React, { Component } from 'react';\r\nimport ReactTransitionGroup from 'react-addons-transition-group';\r\nimport d3 from 'd3';\r\n\r\nrequire('./style.less');\r\n\r\nimport Letter from './Letter';\r\n\r\nclass Alphabet extends Component {\r\n    static letters = \"abcdefghijklmnopqrstuvwxyz\".split('');\r\n    state = {alphabet: []}\r\n\r\n    componentWillMount() {\r\n        // starts an interval to update alphabet\r\n    }\r\n\r\n    render() {\r\n        // spits out svg elements\r\n    }\r\n}\r\n\r\nexport default Alphabet;</pre>\n<p>We import our dependencies, add some styling, and define the <code>Alphabet</code> component. It holds a list of available letters in a static <code>letters</code> property, and an empty <code>alphabet</code> in component state. We’ll need a <code>componentWillMount</code> and a <code>render</code> method as well.</p>\n<p><em>Sidenote</em>: That <code>require('style.less')</code> isn’t key to this tutorial. I’m not a fan of inline styling, so I like to add <code>less</code> compilation to Webpack and include stylesheets like this.</p>\n<p>To showcase enter-update-exit transitions, we want to create a new alphabet every couple of seconds. The best place to do that is in <code>componentWillMount</code>:</p>\n<pre lang=\"javascript\">// src/components/Alphabet/index.jsx\r\n\r\n    componentWillMount() {\r\n        d3.interval(() => this.setState({\r\n           alphabet: d3.shuffle(Alphabet.letters)\r\n                       .slice(0, Math.floor(Math.random() * Alphabet.letters.length))\r\n                       .sort()\r\n        }), 1500);\r\n    }</pre>\n<p>We use <code>d3.interval( //.., 1500)</code> to call a function every 1.5 seconds. It’s the same as <code>setInterval</code>, but friendlier to batteries and CPUs. On each period, we shuffle the available letters, slice out a random amount, sort them, then update component state with <code>setState</code>.</p>\n<p>This ensures our alphabet is both random and in alphabetical order.</p>\n<p>Starting the interval in <code>componentWillMount</code> ensures it only runs when the component is on the page, and that everything’s ready by the time our component renders. It’s good practice to explicitly stop these sorts of intervals in <code>componentWillUnmount</code>.</p>\n<p>Our declarative transitions magic starts in the <code>render</code> method.</p>\n<pre lang=\"javascript\">// src/components/Alphabet/index.jsx\r\n\r\n    render() {\r\n        let transform = `translate(${this.props.x}, ${this.props.y})`;\r\n\r\n        return (\r\n            <g transform={transform}>\r\n                <ReactTransitionGroup component=\"g\">\r\n                    {this.state.alphabet.map((d, i) => (\r\n                        <Letter d={d} i={i} key={`letter-${d}`} />\r\n                     ))}\r\n                </ReactTransitionGroup>\r\n            </g>\r\n        );\r\n    }</pre>\n<p>We start with an SVG transformation that moves our alphabet into the specified <code>(x, y)</code> position, then define a <code>ReactTransitionGroup</code> and map through <code>this.state.alphabet</code> to render a collection of <code>Letter</code> components. Each <code>Letter</code> gets its current text – <code>d</code> – and index – <code>i</code>. We <em>have to</em> define the <code>key</code> attribute based on the letter – <code>d</code>.</p>\n<p>The <code>Alphabet</code> component assumes the parent component renders it inside an <code>&lt;svg&gt;</code> tag.</p>\n<h3 id=\"the-key-property\">The key property</h3>\n<p>The key property is how React identifies which component is which. You’re gonna have a bad time if you pick wrong. Trust me. I spent many hours debugging and contorting and writing workarounds before I realized that basing the key on the index was a Bad Move™. <em>Obviously</em>, you want the letter to stay constant in each component and the index to change.</p>\n<p>That’s how x-axis transitions work. You’re moving the letter into a specific place in the alphabet. You’ll see what I mean in a bit.</p>\n<h3 id=\"reacttransitiongroup\">ReactTransitionGroup</h3>\n<p>Wrapping our list of <code>Letter</code>s in <code>ReactTransitionGroup</code> lets us do our magic. This is a low-level API from React add-ons, which expands our kingdom of component lifecycle hooks.</p>\n<p>In addition to knowing when the component mounts, updates, and unmount, we get access to <code>componentWillEnter</code>, <code>componentWillLeave</code>, and a few others. Notice something familiar?</p>\n<p><code>componentWillEnter</code> is the same as d3’s <code>.enter()</code>, <code>componentWillLeave</code> is the same as d3’s <code>.exit()</code>, and <code>componentWillUpdate</code> is the same as d3’s <code>.update()</code>.</p>\n<p>“The same” is a strong concept – they’re analogous. The key difference is that d3’s hooks operate on entire selections – groups of components – while React’s lifecycle hooks operate on each component individually. In d3, an overlord is dictating what happens; in React, each component knows what to do.</p>\n<p>That makes React code easier to understand. I think. ¯\\_(ツ)_/¯</p>\n<p><code>ReactTransitionGroup</code> gives us <a href=\"https://facebook.github.io/react/docs/animation.html\">even more hooks</a>, but these are what we need. It’s nice that in both <code>componentWillEnter</code> and <code>componentWillLeave</code> we can use the callback to explicitly say <em>“The transition is done. React, back to you”</em>.</p>\n<p>My thanks to Michelle Tilley for writing about <code>ReactTransitionGroup</code> <a href=\"http://stackoverflow.com/questions/29977799/how-should-i-handle-a-leave-animation-in-componentwillunmount-in-react\">on StackOverflow</a>.</p>\n<h2 id=\"the-letter-component\">The Letter component</h2>\n<p>Now we’re ready for the real magic – a component that can transition itself into and out of a visualization… without bothering anyone else <em>or</em> confusing React.</p>\n<p>The basic skeleton of our <code>Letter</code> component looks like this:</p>\n<pre lang=\"javascript\">// src/components/Alphabet/Letter.jsx\r\n\r\nimport React, { Component } from 'react';\r\nimport ReactDOM from 'react-dom';\r\nimport d3 from 'd3';\r\n\r\nclass Letter extends Component {\r\n    state = {\r\n        y: -60,\r\n        x: 0,\r\n        className: 'enter',\r\n        fillOpacity: 1e-6\r\n    }\r\n    transition = d3.transition()\r\n                   .duration(750)\r\n                   .ease(d3.easeCubicInOut);\r\n\r\n    componentWillEnter(callback) {\r\n        // start enter transition, then callback()\r\n    }\r\n\r\n    componentWillLeave(callback) {\r\n        // start exit transition, then callback()\r\n    }\r\n\r\n    componentWillReceiveProps(nextProps) {\r\n        if (this.props.i != nextProps.i) {\r\n           // start update transition\r\n        }\r\n    }\r\n\r\n    render() {\r\n       // spit out a <text> element\r\n    }\r\n};\r\n\r\nexport default Letter;</pre>\n<p>We start with some imports, and define a <code>Letter</code> component with a default state and a default transition. Yes, it feels weird to use <code>state</code> for coordinates, class name, and styling, but the component needs to change them sometimes. As far as I know, components can’t change their own props.</p>\n<p>Defining a default transition is a d3 v4 trick. It saves us some typing. With the stable version of d3, you’d define this duration and easing function on each transition.</p>\n<p>All of the magic values – default/final <code>y</code> coordinate, transition properties, etc. – are good candidates for props. That would make <code>Alphabet</code> more flexible, but add unnecessary complexity for this tutorial.</p>\n<h3 id=\"componentwillenter\">componentWillEnter</h3>\n<p>We start with the enter transition in <code>componentWillEnter</code>.</p>\n<pre lang=\"javascript\">// src/components/Alphabet/Letter.jsx\r\n\r\n    componentWillEnter(callback) {\r\n        let node = d3.select(ReactDOM.findDOMNode(this));\r\n\r\n        this.setState({x: this.props.i*32});\r\n\r\n        node.transition(this.transition)\r\n            .attr('y', 0)\r\n            .style('fill-opacity', 1)\r\n            .on('end', () => {\r\n                this.setState({y: 0, fillOpacity: 1});\r\n                callback()\r\n            });\r\n    }</pre>\n<p>We use <code>reactDOM.findDOMNode</code> to get our DOM node and use <code>d3.select</code> to turn it into a d3 selection. Now we can do any and all d3 magic.</p>\n<p>Then we update <code>this.state.x</code> the current index and letter width. The width is a value that we Just Know™.</p>\n<p>We keep our letter’s <code>x</code> coordinate in <code>this.state</code> to avoid jumpiness. The <code>i</code> prop updates on each render, but we want to transition into the new position slowly. You’ll see how that works in the <code>componentWillReceiveProps</code> section.</p>\n<p>At this point our component is invisible and 60 pixels above the baseline. That’s because of the default values for <code>fillOpacity</code> and <code>y</code> that we set earlier.</p>\n<p>To animate our component moving down and becoming visible, we use a d3 transition.</p>\n<p>We use <code>node.transition(this.transition)</code> to start a new transition using the default settings from earlier. In d3 v3, we’d have to define a duration and easing function here manually.</p>\n<p>Then we define what/how should change with <code>.attr</code> and <code>.style</code>. This operates directly on the DOM and doesn’t tell React about the changes.</p>\n<p>We can sync React’s imagination with reality in a “transition is over” callback using <code>.on('end'</code>. We use <code>setState</code> to update component state, and trigger the main <code>callback</code>. React now knows this letter is done appearing.</p>\n<p>In d3 v3, you’d use <code>.each('end'</code> to define the callback.</p>\n<h3 id=\"componentwillleave\">componentWillLeave</h3>\n<p>The exit transition goes in <code>componentWillLeave</code> and follows the same principle, except in reverse. It looks like this:</p>\n<pre lang=\"javascript\">// src/components/Alphabet/Letter.jsx\r\n\r\n    componentWillLeave(callback) {\r\n        let node = d3.select(ReactDOM.findDOMNode(this));\r\n\r\n        this.setState({className: 'exit'});\r\n\r\n        node.transition(this.transition)\r\n            .attr('y', 60)\r\n            .style('fill-opacity', 1e-6)\r\n            .on('end', () => {\r\n                this.setState({y: 60, fillOpacity: 1e-6});\r\n                callback()\r\n            });\r\n    }</pre>\n<p>This time, we update state to change the <code>className</code> instead of <code>x</code>. That’s because <code>x</code> doesn’t change.</p>\n<p>The exit transition itself is an inverse of the enter transition. An exiting letter moves further down and becomes invisible. Once the transition is over, we update state for consistency’s sake, and we tell React it can remove the component.</p>\n<p>On second though, we might not need to update state in this case. The component goes bye-bye anyway…</p>\n<h3 id=\"componentwillreceiveprops\">componentWillReceiveProps</h3>\n<p>The update transition goes into <code>componentWillReceiveProps</code> like this:</p>\n<pre lang=\"javascript\">// src/components/Alphabet/Letter.jsx\r\n\r\n    componentWillReceiveProps(nextProps) {\r\n        if (this.props.i != nextProps.i) {\r\n            let node = d3.select(ReactDOM.findDOMNode(this));\r\n\r\n            this.setState({className: 'update'});\r\n\r\n            node.transition(this.transition)\r\n                .attr('x', nextProps.i*32)\r\n                .on('end', () => this.setState({x: nextProps.i*32}));\r\n        }\r\n    }</pre>\n<p>You know the pattern by now, don’t you? Update state, do transition, sync state with reality after transition.</p>\n<p>In this case, we change the <code>className</code>, then we move the letter into its new horizontal position.</p>\n<p>We could have done all of this in <code>componentWillUpdate</code> as well. However, we can’t do it in <code>componentDidUpdate</code>. We need to know both the current index <em>and</em> the new index. It helps us decide whether to transition or not.</p>\n<p>There are instances when the component updates, but its horizontal position doesn’t change. Every time we call <code>setState</code> for example.</p>\n<h3 id=\"render\">render</h3>\n<p>After all that transition magic, you might be thinking <em>“Holy shit, how do I render this!?”</em>. I don’t blame ya!</p>\n<p>But we did the hard work. Rendering is straightforward:</p>\n<pre lang=\"javascript\">// src/components/Alphabet/Letter.jsx\r\n\r\n    render() {\r\n        return (\r\n            <text dy=\".35em\"\r\n                  y={this.state.y}\r\n                  x={this.state.x}\r\n                  className={this.state.className}\r\n                  style={{fillOpacity: this.state.fillOpacity}}>\r\n                {this.props.d}\r\n            </text>\r\n        );\r\n    }</pre>\n<p>We return an SVG <code>&lt;text&gt;</code> element rendered at an <code>(x, y)</code> position with a <code>className</code> and a <code>fillOpacity</code>. It shows a single letter given by the <code>d</code> prop.</p>\n<p>As mentioned, using state for <code>x</code>, <code>y</code>, <code>className</code>, and <code>fillOpacity</code> feels weird. It’s the simplest way I know of to communicate between the <code>render</code> and lifecycle methods.</p>\n<h2 id=\"that-s-it\">That’s it</h2>\n<p>Boom. We’re done.</p>\n<p><iframe src=\"http://swizec.github.io/react-d3-enter-exit-transitions/\" width=\"600\" height=\"500\"></iframe></p>\n<p>We have an <code>Alphabet</code> component that declaratively renders an animated alphabet. Letters transition in and out and jump left and right.</p>\n<p>All you need now is a skeleton setup that renders an SVG element and uses the <code>Alphabet</code> component.</p>\n<p>The key take aways are:</p>\n<ul>\n<li>use d3 for transitions</li>\n<li>use React to manage SVG elements</li>\n<li>use ReactTransitionGroup to get more lifecycle events</li>\n<li>mimic d3’s enter/update/exit pattern</li>\n</ul>\n<p>You can learn more about properly integration React and d3js from my book, <a href=\"http://swizec.com/reactd3js\">React+d3js ES6</a>.</p>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"b44bd9c6-8701-50ba-8305-2605d1757f89"}}