{"data":{"wordpressPost":{"title":"The man you want to be does not matter","content":"<div class=\"zemanta-img\" style=\"margin: 1em; display: block;\">\n<div style=\"width: 310px\" class=\"wp-caption alignright\"><a href=\"http://commons.wikipedia.org/wiki/File:Oscar_Wilde_Aesthetic_Cigars.jpg\"><img title=\"Trade card of a cigar dealer after a photograp...\" src=\"http://swizec.com/blog/wp-content/uploads/2011/08/300px-Oscar_Wilde_Aesthetic_Cigars.jpg\" alt=\"Trade card of a cigar dealer after a photograp...\" width=\"300\" height=\"550\" /></a><p class=\"wp-caption-text\">Image via Wikipedia</p></div>\n</div>\n<blockquote><p>“Ambition is the last refuge of the failure.” ~ <a class=\"zem_slink\" title=\"Oscar Wilde\" href=\"http://en.wikipedia.org/wiki/Oscar_Wilde\" rel=\"wikipedia\">Oscar Wilde</a></p></blockquote>\n<p>People exist in a limbo of three states: the person they used to be, the person they are and the person they want to become. This roughly translates to the concept of a past, a present and a <a class=\"zem_slink\" title=\"Future\" href=\"http://en.wikipedia.org/wiki/Future\" rel=\"wikipedia\">future</a>.</p>\n<p>But with one caveat, what you <em>want</em> to become is a world of difference away from what you actually <em>will</em> become.</p>\n<p><a class=\"zem_slink\" title=\"Worry\" href=\"http://en.wikipedia.org/wiki/Worry\" rel=\"wikipedia\">Worrying</a> about the person you used to be, while a popular sport, is quite irrelevant. Past performance has very little correlation to future actions and those thinking otherwise are using a very simple thinking shortcut. It’s easy to think that if a person has made something wonderful in the past, all of their next projects are going to end wonderfully as well.</p>\n<p>But the correlation just isn’t there.</p>\n<p>Unless you’re doing the exact same thing your past self has been doing, there’s no point in worrying about your past. Outside some mental list of lessons learned you might as well forget all about your past and just enjoy the moment because it doesn’t matter anyway.</p>\n<p>At worst one’s past might have an impact on how others perceive them, but I find that until you start fucking up, people don’t really bother to think about your past self all that much. It just doesn&#8217;t matter beyond the role of a scape goat.</p>\n<p>So then, with very little reason to worry about one’s past self, why do people worry so much about their future self?</p>\n<p>Because you can still change it?</p>\n<p>Almost everything you do today has some sort of impact on who you can become tomorrow, which brings us exactly to the point. Everything you <em>do</em> has an impact on who you will be tomorrow.</p>\n<p>A lot of people make long wish lists of features they want their future self to have. Be it hot girls and expensive automobiles or something much simpler like the solution to the halting problem. Inevitably these wishes coming true hinges on a single thing: Who they are today.</p>\n<p>Right now!</p>\n<p>And you can barely influence the person you used to be. Sure, you can spin your story this way or that, but it doesn’t change the facts, your past actions are there, cemented in stone.</p>\n<p>What you can affect is the future.</p>\n<p>The future hasn’t happened yet. It’s yours for the taking. The problem here is that no matter what you do, you’re never actually <em>in</em> the future. Every moment that happens, every moment right after that, is the present.</p>\n<p>Simple concept. Great implications.</p>\n<p>This means that no matter how hard we try, we will never change the future because our whole sphere of influence lies wholly in the present. You can always choose to do this thing or that and whichever way you choose, has great impact on the man that you are.</p>\n<p>A person much smarter than myself once said that “A man can only tell his true self by how others perceive him”, which I might be paraphrasing or completely making up, I can’t really tell right now and a quick google search doesn’t reveal a source for the quote.</p>\n<p>The point is, your true worth really is defined by how much worth you are to the people around you. If you’re the only person in the world that can see how awesome you are … then, truth be told, you might just be a little bit arrogant and a bit of a prick.</p>\n<p>But if others find you awesome and even derive some use out of your existence, then, Bravo!, you are suddenly a productive member of society! Good on you!</p>\n<p>Notice I’m talking in the <a class=\"zem_slink\" title=\"Present tense\" href=\"http://en.wikipedia.org/wiki/Present_tense\" rel=\"wikipedia\">present tense</a>?</p>\n<p>It doesn’t really matter if you one day plan on solving world hunger, curing cancer and bringing humans into space &#8230; if you’re killing babies right now.</p>\n<p>It just doesn’t.</p>\n<p>Sure, sometimes the ends do excuse the means, but until your ends are touchable, actionable results, you’re just an idiot doing Bad Things ™, but with good intentions, honestly.</p>\n<p>I’m sorry, the world has enough of those already. Please kindly fuck off.</p>\n<p>The whole thing is really quite simple, if you want to be someone, go be him. NOW! Stop wasting your time being someone you don’t want to be. You are recognized as the person you are <em>right fucking now</em>.</p>\n<p>As Oscar Wilde said in Phrases and Philosophies for the use of the Young, the fact that you’re striving for something just means you haven’t reached it yet. Most people probably don’t even know you’re trying to reach it … some likely don’t even care.</p>\n<p>So ask yourself, if I get hit by a bus tomorrow, is <em>this</em> really what I want to be remembered for? Or is there something more important you should be doing?</p>\n<p>Especially ask yourself this if you’re a [young-ish] Silicon Valley entrepreneur … are you working on the next cool widget, or are you saving the world? Which do you think better to be remembered for?</p>\n<h6 class=\"zemanta-related-title\" style=\"font-size: 1em;\">Related articles</h6>\n<ul class=\"zemanta-article-ul\">\n<li class=\"zemanta-article-ul-li\"><a href=\"http://www.3quarksdaily.com/3quarksdaily/2011/08/deceptive-picture-how-oscar-wilde-painted-over-dorian-gray.html\">Deceptive Picture: How Oscar Wilde painted over &#8220;Dorian Gray.&#8221;</a> (3quarksdaily.com)</li>\n<li class=\"zemanta-article-ul-li\"><a href=\"http://divorcingmrwrong.wordpress.com/2011/07/23/lesson-11-make-peace-with-your-past-so-it-doesn%25e2%2580%2599t-screw-up-the-present/\">Lesson #11: Make Peace with Your Past So It Doesn&#8217;t Screw Up the Present</a> (divorcingmrwrong.wordpress.com)</li>\n<li class=\"zemanta-article-ul-li\"><a href=\"http://gibsongirl247.wordpress.com/2011/06/13/counting-my-blessings/\">Counting My Blessings</a> (gibsongirl247.wordpress.com)</li>\n<li class=\"zemanta-article-ul-li\"><a href=\"http://whatisfortytwo.wordpress.com/2011/07/21/the-here-and-now/\">The Here and Now</a> (whatisfortytwo.wordpress.com)</li>\n</ul>\n<div class=\"zemanta-pixie\" style=\"margin-top: 10px; height: 15px;\"><a class=\"zemanta-pixie-a\" title=\"Enhanced by Zemanta\" href=\"http://www.zemanta.com/\"><img class=\"zemanta-pixie-img\" style=\"border: none; float: right;\" src=\"http://img.zemanta.com/zemified_e.png?x-id=4ba43826-1bbd-498f-810f-aa9547105c78\" alt=\"Enhanced by Zemanta\" /></a></div>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"032a8bb1-ce66-55d0-b8a7-44d503054ada"}}