{"data":{"wordpressPost":{"title":"Kids, shrooms are fucking cool","content":"<div class=\"zemanta-img\" style=\"display: block; float: right; width: 310px; margin: 1em;\">\n<div>\n<dl class=\"wp-caption alignright\" style=\"width: 310px;\">\n<dt class=\"wp-caption-dt\"><a href=\"http://commons.wikipedia.org/wiki/Image:Devils_Punchbowl_Waterfall%2C_New_Zealand.jpg\"><img title=\"Devils Punchbowl Waterfall at Arthurs Pass in ...\" src=\"http://swizec.com/blog/wp-content/uploads/2010/01/300px-Devils_Punchbowl_Waterfall%2C_New_Zealand.jpg\" alt=\"Devils Punchbowl Waterfall at Arthurs Pass in ...\" width=\"300\" height=\"400\" /></a></dt>\n<dd class=\"wp-caption-dd zemanta-img-attribution\" style=\"font-size: 0.8em;\">Image via <a href=\"http://commons.wikipedia.org/wiki/Image:Devils_Punchbowl_Waterfall%2C_New_Zealand.jpg\">Wikipedia</a></dd>\n</dl>\n</div>\n</div>\n<p>Perhaps it&#8217;s not the best of ideas to talk about one&#8217;s <a class=\"zem_slink freebase/en/recreational_drug_use\" title=\"Recreational drug use\" rel=\"wikipedia\" href=\"http://en.wikipedia.org/wiki/Recreational_drug_use\">recreational drug</a> experiences publicly, but everyone who reads this blog is a junkie anyway so it doesn&#8217;t matter. (ie. they&#8217;re caffeine drinkers! *gasp*)</p>\n<p>So last night I gave my first ever proper try to <a class=\"zem_slink freebase/en/psychoactive_drug\" title=\"Psychoactive drug\" rel=\"wikipedia\" href=\"http://en.wikipedia.org/wiki/Psychoactive_drug\">psychoactive substances</a> &#8211; namely shrooms &#8211; and kicked off my psychonaut carrier with a boom. Since I don&#8217;t know how much I actually took, I&#8217;ll just describe some of the experiences that stuck in my mind and perhaps someone can tell me what happened.</p>\n<p>Before you get too excited, there were no religious revelations, no openings of the mind and I most certainly didn&#8217;t start climbing down any rabbit holes. But by god was it fucking amazingly awesome fun!</p>\n<ol>\n<li>A lot of the experience felt like it wasn&#8217;t happening in real time, but more like I was remembering it from a distant future &#8211; this happens to me almost every time I&#8217;m intoxicated though, the shrooms perhaps just intensified the whole experience.</li>\n<li><strong>Time stopped.</strong> This might have been just because somebody put a large stopped clock in the middle of the room, but nevertheless it was exactly like we were all stuck in a time bubble and it would be 10:37 for all eternity.</li>\n<li><strong>Perceived paralysis</strong> &#8211; don&#8217;t know what exactly caused this, but most of the time I couldn&#8217;t feel my extremities and felt quite odd from the waist down. This might be my deep phobia of paralysis popping up &#8211; but I didn&#8217;t perceive it as frightening, just as bloody exciting.</li>\n<li><strong>Perspective distortion</strong> &#8211; this was quite &#8230; odd &#8230; everything was in a strange perspective and just plain wrong. It didn&#8217;t make sense and as a result I felt very strong vertigo whenever I tried to do anything.</li>\n<li><strong>We are world</strong> &#8211; perhaps the most emotional sensation from the whole trip. Simply put I felt like I was always in a world of my own, or sometimes &#8220;our&#8221; own. When I went to get a drink, the faucet pulled me in and the sink felt like the whole world, like there is nothing else. Basically, whenever my visual surroundings changed it felt like the whole world became those surroundings.</li>\n<li><strong>Extreme naivety</strong> &#8211; this was of course closely followed with extreme naivety. When somebody said that we&#8217;re in a mountain cabin, I was convinced, downright certain of it, that just on the other side of the door there was at least a meter of snow keeping us inside.</li>\n<li><strong>A bit of <a class=\"zem_slink freebase/en/paranoia\" title=\"Paranoia\" rel=\"wikipedia\" href=\"http://en.wikipedia.org/wiki/Paranoia\">paranoia</a></strong> &#8211; I&#8217;m often a fairly paranoid individual when I get into a bad train of thought, but this was different because it was backed by some pretty solid fears. Like when people made funny and sarcastic remarks of some sort I felt like bashing their head in and shouting <em>Don&#8217;t tell me this things! Not now!</em></li>\n<li>But the worst was <strong>perceived incontinence</strong> &#8211; of course this ties into paralysis and paranoia, but I swear perceiving my legs&#8217; warmth as something external and having wet socks from the leak<br />\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"1c43da6c-2bb6-5239-aac8-8fdeef221c2a"}}