{"data":{"wordpressPost":{"title":"How to start a sidehustle","content":"<img src=\"https://swizec.com/blog/wp-content/uploads/2017/07/IMG_7860-1024x575.jpg\" alt=\"\" class=\"alignnone size-large wp-image-7719\" />\n<p>Make a thing. Add Buy button. Tell people.</p>\n<p>If you <a href=\"https://blog.ycombinator.com/why-should-i-start-a-startup/\">have the entrepreneurial itch</a> but don&#8217;t have the financial security to back up the risk, becoming a bootstrapped micropreneur is a great first choice.</p>\n<p>Start your business on the side, and once its revenue is high enough to live on, make the jump. It&#8217;s slower than a funded startup, but it’s a lot less risky.</p>\n<p>Sure, it comes with a social opportunity cost (long nights and weekends), but so does a startup. People say startups are <a href=\"http://www.paulgraham.com/wealth.html\">a way to compress your whole working life into a few years</a>.</p>\n<p>If your sidehustle does well, you can later leverage it to fund your big startup idea. Or, hell, live a good life on a lifestyle business making a few hundred thousand per year.</p>\n<p>$150k/year revenue won&#8217;t get you any headlines, but it&#8217;s plenty to live on and run a solo business.</p>\n<p>Get to $500k/year, and you have a higher expected ROI over N years than any startup founder.</p>\n<p>Think about it. A digital business can have almost infinite margins. Once you build the thing, your only expenses are marketing, support, a few SaaS services, and a helping hand or two.</p>\n<p>What if you made $500k/year in revenue, and $400k of it was pure margin? $400k of cold hard cash, just for you, every year. How happy would you be?</p>\n<p>What about if you made $1,000,000,000/year in revenue, had 10,000 employees, 20 board members, a $200k salary, and $500,000,000 of imaginary money you can&#8217;t turn into cash (stock). Would <em>that</em> make you happy?</p>\n<p>My sidehustle is a combination of books and teaching. I&#8217;m experimenting with coaching, and a company is sponsoring my React Native writing on a <a href=\"https://school.shoutem.com/\">cobranded blog/YT channel</a>.</p>\n<p>I publish <a href=\"https://swizec.com/blog/4093-june-sidehustle-report/swizec/7681\">monthly breakdowns</a>, and that lists all revenue streams and expenses.</p>\n<blockquote class=\"twitter-tweet\" data-width=\"550\">\n<p lang=\"en\" dir=\"ltr\">Midpoint of year, sidehustle revenue exactly as much as all of last year. <a href=\"https://twitter.com/hashtag/ontrack?src=hash\">#ontrack</a> 💪🏼</p>\n<p>&mdash; Swizec (@Swizec) <a href=\"https://twitter.com/Swizec/status/886790354493517824\">July 17, 2017</a></p></blockquote>\n<p><script async src=\"//platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></p>\n<p>Expenses come down to about $2000/month, and I&#8217;m well on track to make around $50k this year. That&#8217;s with about <em>60 hours per month</em> of active work.</p>\n<p>If I didn&#8217;t insist on living in SF, I could have a very cushy life back in Slovenia. $24k expenses, $24k personal salary. Average salary in Ljubljana – my hometown – is $25k. For people who work 160 hours per month 😉</p>\n<hr />\n<p>I never had an official mentor, but plenty of people helped and nudged me in the right direction and answered my questions. You can find most of them on the internets.</p>\n<p>It all boils down to this: Make things. Add &#8220;Pay For Thing&#8221; button. Tell people.</p>\n<p>I started with following <a href=\"https://www.iwillteachyoutoberich.com/\">Ramit Sethi&#8217;s</a> emails for a few years (he&#8217;s great to drive home the point that yes you do deserve to get paid), then <a href=\"https://doubleyourfreelancing.com/\">Brennan Dunn&#8217;s</a> emails and content (he&#8217;s great for &#8220;you totes can make shitloads&#8221;), then <a href=\"http://nathanbarry.com/\">Nathan Barry&#8217;s</a> book Authority which is great for &#8220;Here are concrete steps to start making bank&#8221;, and I went to Dunn&#8217;s <a href=\"http://doubleyourfreelancing.com/conf/\">DYFConf</a> which is like a baby <a href=\"http://www.microconf.com/\">MicroConf</a> (to which I want to go, but still haven&#8217;t), oh and of course I listened to all mp3s of all past talks from MicroConf. <a href=\"https://twitter.com/patio11\">Patio11&#8217;s</a> writings helped a lot as well. I used <a href=\"http://videofruit.com/blog/\">Bryan Harris</a> stuff for ideas on growing an audience, and <a href=\"https://kaidavis.com/\">Kai Davis</a> is great for being a cheerleader and giving good ideas on positioning and writing.</p>\n<p>Somehow I got invited to the Slack group where many of these micropreneur/microconf celebrities hang out and that&#8217;s been superb as well. Much inspiration, many great ideas.</p>\n<p>Oh and I used Ken Wallace&#8217;s <a href=\"https://mastermindjam.com/\">MastermindJam</a> to join a mastermind of likeminded peers. That helps with keeping you accountable and shipping stuff.</p>\n<p>I also used Amy Hoy&#8217;s <a href=\"https://30x500.com/academy/\">30&#215;500</a>, but I bought that too late (or too early, hard to say) and it didn&#8217;t help super much. I should revisit.</p>\n<p><a href=\"https://twitter.com/levelsio\">Pieter Levels&#8217;</a> twitter stream is also a huge bundle of inspiration.</p>\n<p>But really Patio11&#8217;s tweetstorm says it best:</p>\n<blockquote class=\"twitter-tweet\" data-width=\"550\">\n<p lang=\"en\" dir=\"ltr\">You don&#39;t need a mentor to start a business. You don&#39;t need a mentor to learn a new programming language. You can just straight-up do these.</p>\n<p>&mdash; Patrick McKenzie (@patio11) <a href=\"https://twitter.com/patio11/status/887793614780235777\">July 19, 2017</a></p></blockquote>\n<p><script async src=\"//platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></p>\n<p>Make something. Charge for it. Congratz, you&#8217;re a business.</p>\n<p><em>This post first appeared as a <a href=\"https://news.ycombinator.com/item?id=14807198\">thread on HackerNews</a></em></p>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"55a73847-9514-58da-91c1-e695b1468986"}}