{"data":{"wordpressPost":{"title":"Like Angelina and Scarlet having sex with your eyes","content":"<p><a href=\"http://swizec.com/blog/wp-content/uploads/2009/12/Avatar-Teaser-Poster.jpg\"><img class=\"alignright size-full wp-image-1027\" title=\"Avatar-Teaser-Poster\" src=\"http://swizec.com/blog/wp-content/uploads/2009/12/Avatar-Teaser-Poster.jpg\" alt=\"Avatar-Teaser-Poster\" width=\"298\" height=\"442\" srcset=\"https://swizec.com/blog/wp-content/uploads/2009/12/Avatar-Teaser-Poster.jpg 298w, https://swizec.com/blog/wp-content/uploads/2009/12/Avatar-Teaser-Poster-202x300.jpg 202w\" sizes=\"(max-width: 298px) 100vw, 298px\" /></a>Last night I watched Avatar nice and proper at the moving pictures &#8211; in 3D of course because fuck it, if they spent developing the funky new tech for seven years, I bloody well feel obliged to watch the movie as it was intended.</p>\n<p>In short &#8230; <strong>it was fucking awesome!</strong> This is the first movie in <em>15</em> years that I am willing to pay for again and probably will. Sometime this week. Yep, I&#8217;ve always liked watching movies I like several times in rapid succession &#8211; this one however I can&#8217;t do justice with my rig at home. So the moving pictures it is!</p>\n<p>Because I want each and everyone of you to go see this masterpiece I will not tell you anything about the story, but here are some tidbits that I believe make it more than just your usual blockbuster effects pornography.</p>\n<ol>\n<li>There is a very good story that ties the whole movie together, albeit extremely cliche, it still throws a glove at the face of modern culture and blahblah. No story talk!</li>\n<li>So. Much. Eye-porn! Love love love! It was <strong>like <a class=\"zem_slink\" title=\"Angelina Jolie\" rel=\"wikipedia\" href=\"http://en.wikipedia.org/wiki/Angelina_Jolie\">Angelina Jolie</a>, Liz Hurley and <a class=\"zem_slink\" title=\"Scarlett Johansson\" rel=\"wikipedia\" href=\"http://en.wikipedia.org/wiki/Scarlett_Johansson\">Scarlet Johansson</a> having sex with my eyes simultaneously for three hours.</strong></li>\n<li>Very fucking awesome scenography! You know those incredibly artistic comics you see in Flight and other proper art books? Well this was just like that, except in a movie! A fucking movie! I&#8217;ve never seen anything like it before. It was quite beyond words.</li>\n<li>The details! Oh gawd the details. How often do you see a movie where scenes shot from within a glass canopy of any sort actually show the glass? That&#8217;s right, none. Until now.</li>\n<li>The world made sense. This is very rare in fantasy these days, but the world made very much fucking sense. The animals looked <em>right, </em>even the topography and fauna looked proper and correct. It felt like properly exploring a foreign planet, not like somebody was pulling ideas out of their arse.</li>\n<li>The blue people had a language. Now maybe I&#8217;m just a language geek, but it fills me with great delight to see that an artist went through the pain of creating a proper language instead of just stringing random words together &#8230; although it did sound a lot like a derivative of <a class=\"zem_slink\" title=\"Quenya\" rel=\"wikipedia\" href=\"http://en.wikipedia.org/wiki/Quenya\">Quenya</a>.</li>\n</ol>\n<p>Now, there were a few annoying little tidbits that felt somewhat &#8230; off.</p>\n<p>Like for example, if every animal on the world has three limbs, why do the humanoid peoples only have four? Doesn&#8217;t make sense.</p>\n<p>Or &#8230; uhm &#8230; why did the animals feel so derivative of Earth animals? You have this wonderful opportunity to create something awesome, and you do, but why the fuck do you make my mind go &#8220;Well that&#8217;s a Rhino equivalent&#8221; &#8230; &#8220;and that&#8217;s a dog&#8221; &#8230; &#8220;oh look, a hyenna&#8221; and so forth? Don&#8217;t <em>do</em> that. Making animals that are awesomely designed, but then almost neglecting their behaviour &#8230; tsk tsk.</p>\n<p>All in all, the movie is a definite thumbs up. All f0our thumbs!</p>\n<div class=\"zemanta-pixie\" style=\"margin-top: 10px; height: 15px;\"><a class=\"zemanta-pixie-a\" title=\"Reblog this post [with Zemanta]\" href=\"http://reblog.zemanta.com/zemified/b5035e2c-5595-4d8b-b23c-8194c6e90a96/\"><img class=\"zemanta-pixie-img\" style=\"border: none; float: right;\" src=\"http://img.zemanta.com/reblog_e.png?x-id=b5035e2c-5595-4d8b-b23c-8194c6e90a96\" alt=\"Reblog this post [with Zemanta]\" /></a><span class=\"zem-script more-related more-info pretty-attribution\"><script src=\"http://static.zemanta.com/readside/loader.js\" type=\"text/javascript\"></script></span></div>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"97372166-01be-57a4-9d88-a3d8ae2b9d21"}}