{"data":{"wordpressPost":{"title":"Week 5: Random Structures from LEGO Bricks and Analog Monte Carlo Procedures","content":"<p><em>[This post is part of an ongoing challenge to understand 52 papers in 52 weeks. You can read previous entries, <a href=\"http://swizec.com/blog/category/52-papers-in-52-weeks\">here</a>, or subscribe to get notified of new posts by <a href=\"http://swiz.ec/52papers-list\">email</a>]</em></p>\n<p><a href=\"http://www.althofer.de/\">Ingo Althöfer</a> recently discovered that you can build random structures by loading a washing machine with many single LEGO bricks and turning it on. He wrote an interesting paper about it called, <a href=\"http://www.althofer.de/random-lego-structures.pdf\"><em>Random Structures from Lego Bricks and Analog Monte Carlo Procedures</em></a>.</p>\n<p>There is nothing profound to be discovered by spinning LEGO bricks in a washing machine, but it&#8217;s <em>interesting</em>. You can play a number of games, and the results can be interpreted through the eyes of different fields. The experiment can be everything from a <a class=\"zem_slink\" title=\"Random number generation\" href=\"http://en.wikipedia.org/wiki/Random_number_generation\" target=\"_blank\" rel=\"wikipedia\">random generator</a>, to a model of biogenesis.</p>\n<p>Most of all, you can and should try this at home. In over 50 cycles Althöfer&#8217;s washing machine was not damaged, but the bricks&#8217; clutching power did diminish after a few cycles.</p>\n<div style=\"width: 611px\" class=\"wp-caption alignnone\"><img title=\"Results from a washing run at a party\" alt=\"Results from a washing run at a party\" src=\"https://draftin.com:443/images/4074?token=QlBn8NxMYYmKGHKxWY6FJ2rlmysBPMoD_JkDaIV8DMXHr8STQIp5DSlx8Vn1R-Ir5ale23Ri19rDFFZRvcH0cmM\" width=\"601\" height=\"481\" /><p class=\"wp-caption-text\">Results from a washing run at a party</p></div>\n<h2>Games to play</h2>\n<p>There are several games you can play with a wonderful random generator like this.</p>\n<p>For example, you can play LEGO washing roulette. Every player builds a complex of bricks they think will be generated, then everyone whose structure is found amongst the results wins. Of the winners, the one with the most bricks is <em>the</em> winner.</p>\n<p>When the author tried this at a party, none of the proposed structures were generated.</p>\n<div style=\"width: 758px\" class=\"wp-caption alignnone\"><img title=\"Complexes people think will be generated\" alt=\"Complexes people think will be generated\" src=\"https://draftin.com:443/images/4075?token=Vhd6K_r_mURRUfkcpdYkni5Tu_cRGYzmQDHTm2y0oQO7Js6wZcQl7yOBVQ46RJ_weYozyl67i_33euYJRNW9q_M\" width=\"748\" height=\"559\" /><p class=\"wp-caption-text\">Complexes people think will be generated</p></div>\n<p>Another interesting game is to try adding enzymes to the pool and seeing if they help generate more interesting structures. Every player gets 50 bricks to build one or more enzymes, if the enzymes survive a wash cycle undamaged, that player wins. If in addition, the cycle produces many relatively beautiful complexes, that player gets bragging rights to boot.</p>\n<h2>Related work</h2>\n<p>As silly as these games might seem, others before have played with <a class=\"zem_slink\" title=\"Lego\" href=\"http://www.lego.com/\" target=\"_blank\" rel=\"homepage\">LEGOs</a> to get interesting results.</p>\n<p>A similar set of experiments was done using <a class=\"zem_slink\" title=\"Lego Duplo\" href=\"http://duplo.lego.com/\" target=\"_blank\" rel=\"homepage\">Duplo</a> bricks in January 2013, called Duplo DNA. Another experiment used evolutionary experiments to tackle the &#8220;LEGO layout problem&#8221;: Given a 3D shape, how can it be built out of LEGO bricks?</p>\n<p>M. Abrahamsen and S. Eilers showed that you can combine 6 4&#215;2 bricks into 915,103,765 different combinations. A stark contrast from the subset of stable structures a washing machine produces.</p>\n<h2>More interpretations and experiments</h2>\n<div style=\"width: 746px\" class=\"wp-caption alignnone\"><img title=\"Stable complexes\" alt=\"Stable complexes\" src=\"https://draftin.com:443/images/4078?token=gk3G-K4DTBOyoHitHt4StW6-fbVNM9PTPArLzaAXRmPPpRUXFdxHiYWcCmVAo67yN4G4X1ETUxa2lIlPzrSv5xE\" width=\"736\" height=\"342\" /><p class=\"wp-caption-text\">Stable complexes</p></div>\n<p>Considering six bricks alone can produce over 900 million different complexes, just imagine how many combinations there are in a load of some 300 bricks. Boggles the mind!</p>\n<p>But in a more practical sense only six different combinations survive the wash cycle. That&#8217;s because the inside of a washing machine is a somewhat hostile environment what with all the tumbling and shaking going on. Only stable complexes make it the whole 70 minutes, which implies that an equilibrium between generation and decay is reached at some point.</p>\n<p>What the equilibrium looks like will of course depend on how used up your bricks are. Over the course of several experiments it became obvious that new bricks have too much clutching power to form interesting complexes and mostly 2-brick layouts are generated. But the more experiments you reuse the same bricks in, the more decay becomes a problem.</p>\n<p>In a similar experiment 65 towers of 5 bricks were used and none of them survived the washing cycle. But one completely new 5-brick tower was generated as identified by the colour combination. Which is interesting, if you ask me.</p>\n<p>The paper offers no real interpretation of this.</p>\n<p>But that&#8217;s the gist of the <a class=\"zem_slink\" title=\"Monte Carlo method\" href=\"http://en.wikipedia.org/wiki/Monte_Carlo_method\" target=\"_blank\" rel=\"wikipedia\">Monte Carlo method</a> of solving problems. Taking repeated random samples of a process and building a probabilistic model as you go. In this case, even though bricks coupling together is completely random, you can predict with great certainty which complexes will come out of the machine.</p>\n<p>This has practical implications to, for instance, biogenesis. Similarly to how random bricks produce predictable results, so maybe elements mixing together produced the building blocks of life, which eventually built cells and so on via similar mechanisms.</p>\n<p>In fact, in a popular study from 1953, Miller used a mix of water, methane, ammonia, and hydrogen exposed to heat and stirring to produce aminoacids. The building blocks of life.</p>\n<h2>Fun teaching aid</h2>\n<p>You can even use the LEGO washing machine to simulate evolution. Run the cycle for a bit. Pick out interesting complexes, possibly replicating them, rerun the cycle. Continue this until a complex is generated that satisfies your idea of interesting, or you give up.</p>\n<p>In this case the washing machine is performing the generation function, and you are performing the fitness function deciding what survives and what doesn&#8217;t. It&#8217;s a pretty powerful feeling I&#8217;d imagine.</p>\n<p>Either way, you might not discover the secrets of the universe by throwing LEGOs into a washing machine, but it&#8217;s <em>interesting</em>. And interesting is the best type of science!</p>\n<p>Furthermore, this is the most fun and obvious way of showing someone that <a class=\"zem_slink\" title=\"Stochastic process\" href=\"http://en.wikipedia.org/wiki/Stochastic_process\" target=\"_blank\" rel=\"wikipedia\">random processes</a> <em>can</em> have predictable results. And that you <em>can</em> throw randomness at a problem until a result falls out.</p>\n<div class=\"zemanta-pixie\" style=\"margin-top: 10px; height: 15px;\"><a class=\"zemanta-pixie-a\" title=\"Enhanced by Zemanta\" href=\"http://www.zemanta.com/?px\"><img class=\"zemanta-pixie-img\" style=\"border: none; float: right;\" alt=\"Enhanced by Zemanta\" src=\"http://img.zemanta.com/zemified_e.png?x-id=579463e7-5669-4c3a-b545-0752a65f11db\" /></a></div>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"dc75f1af-a28a-50f9-bb5e-ae9d6ae4fd46"}}