{"data":{"wordpressPost":{"title":"What I learned from Kathy Sierra&#8217;s Badass","content":"<p>My approach to products is wrong. And so is yours.</p>\n<p>That&#8217;s what I learned from <a href=\"http://www.amazon.com/gp/product/1491919019/ref=as_li_tl?ie=UTF8&amp;camp=1789&amp;creative=9325&amp;creativeASIN=1491919019&amp;linkCode=as2&amp;tag=ageewitahat-20&amp;linkId=U5VQCZWSLU2BUAW7\">Kathy Sierra&#8217;s Badass: Making users awesome</a>. I blazed through the book on my flight to #dyfconf and it was just the best thing ever. Every turn of the page had me going <em>&#8220;Duh, shoulda known that. Yep, that too. Oh and that. Why hasn&#8217;t anyone told me this!? It&#8217;s so obvious now!&#8221;</em></p>\n<p>The core premise of Sierra&#8217;s book comes straight out of Simon Sinek&#8217;s TEDx talk about communicating from the inside out &#8211; <a href=\"https://www.youtube.com/watch?v=u4ZoJKF_VuA\">Start With Why, How great leaders inspire action</a>. There is a bigger <em>why</em> behind every product purchase.</p>\n<p>Talk about specs and colors and what the product <em>does</em> is superficial. Users talk about that, but they don&#8217;t care about it. They come to you because they want to be <em>better</em> at something.</p>\n<figure><img src=\"https://bufferblog-wpengine.netdna-ssl.com/wp-content/uploads/2014/01/mario1.gif\" alt=\"People buy better versions of themselves\" /><figcaption>People buy better versions of themselves</figcaption></figure>\n<p>While Sinek talks about the communication aspect, which all marketing materials use these days, Sierra goes deeper. She says that you shouldn&#8217;t just play to people&#8217;s why in your marketing materials, they why should permeate your entire user experience. Everything from the manual, to the followup mailing list you subscribe users to.</p>\n<p>You do have a followup email sequence don&#8217;t you?</p>\n<p>According to Sierra, you want to turn people into experts. Not necessarily the best of the best in the world, but expert enough that they can brag to their friends at a dinner party. If you sell cameras, you want to make photographers, if you sell snowboards, you want to make snowboarders, if you &#8230;</p>\n<p>Everybody loves it when people look at what they do and say <em>&#8220;Wow dude, I could never do something that awesome. How the hell did you do that?&#8221;</em></p>\n<p>And then your users are like <em>&#8220;Oh yeah I read that dude&#8217;s book.&#8221;</em> or they say <em>&#8220;Pssht yeah, there&#8217;s this new photo app with great filters&#8221;</em> or they go <em>&#8220;Dude, that guy, he taught me all I know about snowboarding, it was fucking amazing!&#8221;</em></p>\n<p>The so called &#8220;word of awesome&#8221;. It&#8217;s when your users are so awesome, you don&#8217;t even have to ask them to tell their friends. They tell their friends because you made their lives better and they want their friends&#8217; lives to be better too.</p>\n<p>But how do you do that?</p>\n<p>By staying with your users through the whole process.</p>\n<p>Everybody starts using your product in The Zone of Suck. Whether it&#8217;s a camera, a snowboard, or a new open source library. The first day sucks. You don&#8217;t know the buttons, you fall down a lot, and you have no idea what all those functions are good for.</p>\n<p>You have to tell them that it&#8217;s okay. Everybody sucks the first day. It&#8217;s supposed to be hard. Learning something new is <em>hard</em>.</p>\n<p>Ever downloaded a new library that said it will solve all your problems, make you fart rainbows, turn your code into a thing of beauty, and make you twenty-five times more productive? Yeah, we all have.</p>\n<p>Then you use it and you&#8217;re like <em>&#8220;God damn it, this is a piece of shit just like everything else.&#8221;</em></p>\n<p>Trust me, we&#8217;ve all been there. Over promise, under deliver.</p>\n<p>Or does it just suck that first time and everyone is too afraid of their precious little marketing message to tell us? So rather than feel encouraged and pushing through The Zone of Suck, we feel bad, think we&#8217;re stupid, and spill vitriol on twitter.</p>\n<p>No bueno.</p>\n<p>And even beyond The Zone of Suck, you should stand by your users and help them become better and better. Teach them how to become better at their bigger context (photographer, snowboarder, engineer, whatever) and they will remember you for forever. Maybe two forevers.</p>\n<p>Even when they become so amazing that they&#8217;ve outgrown what you offer, somebody will come to them and ask <em>&#8220;Hey you, how did you get this good? How did you get to where you are? I bask in your glory and I want to learn from the best!&#8221;</em></p>\n<p>They will say <em>&#8220;That&#8217;s awesome! I learned everything I know from those guys over there *points*&#8221;</em></p>\n<p>That&#8217;s you. They&#8217;re pointing at you. Because you made them awesome.</p>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"98dd2b57-407e-5966-82aa-0950855829ee"}}