{"data":{"wordpressPost":{"title":"Why don&#8217;t computers understand timezones?","content":"<p>Everyone who sometimes changes their timezone has probably had this problem before.</p>\n<p>You&#8217;re planning a trip to a 9 hour distant timezone. Let&#8217;s say it is a business trip. To be more productive you schedule some meetings in advance and put them in your calendar. Whichever calendar will do, they all have this problem.</p>\n<div style=\"width: 490px\" class=\"wp-caption alignright\"><img class=\" \" title=\"Timezones\" src=\"http://upload.wikimedia.org/wikipedia/commons/thumb/a/ad/Standard_time_zones_of_the_world.png/800px-Standard_time_zones_of_the_world.png\" alt=\"\" width=\"480\" height=\"232\" /><p class=\"wp-caption-text\">Timezones</p></div>\n<p>Then you hop on a plane. Land. Dutifully tell your computer what timezone you are in. Maybe it magically figures this out on its own.</p>\n<p>Voila!</p>\n<p>The meeting you so carefully planned for tomorrow at 2pm is now marked in your calendar as tomorrow morning at 5am.</p>\n<p>Crap. It only took you ten pingpong emails to arrange this. Sure, 5am is probably not when you scheduled it, but what was the time again? Searching through emails for &#8220;meeting at 2pm&#8221; won&#8217;t help much either.</p>\n<p>You simply can&#8217;t remember when you scheduled the meeting. You schedule too many every week to keep track in your head. You wouldn&#8217;t even need a calendar if this wasn&#8217;t the case anyway!</p>\n<p>Now what?</p>\n<p>It might not even have moved to 5am but something reasonable. Now you&#8217;ll unknowingly show up at the wrong time and blow that fucking awesome deal.</p>\n<p>Your calendar is correct though &#8230; in a way.</p>\n<p>The meetings are still exactly when you scheduled them. They are still attached to the exact perfect absolute time you planned them for. But this isn&#8217;t what you meant is it? You wanted the meeting to be at &#8220;2pm whenever 2pm is for me on the day this meeting is happening&#8221;.</p>\n<p>To date I have yet to find a single application on a computer that would understand the idea that I _don&#8217;t care about timezones_. Yes, timezones are a useful concept. To me personally they are meaningless 90% of the time. When I say I expect something to happen on a particular time &#8230; I expect it to fucking happen then! Not at some absolute nebulous concept of time that holds no meaning for me.</p>\n<p>It is understandable that programmers the world over would get this wrong. Before I did any traveling I found timezones to be perfectly reasonable the way everyone implements them.</p>\n<p>You translate everything to UTC time when it is stored in the database, then offset it back to the appropriate timezone for whichever user is looking at it. It&#8217;s something the View cares about. Core logic doesn&#8217;t need to know or care. It&#8217;s only a matter of display.</p>\n<p>This is an unsolvable problem. Logically.</p>\n<p>The concept of time as an absolute, with timezones as mere offsets the display cares about, makes perfect sense. And in many cases is the only correct answer! Think of timestamps on tweets, or forum posts, of course I want those to display relative to me &#8211; as an absolute time.</p>\n<p>But when scheduling stuff it seems my (our?) instinctive understanding of time is a bit different. Suddenly I no longer care about absolute time and making certain everyone in the world sees the correct time. I only care that when I fly to a different timezone, _the event stays in its fucking place!_</p>\n<p>It seems we have reached an impass.</p>\n<p>How are computers supposed to handle timezones well, when their users (the arbiters of truth and properness) have such different conceptions of time in different contexts?</p>\n<p>But even some messages, the only place it seems where absolute time is of any use, lose a great deal of information when the time is translated into &#8220;my&#8221; timezone. There will often be &#8220;good morning&#8221; tweets when I&#8217;m just about to go to bed. Things like that would make a lot more sense if the time on a tweet at least made any mention of when, relative to the poster, it was made.</p>\n<p>So maybe we need to start implementing our software so it displays both absolute time and the originator&#8217;s local time? And in the case of schedulable events only care about relative time?</p>\n<p>The latter especially has big connotations for displaying the same event to people in different timezones. For this I don&#8217;t have a good solution right now &#8230; very open to suggestions by the way.</p>\n<p>Or maybe I&#8217;m just imagining this problem and people simply aren&#8217;t switching timezones often enough to make solving this problem worthwhile.</p>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"127dddab-5eea-5252-b04e-047f570e7078"}}