{"data":{"wordpressPost":{"title":"What I learned about freelancing by getting a haircut","content":"<div style=\"width: 510px\" class=\"wp-caption alignnone\"><img title=\"New hair selfie\" alt=\"New hair selfie\" src=\"https://draftin.com:443/images/25338?token=FBJIKDyh-WmZdSC0gtGn310Ft5OfjCO2-NYqRNPcWKeOs_yMQW5GhxYABfQM4MBWtWvIPHiJNlvsZHq1gyYc4rY\" width=\"500\" height=\"500\" /><p class=\"wp-caption-text\">New hair selfie</p></div>\n<p>There are many hair salons in <a class=\"zem_slink\" title=\"Ljubljana\" href=\"http://maps.google.com/maps?ll=46.0555555556,14.5083333333&amp;spn=0.1,0.1&amp;q=46.0555555556,14.5083333333 (Ljubljana)&amp;t=h\" target=\"_blank\" rel=\"geolocation\">Ljubljana</a>. But there&#8217;s only one known as <em>That Good Expensive One</em>.</p>\n<p>Just one in the whole city.</p>\n<p>Normally a men&#8217;s haircut costs somewhere between 9 and 15 euro. But at this salon it goes from 24 to 34 euro depending on the level of your particular stylist. That&#8217;s like a haircut costing $150+ in the US.</p>\n<p>Yes, that is still cheaper than what women are used to paying but it&#8217;s still more than twice as expensive than what a guy would normally pay.</p>\n<p>And yes, women&#8217;s prices are twice the norm as well.</p>\n<p>What gives? How can a hair salon charge twice the market rate in a small city like Ljubljana?</p>\n<p>Two weeks ago I tried them out.</p>\n<p>The first thing I noticed was how stylish everything was. Hair is style and I want my salon to absolutely exude stylishness.</p>\n<p>Normal salons are spartan. <em>&#8220;We do hair!&#8221;</em> they scream. <em>&#8220;We make you look good!&#8221;</em>, this one screams.</p>\n<p>Everyone there was stylish. The receptionist, the hair sweeper, the salon manager, the hair stylists. Everyone. Dressed to match the general decor of the place. Uniforms, sure, but you can tell that they cared.</p>\n<p>And that&#8217;s what matters. When I get a new haircut, I want at least one &#8220;panties drop&#8221; comment from the internet.</p>\n<p>Vain? Yes. But that&#8217;s the whole point. If all I wanted was my hair to stay out of my face, I&#8217;d just shave it all off.</p>\n<p><strong>Lesson 1:</strong> they understand what I&#8217;m there for.</p>\n<p><strong>Lesson 2:</strong> they let me know they understand.</p>\n<p>Things only got better. They took my coat and put it away. When my hair dresser came out to greet me, she offered a cup of coffee or tea.</p>\n<p>Small things, sure. Nothing to do with haircuts, sure. But it&#8217;s that little extra that says this is <em>your</em> time. <em>Your</em> time to be pampered and enjoy yourself.</p>\n<p>First time I ever set my phone to Do Not Disturb during a haircut. Just because I got a clear signal that this is my time and I should indulge.</p>\n<p>Then she turned on the chair&#8217;s massage feature while washing my hair. And not the vibraty kind, the kneading awesome kind.</p>\n<p>I was in heaven.</p>\n<p><strong>Lesson 3:</strong> make your client feel special. When they&#8217;re with you, they are the world.</p>\n<p>But the best part came with the actual haircut.</p>\n<p>You know how the conversation usually goes, right? First they ask what you&#8217;d like, but you can&#8217;t even remember. And then they&#8217;re cutting your hair and keep asking, should we do half an inch here, can we use the machine, inch less in front eh, what do you like in back, bla bla bla.</p>\n<p>All these questions I don&#8217;t know the answer to. If I knew all that, I could&#8217;ve cut the stupid hair myself.</p>\n<p>This time it was different.</p>\n<p>First she asked if I had anything particular in mind. I told her to just do what she thinks will look good.</p>\n<p>Then she analyzed what my hair already looked like and <em>deduced</em> what my last haircut was like. She only asked relevant questions like <em>&#8220;I see your hair is going to the right, do you still like that?&#8221;</em> and <em>&#8220;You had an undercut, did you like that?&#8221;</em>.</p>\n<p>And other questions along those lines.</p>\n<p>She knew exactly what my hair was doing and asked only qualified questions. Not once did I have to give an opinion on whether something should be half an inch shorter or longer.</p>\n<p>Well, she did ask that once. But not in a specific inch-by-inch way. It was <em>&#8220;I think this is perfect for your face, but did you want the front shorter?&#8221;</em></p>\n<p>Notice the she gave her opinion first, and only asked because front hair can get into your eyes. A matter of practicality more than style.</p>\n<p><strong>Lesson 4:</strong> your client knows the goal, not how to get there. <em>Advise</em>.</p>\n<p>After cutting my hair, my stylist dropped the ultimate bomb. She told me how to keep the haircut looking great.</p>\n<p>What I can do to style it, how I can use it to achieve a sleek dressy look, what to do when I want to be casual, how to make it look like I didn&#8217;t care that morning. Everything you want from a haircut!</p>\n<p>Looking sexy for a party, looking good for an evening at the opera, laid back for a day at the office. Not only did she cut my hair, she gave me options and told me how to use them.</p>\n<p><strong>Lesson 5:</strong> teach your client how to turn your work into results.</p>\n<p>And yes, my hair still looks great two weeks later. Even when I don&#8217;t style at all.</p>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"2c061cb8-443e-5b20-9b29-aea8211fc763"}}