{"data":{"wordpressPost":{"title":"I learned a couple of things these days 22.8. 23.8. 24.8.","content":"<p>The past couple of days have been consumed mostly by traveling from California to Slovenia. Apparently that takes a while.</p>\n<p>As a result I haven&#8217;t been online for almost three days and what I was online for was mostly just arranging to meet a few people for various reasons. Therefore I haven&#8217;t been posting my daily learnings &#8230; so I&#8217;m going to post a batch of highlights since Monday.</p>\n<ol>\n<li>SFO does indeed have a mailbox. It&#8217;s outside.</li>\n<li>Going on an internet diet was pretty damn cool, means I didn&#8217;t get any cravings and was mostly fine for the whole flight across the Atlantic and when Amsterdam only had very spotty internet, I was mostly fine the whole five hours I spent there.</li>\n<li>It is apparently possible to use US dollars as a valid currency at a European airport. This was delightful because I had a bunch left still and wouldn&#8217;t know what to do with them otherwise.</li>\n<li>Europe is fucking expensive! 4.9 euro for a bloody frappucino? Are you kidding me?</li>\n<li>Apparently when you are used to talking to someone on Skype a lot and then after two months they are suddenly real again it feels surprisingly awkward.</li>\n<li>This problem does not exist with people you only speak with online and have seen in person for a cumulative ten hours.</li>\n<li>Everything in Europe is &#8230; small. Things like desks, cupboards, kitchen counters and such are very very very short. And I&#8217;m saying this as an extremely short person. Everything is just sooo far down it&#8217;s weird. How doesn&#8217;t everyone have insane back problems from leaning down all the time?</li>\n</ol>\n<p>Oh and just as a general observation. Summer weather in Slovenia sucks, I dislike it with a passion.</p>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"aa73af39-1aff-52dd-bc7e-d6ba8b07d576"}}