{"data":{"wordpressPost":{"title":"A trick to make your big dataviz load super fast","content":"<p>Big datasets are fun. The bigger, the better, <em>especially</em> when you let people explore them live in their browser.</p>\n<p>But there&#8217;s a catch: big datasets are slow to load.</p>\n<p>Even with modern content delivery networks (CDNs), gzip compression, and high internet speeds, it can take a few seconds to load and parse a dataset. In my <a href=\"https://swizec.github.io/h1b-software-salaries/\">H1B salaries visualization</a>, downloading data takes 1.7 seconds, parsing takes another 2 seconds, and rendering takes maybe a full second because some things are done stupidly.</p>\n<p>That&#8217;s a full 4 to 5 seconds before a user sees anything more than a <em>&quot;Loading, please wait”</em> message. Users are going to leave before they play with your dataset. Yes, even though it&#8217;s <em>so cool</em> and the data is amazing and awesome, users don&#8217;t give a shit. It&#8217;s sad. ☹️</p>\n<p>But there&#8217;s a trick to keep them around → show them an image first!</p>\n<p>Check this out:</p>\n<figure>\n<img src=\"http://i.imgur.com/my70wtC.gif\" alt=\"\" /><br />\n</figure>\n<p>See how you barely notice the page refresh? That&#8217;s on purpose. </p>\n<p>The main <code>App.render()</code> method is wrapped in a conditional statement that checks if the data is available. If it is, then we render the interactive visualization; if it isn&#8217;t, then we render a screenshot and default descriptions.</p>\n<pre lang=\"javascript\">\n// src/App.js\n\nrender() {\n    if (this.state.techSalaries.length < 1) {\n        return (\n            <Preloader />\n        );\n    }\n    \n    // render the main dataviz\n}\n</pre>\n<p>The <code>Preloader</code> component can be a functional stateless component, like this:</p>\n<pre lang=\"javascript\">\n// src/App.js\n\nimport StaticViz from './preloading.png';\n\nconst Preloader = () => (\n    <div className=\"App container\">\n        <h1>The average H1B in tech pays $86,164/year</h1>\n        <p className=\"lead\">Since 2012 the US tech industry has sponsored 176,075 H1B work visas. Most of them paid <b>$60,660 to $111,668</b> per year (1 standard deviation). <span>The best city for an H1B is <b>Kirkland, WA</b> with an average individual salary <b>$39,465 above local household median</b>. Median household salary is a good proxy for cost of living in an area.</span></p>\n        <img src={StaticViz} style={{width: '100%'}} />\n        <h2 className=\"text-center\">Loading data ...</h2>\n    </div>\n);\n</pre>\n<p>The <code>Preloader</code> component mimics the structure of your normal dataviz, but it&#8217;s hardcoded. The information is real, and it&#8217;s what people are looking for, but it doesn&#8217;t need the dataset to render.</p>\n<p>The easiest way to get this is to first build your real dataviz, then screenshot the picture, and then copy-paste the descriptions if they&#8217;re dynamic. Without dynamic descriptions, half your job is done already.</p>\n<p>That&#8217;s about it, really: </p>\n<ol>\n<li>render an image</li>\n<li>wait for data to load</li>\n<li>replace image with dynamic dataviz</li>\n</ol>\n<p>It sounds dumb, but increases user satisfaction 341324%.</p>\n<p>If it works &#8230;</p>\n<figure>\n<img src=\"https://media.giphy.com/media/jPAdK8Nfzzwt2/giphy.gif\" alt=\"\" /><br />\n</figure>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"fdd18d44-8662-5a45-864e-4e1eac9b6c8c"}}