{"data":{"wordpressPost":{"title":"Licenca","content":"<p>\n Odprotkodno programje je zabavna reÄ in rad v njej sodelujem, ker je, preprosto, zastonj izku&scaron;nja in napredek znanja v mojem poÄetju. Dobra naloÅ¾ba. Razumljivo je, da velike korporacije in nekateri drugi niso za odprto kodo in so celo zelo moÄno proti. Treba se je strinjati, da je delo mladine, da se upira, in delo velikih in moÄnih, da nasprotujejo temu uporu.\n</p>\n<p>\n Ker imam odprtokodni porjetk ali dva, sem si zaÄel ogledovati licenÄni del vsega skupaj. Obstajajo oÄitni problemi z <a href=\"http://www.opensource.org/licenses/gpl-license.php\" target=\"_blank\">GPL-jem</a>, saj je viralna licenca, ki se &scaron;iri kot herpes. Kadarkoli projekt poljubi drugega oba konÄata s herpesom\n</p>\n<p>\n V nasprotju temu je v mojem delu veliko primerov, ko grem proti GPL-ju zaradi pogodb s strankami, da bi za svoje delo dobil povraÄila. Saj pravzaprav razvijam nekaj za dotiÄno stranko, za dotiÄno rabo po njihovih specifikacijah in zahtevah. ÄŒeprav mi je sÄasoma dovoljeno kodo spustiti v divjino, tega ne Å¾elijo takoj.\n</p>\n<p>\n Projekte je teÅ¾ko razvijati s tal in zaradi tega imam svoj set lego kock, ki delo olaj&scaron;ajo, a so vse v krempljih GPL-ja in tako potencialno nevarne. Do sedaj sem deloval v nasprotju z licenco ter se tako izognil prevelikim teÅ¾avam, vendar se to ne sme. Kaj mi je torej drugega storiti, kot poiskatu drugaÄno licenco? IzkaÅ¾e se, da problem tiÄi v grmu, ki se mu reÄe <a href=\"http://www.opensource.org/licenses/category\" target=\"_blank\">ogromno &scaron;tevilo popolnoma nerazumljivih  licenc</a> v odvetni&scaron;ki govorici. ÄŒisto izven moje sposobnosti dojemanja.\n</p>\n<p>\n Tako je odgovor, da je paÄ potrebno ustvariti svojo licenco, ki mi bo ustrezala. Da pa se to stori so pa potrebni odvetniki, ki idejo prevedejo v nekaj njim razumljivega. Le-ti se hranijo zu denarjem. Denarjem, ki ga ni. Tu je teÅ¾ava.</p>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"04e639c8-a602-58b2-b405-d6ef66a570bc"}}