{"data":{"wordpressPost":{"title":"How the internet saved my arse, and my longboard","content":"<div style=\"width: 510px\" class=\"wp-caption alignnone\"><img title=\"Some sort of Venetian bridge\" alt=\"Some sort of Venetian bridge\" src=\"https://draftin.com:443/images/13716?token=GqHqPaQXg8bBdfiJ4KDWHSuTbtLRT-ttXiR69Lt3Zq-BZbXpXhZJuFpaPtyiNfQNIGgzJvWtKSdVAoG_W8L_7-s\" width=\"500\" height=\"500\" /><p class=\"wp-caption-text\">Some sort of Venetian bridge</p></div>\n<p>This is a story of idiocy, longboards lost, more luck than brains, and the internet being full of marvelous people.</p>\n<p>It all started on Friday when I committed my first act of stupidity. I had a Saturday flight to the US from <a class=\"zem_slink\" title=\"Venice and its Lagoon\" href=\"http://whc.unesco.org/en/list/394\" target=\"_blank\" rel=\"unesco\">Venice</a> and I hadn&#8217;t booked a shuttle yet, nor could I convince any of my friends to give me a ride. Naturally.</p>\n<p>Who figures this stuff out more than a day in advance anyway?</p>\n<p>Responsible people do. The only shuttle with room to spare left <a class=\"zem_slink\" title=\"Ljubljana\" href=\"http://maps.google.com/maps?ll=46.0555555556,14.5083333333&amp;spn=0.1,0.1&amp;q=46.0555555556,14.5083333333 (Ljubljana)&amp;t=h\" target=\"_blank\" rel=\"geolocation\">Ljubljana</a> at 2:30am and would get to the airport by 5am &#8230; eight hours before my flight. Wonderful.</p>\n<p>This is when I started frantically begging everyone with a driver&#8217;s license to take me. No cigar.</p>\n<p>So here I am at the <a class=\"zem_slink\" title=\"Venice Marco Polo Airport\" href=\"http://maps.google.com/maps?ll=45.5052777778,12.3519444444&amp;spn=0.03,0.03&amp;q=45.5052777778,12.3519444444 (Venice%20Marco%20Polo%20Airport)&amp;t=h\" target=\"_blank\" rel=\"geolocation\">Marco Polo airport</a> at five in the bloody morning. Half the shops are closed, people slowly shuffling to and fro, everything is a daze of yawns and silent screams for coffee. Nobody is happy to be here.</p>\n<p>My flight was in eight hours. How the hell am I going to kill eight hours in this boring little airport?</p>\n<p>Oh I know! I&#8217;ll go visit Venice. It&#8217;s right nearby and I&#8217;ve never been!</p>\n<p>After an unintended nap on an uncomfortable airport chair, the information desk opened and I could figure out what to do with all my luggage. Large suitcase and a carry-on thingy and a bag and a longboard would be terrible company indeed.</p>\n<p>The charge was six euro per piece. Of <em>course</em> I turned into a cheap bastard and only checked in the two suitcase thingies. Of <em>course</em> I&#8217;m gonna carry the heavy longboard around Venice even though it&#8217;s raining and I&#8217;m wearing the wrong kind of shoes to ride anyway.</p>\n<p>Naturally.</p>\n<p>Act of stupidity number two right there.</p>\n<div style=\"width: 665px\" class=\"wp-caption alignnone\"><img title=\"A seagull\" alt=\"A seagull\" src=\"https://draftin.com:443/images/13719?token=ReaepM-ZH1t7pRS3Eie35WkFBQJsuHFjKyovsVbabmne8jXcUJJ6flxF9f9y3sUMdDupyxyIywmiBl55OrbtrZw\" width=\"655\" height=\"655\" /><p class=\"wp-caption-text\">A seagull</p></div>\n<p>Hours later I step off the bus back at the airport. Wait, where the fuck is my longboard? Frantically jump back on the bus. Not there. Look all around. Nope. Look in my hands again. Nope. I even checked my bag.</p>\n<p>Gone. It was just gone.</p>\n<p>Either left behind at the coffee shop where the second cup of tea for the day and a nice fat sandwich woke me up just enough to almost coherently facebook chat with a cute girl, or at the bus ticket counter, or it grew legs and ran away while I was sleeping on the bus. Gone.</p>\n<p>But there was nothing I could do. The bus round trip would take forty minutes and if I ran and didn&#8217;t get lost it would take me at least ten minutes to get from the bus terminal to the coffee shop.</p>\n<p>Coffee shop was the last time I remembered for certain I had it. A lady bumped into me and I almost broke the pastry window at the counter. BANG!</p>\n<p>And I always do stupid things when I&#8217;m chatting with cute girls. Especially when I hadn&#8217;t slept in a bed for some 30 odd hours.</p>\n<div style=\"width: 501px\" class=\"wp-caption alignnone\"><img title=\"Street\" alt=\"Street\" src=\"https://draftin.com:443/images/13720?token=oRCc0bW6gg3K4Awiqm3sxgGwg2pD9ykQeNsVUDR1R0ye7OXQfkqrxrWpG0a7ElHob87mWzRsGtv1VxIv48f1s9c\" width=\"491\" height=\"655\" /><p class=\"wp-caption-text\">Street</p></div>\n<p>Today, the internet saved my arse.</p>\n<p>Because of my bad check-in habit I could use Foursquare to figure out exactly the coffee shop I was at. Finally <em>that</em> addiction proved useful.</p>\n<p>Of course I suck at using the online Italian phone book, so the number I found was wrong.</p>\n<p>But people from Twitter jumped in and quickly found the right number. One that actually worked. When I called, all I could get from the Chinese waitress was a <em>&#8220;I don&#8217;t understand, solly&#8221;</em>.</p>\n<p>At least it was the same voice who served me. Scoar!</p>\n<p>Great, now to find someone who can actually speak Italian.</p>\n<p>Twitter to the rescue once more. After a bunch of retweets and nail-biting minutes, <a href=\"http://twitter.com/orianagirotto\">@OrianaGirotto</a> raised her hand. She knows Italian <em>and</em> is willing to help.</p>\n<p>The Chinese people knew almost as little Italian as they did English, but <strong>my longboard was there!</strong></p>\n<p>\\o/</p>\n<p>Oh happy days! My shiny new longboard is waiting for me right there in Venice, I just have to go pick it up and somehow explain what I want when I do.</p>\n<p>And people say social network addiction is a bad thing. Pffft.</p>\n<div class=\"zemanta-pixie\" style=\"margin-top: 10px; height: 15px;\"><a class=\"zemanta-pixie-a\" title=\"Enhanced by Zemanta\" href=\"http://www.zemanta.com/?px\"><img class=\"zemanta-pixie-img\" style=\"border: none; float: right;\" alt=\"Enhanced by Zemanta\" src=\"http://img.zemanta.com/zemified_e.png?x-id=7b78b7c3-0ff3-4fe3-b6fc-7fe7c6fedc8d\" /></a></div>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"0464eca8-75d0-5ef4-a383-8935a37029f7"}}