{"data":{"wordpressPost":{"title":"Victims of modern education","content":"<p>\nYesterday I was having a discussion about studying with a classic victim of modern education. She went on and on about how she can&#39;t find the answers to study, that she can&#39;t even find anywhere what kind of questions she must learn to answer. Overall lacking a grasp on what exactly and specifically will be asked of her on a soon-to-come exam.\n</p>\n<p>\nThe real tragedy of this situation is that the more I tried explaining that there <em>are</em> no answer to learn, that there are <em>no</em> questions to find that she must learn the subject at hand and produce the answers on her own, the more she refused and struggled with me that I&#39;m proposing a ludicrous idea that something like that cannot be that she cannot learn that why on earth should she even study when there aren&#39;t any answers to learn anyway.\n</p>\n<p>\nOh sad sad person, and I&#39;m not naming any names here, thou hast fallen into the trap that is modern education. People these days aren&#39;t taught to think anymore, they aren&#39;t taught to study the subject matter and then produce their own interpretations based on what they learned, to answer <strong>real</strong> questions by interpreting what they know and explaining what it means and how it works. They aren&#39;t taught to <strong>understand</strong> but rather to <em>know.</em>\n</p>\n<p>\nAnd thus we come to the actual problem, if people aren&#39;t taught to think and understand anymore but merely to memorise, where does this leave them in the modern world? What use are people who can&#39;t analyze and interpret in the modern world  where google, wikipedia etc. are used for knowing, where any information can be found at the cost of a few clicks, the price of a few seconds of time? What will these people even be good for?\n</p>\n<p>\nThe short answer is, nothing. These people are completely useless to modern society.\n</p>\n<p>\nLuckily however there are still college courses out there that teach thinking and demand autonomy in finding information, analyzing it and deriving new knowledge from old information. Sadly, there are more and more degrees based simply on knowing rather than understanding &#8230;</p>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"cb5c2a95-f21b-5a02-8dd3-25ab7502328b"}}