{"data":{"wordpressPost":{"title":"Why I love Tinder","content":"<p>Yes, I use Tinder. No, I’m not socially inept. At least not completely.</p>\n<p>I have no problem walking up to a person at a bar or club and striking up a conversation. That’s a lie. Clubs and bars are loud, crowded, and I’m too drunk to speak clearly or pay attention to people’s responses. Instead of coming over as a suave gentleman with a fascinating life and just enough mystique to raise eyebrows, I come off as a slobbering fool who just saw a pair of breasts.</p>\n<p>Yes, I have actually gone up to a girl just to say <em>“Your boobs look great!”</em>. No, she didn’t appreciate it. I think the word <em>“Pha!”</em> was involved. Fun times.</p>\n<p>And besides, there just aren’t that many people at a bar. And most of them are men looking for women. I’m not interested in men looking for women. I’m not interested in men looking for men either.</p>\n<p>Bars and clubs, therefore, make for poor hunting grounds.</p>\n<p>Tinder fixes that. For me at least.</p>\n<p>On Tinder you get a near endless stream of potential. The bigger the city you’re in, the more endless the stream of faces for you to judge. To evaluate. To make eyes with.</p>\n<p>That’s all that swiping left or swiping right is. You’re making a snap judgement on whether you like someone. If they make the same positive decision you did, then you’ve just made eyes at each other.</p>\n<p>But there’s no guessing involved. Tinder tells you explicitly that <em>“Yes, you are both marginally interested in each other.”</em></p>\n<p>You never have to come off as a creep. You still <em>can</em>, but the point is you’re going to be given the benefit of the doubt. A lot of my female friends complain that in bars sleazy lame men keep coming up to them and saying stupid shit. The problem is essentially that if you have no chance in hell with me, then I don’t like it when you talk to me.</p>\n<p>On Tinder only people who have a chance in hell even get the chance to talk.</p>\n<p>Win-win.</p>\n<p>Once you do get to chatting, it’s more convenient than talking in person. You don’t want to invest too much time and effort when all you know is that there’s the tiniest fraction of physical attraction. Texting parallelizes nicely, is asynchronous, and doesn’t get too in the way of your life.</p>\n<p>You get to figure out if there’s more here than a casual wink at a bar with even less commitment than at a bar. And it’s cheaper!</p>\n<p>Quick too. Conversations that are ever going to go anywhere should conclude in making date arrangements within a few messages. Usually less than ten. This can take anywhere from half an hour to a few days depending on how bothered to reply both of you can be.</p>\n<p>Again, much less pressure than in a bar where you’re either trying to get them to come home with you immediately. Or you’re trying to get a number and then you’re back to texting anyway to get an actual date.</p>\n<p>Either way, you’re going to invest most of your evening into one or two people, neither of which is likely to lead to anything. Per-person chances are about the same on Tinder as they are in person.</p>\n<p>So if you have to see 100 faces to find 10 people you want to talk to, 1 of which you can get a date with … how many bar nights is that? Compared to some ten minutes here and there on Tinder over, say, three days.</p>\n<p>And once you do go on a Tinder date, you’re all set. You both like each other. You’ve had just enough fun texting to make a connection. You’ve left plenty to talk about in person.</p>\n<p>Tinder is great.</p>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"c1a7393e-9536-52b0-add8-e4317e6fc186"}}