{"data":{"wordpressPost":{"title":"Getting lucky with Bitcoin","content":"<div style=\"width: 389px\" class=\"wp-caption alignnone\"><img title=\"Tasty tasty bitcoins\" alt=\"Tasty tasty bitcoins\" src=\"https://draftin.com:443/images/4138?token=1GvZbnLqnCJ2yhbDVtrfHPdLeIKkvJhpoSBFowymxPcsRe7ViyppTpoQZq9JHv0Q8b1J2jN1zMegGR5tf1sUHVo\" width=\"379\" height=\"226\" /><p class=\"wp-caption-text\">Tasty tasty bitcoins</p></div>\n<p>In April I was implementing <a class=\"zem_slink\" title=\"Bitcoin\" href=\"http://en.wikipedia.org/wiki/Bitcoin\" target=\"_blank\" rel=\"wikipedia\">Bitcoin</a> integration for a client and the more I read about how Bitcoin works, the more I liked it.</p>\n<p>So I decided to buy 200 euro worth of bitcoin on <a class=\"zem_slink\" title=\"Bitstamp\" href=\"http://www.bitstamp.net/\" target=\"_blank\" rel=\"homepage\">Bitstamp</a>. Mostly because I could upload money with a SEPA bank transfer. But also because they&#8217;re from Slovenia and if anything goes wrong, I can knock on their door and ask some questions.</p>\n<p>I had about 2.54 btc to play with.</p>\n<p>Naturally I wanted to do arbitrages and look at graphs all day and try to make money from selling when Bitcoin is high and buying when it&#8217;s low. Staking out the graphs, listening for the beeps a sale makes, twitchy fingers on the sell button &#8230;</p>\n<p>&#8230; I lost 50 euro in two days. Then another 20 or 30 by the end of the week.</p>\n<p>Better idea! I&#8217;ll write an algorithm to do this for me because I suck at it.</p>\n<p>Just before I started working on the algorithm I turned every dollar on the Bitstamp account into Bitcoin. Then promptly got busy with other stuff.</p>\n<h2 id=\"getting-lucky\">Getting lucky</h2>\n<p>Every once in a while I would remember the poor project laying abandoned on my Github account. That I should really get back to it. That I could make a bunch of money if I made a high frequency or even a low frequency <a class=\"zem_slink\" title=\"Algorithmic trading\" href=\"http://en.wikipedia.org/wiki/Algorithmic_trading\" target=\"_blank\" rel=\"wikipedia\">trading algorithm</a> for bitcoins.</p>\n<p>Even just a semiautomatic system that finds the best buy/sell moment after I tell it to do something would be a great help. Oh the endless possibilities and infinite laziness in actually doing something about them.</p>\n<p>But time passed. Bitcoin did its thing. And yesterday morning it hit $588 per coin.</p>\n<p>Wait what?</p>\n<p><em>&#8220;Holy crap! I have to sell&#8221;</em>, I thought to myself. I didn&#8217;t even think about the fact it would continue to grow before it crashes. I didn&#8217;t think about anything.</p>\n<p>I just sold. Bam.</p>\n<p>Some 2.15 bitcoin gone.</p>\n<p>Some $1200 made.</p>\n<p>\\o/</p>\n<p>Pretty good return on investment if you ask me. Put $270 in, get $1200 out a few months later. 400% return, and I just wish I had put more money in. But the hell if I knew this was going to happen.</p>\n<h2 id=\"money-isn't-money-until-it's-your-money\">Money isn&#8217;t money until it&#8217;s your money</h2>\n<p>But money&#8217;s not money until it hits your bank account. As great as Bitstamp is, a bank account it&#8217;s not.</p>\n<p>Withdrawing the money was greeted with a lovely <em>&#8220;Ohai thar, we don&#8217;t believe you&#8217;re a real human. Please verify your account by sending government issued ID and proof of residence.&#8221;</em></p>\n<p>Didn&#8217;t need that to <em>take</em> my money did you Bitstamp? Now suddenly it&#8217;s a big deal and I have to jump through hoops.</p>\n<p>But I understand.</p>\n<p>Bitstamp is a money instrument. They might have become more stringent in the last couple of months. As they should. I had to do all of this to get a UK credit card from <a class=\"zem_slink\" title=\"Moneybookers\" href=\"http://www.skrill.com/\" target=\"_blank\" rel=\"homepage\">Skrill</a> as well.</p>\n<p>Sent files through their form. No email confirmation that I sent the info, just account status changing from &#8220;UNVERIFIED&#8221; to &#8220;PENDING&#8221;. No estimate how long it would take.</p>\n<p><em>sigh</em></p>\n<p>Bitstamp, you are not being very serious right now.</p>\n<p>Today I go to check up on my application and bask in the glory of that boldened $1200 figure staring at me from the screen.</p>\n<p>Nope. Get a scary <em>&#8220;We are fairly certain you are not a real person&#8221;</em> notice. Right from their cloud hosting too!</p>\n<p>Bitstamp going through a <a class=\"zem_slink\" title=\"Denial-of-service attack\" href=\"http://en.wikipedia.org/wiki/Denial-of-service_attack\" target=\"_blank\" rel=\"wikipedia\">DDoS attack</a> of some sort. Or just being down. Or they don&#8217;t like me anymore. They came back online while I was writing this post, but man was that scary.</p>\n<p>Funny how attached you get to money that isn&#8217;t even your yet.</p>\n<div class=\"zemanta-pixie\" style=\"margin-top: 10px; height: 15px;\"><a class=\"zemanta-pixie-a\" title=\"Enhanced by Zemanta\" href=\"http://www.zemanta.com/?px\"><img class=\"zemanta-pixie-img\" style=\"border: none; float: right;\" alt=\"Enhanced by Zemanta\" src=\"http://img.zemanta.com/zemified_e.png?x-id=0419db4e-9609-4f13-a0a4-4786ce876c0a\" /></a></div>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"446a8fa2-52e9-5034-bccf-6b443cf1ab48"}}