{"data":{"wordpressPost":{"title":"Dear tech companies, this is not how you hire engineers","content":"<blockquote><p>Need girl. 170cm, blonde, 34D.</p>\n<p>Must love discussing astrophysics, philosophy, and mobile startups.</p>\n<p>Opinions on node.js vs. io.js a plus.</p>\n<p>4 year degree or higher.</p>\n<p>Must enjoy fast cars, watching Netflix, and should understand why sprinklers have to be off at 3:32am every third Tuesday of the month.</p>\n<p>Dr. Who appreciation a plus. Will get free dinners, walks on the beach, and skydiving lessons in return.</p>\n<p>Subsidised travel when appropriate.</p></blockquote>\n<p>Ridiculous, right?</p>\n<p>And yet, that&#8217;s what a lot job ads for software engineers look like. The better ones will turn it around and take the <em>We offer more than we take!</em> approach.</p>\n<p>They highlight the perks and attach a strong brand. Deep down, they&#8217;re the same.</p>\n<p>The more proactive companies hire legions of recruiters to send generic emails to everyone with a pulse. Some better some worse.</p>\n<p>But here&#8217;s the thing &#8211; software engineering jobs are a total seller&#8217;s market right now.</p>\n<p>Every engineer you&#8217;d want to hire has already got a job. Or their own company. Or they&#8217;re still in school.</p>\n<p>You might get lucky with those still in school. They&#8217;re juniors and don&#8217;t know much about the industry. But you will scare them away with that list of requirements. And you&#8217;d have to train them anyway.</p>\n<p>Those with a company &#8230; well you can get those. But only when their company isn&#8217;t doing well. Or has just folded. You have to get lucky to catch them on a downturn &#8211; when they&#8217;re disheartened.</p>\n<p>But if they&#8217;ve got a VC funded company, you will have to acquihire. Those are expensive.</p>\n<p>So you&#8217;re left with engineers who currently have a job.</p>\n<p>Those fall into two categories. Employed and happy, and employed and unhappy.</p>\n<p>You&#8217;re going to be hard pressed to convince somebody who&#8217;s already happy. Changing one&#8217;s entire work environment is stressful so people avoid it. And they will have little job satisfaction before they fully grok your codebase.</p>\n<p>Your offer will have to be absolutely <em>stellar</em>.</p>\n<p>The kind of offer I&#8217;m talking about usually isn&#8217;t.</p>\n<p>Now, there&#8217;s the engineers who are unhappy in their current job. These will be easier to convince, but it&#8217;s unlikely they&#8217;re going to see your ad. And even then, they are still coming from a position of strength. Disregarding you doesn&#8217;t cost them a thing.</p>\n<p>The upside will still have to be pretty good.</p>\n<p>What I wonder is, <em>why</em> do you look for engineers like this? By scaring away the only people who might sign up on their own?</p>\n<p>According to a measure I&#8217;ve heard once (probably depends on many factors), a new full-time engineer adds some $1,000,000 to your company&#8217;s sell value. They&#8217;re going to cost you some $300,000 over the two or three years they stay with you, and if all goes well, are going to <em>enable</em> your revenue production.</p>\n<p>A few million for sure.</p>\n<p>As a business person, would you look for million dollar clients with a generic <em>&#8220;Have business. Need $1MM in sales. Please apply&#8221;</em> ad?</p>\n<p>Of course you wouldn&#8217;t. You&#8217;d network like mad, ask everyone for leads, take prospective leads to fancy dinners, write personalised proposals, buy expensive gifts. Etc.</p>\n<p>Why don&#8217;t you approach engineers the same way?</p>\n<p>I promise we&#8217;ll take you seriously if you feed us and spend an hour explaining how we can help.</p>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"86862f31-b850-545f-917c-dafbb62813a3"}}