{"data":{"wordpressPost":{"title":"A boutique React &#038; D3v4 workshop – and my first vlog","content":"<div style=\"position:relative;height:0;padding-bottom:56.25%\"><iframe src=\"https://www.youtube.com/embed/zdD-7Jb5XN8?ecver=2\" width=\"640\" height=\"360\" frameborder=\"0\" style=\"position:absolute;width:100%;height:100%;left:0\" allowfullscreen></iframe></div>\n<p>On Saturday –&nbsp;Mar 25th –&nbsp;<a href=\"https://twitter.com/frangel85\">Freddy</a> and I taught a boutique workshop to six magnificent people. We didn&#39;t intend for it to be a boutique workshop, but we learned that 2 weeks is really tight to promote a $400 event.</p>\n<p>And you know what, it was better this way.</p>\n<p>Having six people was great. We could banter and hang out, everyone could get to know everyone, we could help everyone individually if they got stuck. Typing code is a harder problem than you&#39;d think, and finding typos is the hardest.</p>\n<p>I think this was the 6th React &amp; D3 workshop we&#39;ve done, and it was my favorite. We improve the content with each iteration, we get better at teaching, and we get more relaxed.</p>\n<p>You know, I think less than ten is my favorite audience size. When somebody asks a question, we can go on a tangent to answer. With a small class, it&#39;s easy to gauge everyone&#39;s interest, and we can spend more time answering great questions. And because the class is small, people feel more comfortable asking questions.</p>\n<p>With more questions, our workshop becomes better for the audience. We help <em>them</em> and not an abstract version of them.</p>\n<p>That&#39;s why on Saturday people didn&#39;t learn just about React and D3 and building data visualizations. We talked at length about Redux, MobX, and approaches to state management. We talked about setting up a new project (always use <code>create-react-app</code>), strategies to fetch and organize data, and we even broached some deep CompSci topics.</p>\n<p>It was great ?</p>\n<p><strong>My favorite quote of the day was: &quot;I learned a lot&quot;</strong></p>\n<p>But I didn&#39;t get it on camera. ?</p>\n<p>You see, I wanted to give vlogging a shot. I <em>want</em> to try my hand at vlogging. I think it&#39;s going to make my coding videos more interesting.</p>\n<p>And holy shit is vlogging harder than it looks!</p>\n<p>You look at vlogs and you think <em>&quot;Oh, it&#39;s just idiots running around with cameras saying random things&quot;</em> and yes, that might be the case on Snapchat, maybe.</p>\n<p>But to make a real vlog, the kind that stays on YouTube forever more… damn.</p>\n<p>Here is a list of things you have to always keep in mind. I didn&#39;t think about all of these, and now I know I should.</p>\n<ol>\n<li>The camera should point at person talking, always</li>\n<li><em>You</em> should spend more time on camera</li>\n<li>Think more selfies with other people, less camera pointing away from you at other people</li>\n<li>When a scene transition happens, you have to narrate it</li>\n<li>Said narration should happen on camera, not behind the camera</li>\n<li>Mind the light. People&#39;s faces look dark real quick</li>\n<li>Background noise is louder than you think</li>\n<li>Camera on automatic aperture and shutter speed never makes the perfect decision</li>\n<li>You don&#39;t have time for manual aperture and shutter speed</li>\n<li>You think autofocus found your face, but are you <em>sure</em> autofocus found your face?</li>\n<li>Don&#39;t configure your mic manually. Your settings are wrong because you set them up in a quiet environment.</li>\n<li>Mic settings do not travel well</li>\n<li>It&#39;s easy to take long shots of things that don&#39;t drive the story</li>\n<li>Those long shots take a long time to edit and cut down</li>\n</ol>\n<p>Basically, I should improve my camerawork and my narrating.</p>\n<p>But the workshop was great. Can&#39;t wait to do the one in Chicago in May. We already know how we&#39;re gonna make it better.</p>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"46b076e2-dc51-529a-a418-6818934d0082"}}