{"data":{"wordpressPost":{"title":"I tried weed for performance enhancement and here&#8217;s what I found","content":"<p>This is not your high school weed experience anymore, my friend. Wow 😱</p>\n<img src=\"https://swizec.com/blog/wp-content/uploads/2018/06/Image-from-iOS-1024x768.jpg\" alt=\"\" class=\"alignnone size-large wp-image-8489\" srcset=\"https://swizec.com/blog/wp-content/uploads/2018/06/Image-from-iOS-1024x768.jpg 1024w, https://swizec.com/blog/wp-content/uploads/2018/06/Image-from-iOS-300x225.jpg 300w, https://swizec.com/blog/wp-content/uploads/2018/06/Image-from-iOS-768x576.jpg 768w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" />\n<p>Here&#39;s what weed looked like in high school:</p>\n<ol>\n<li>You have that one classmate who knows how and where to get &quot;large&quot; amounts of weed; he&#39;s everyone&#39;s dealer.</li>\n<li>You and a couple of buddies scrounge together some money, like ten or twenty bucks.</li>\n<li>You tell that one classmate that you would like to purchase an entire gram of weed. Two grams if you&#39;re feeling rich.</li>\n<li>A few days later, before school, or after school, or at recess, you exchange your $10 for 1g of green stuff.</li>\n<li>You carefully inspect the green stuff for any traces of sand or other shit that makes it heavier than it needs to be. Make sure there&#39;s no twigs that would break your papers. Yes, people cut weed.</li>\n<li>You buy a bunch of rolling tobacco and some papers.</li>\n<li>You fumble around and make a joint. Tobacco with a little bit of weed because that 1 gram has to last you 4 or 5 joints. You ain&#39;t made of money. </li>\n<li>You smoke and wheeze and cough and god knows what kind of shit you bought.</li>\n<li>Every time you wonder: <em>&quot;Is this the one time he sold me sprayed weed and I&#39;m gonna have an insane crazy high?&quot;</em></li>\n<li>You are stoned out of your mind. Knees heavy, arms spaghetti, you eat everything in sight, and you can&#39;t think straight to save your life.</li>\n</ol>\n<p>Stoner comedies are the best. Going back to school after… that was not a good idea the few times I tried.</p>\n<p>Don&#39;t smoke weed during recess. It doesn&#39;t work. Especially if you have a surprise English test you forgot about right after. Heh 😅</p>\n<h2>The modern weed experience 👌</h2>\n<p>Compare that to weed in 2018.</p>\n<ol>\n<li>It&#39;s legal, at least where I am.</li>\n<li>You open an app on your phone. I used <a href=\"https://www.eaze.com/menu\">Eaze</a>.</li>\n<li>You send a photo of your passport so they can verify your age. Gotta be over 21</li>\n<li>There is a fine selection of different marijuana strains, different THC levels, CBD levels and every product comes with a helpful table that says <em>&quot;Yo, you gonna be hungry!&quot;</em> or <em>&quot;This will help you focus&quot;</em> and shows you the different tradeoffs behind every joint.</li>\n<li>You order and wait.</li>\n<li>An hour later, the most relaxed delivery person I have ever seen in my life shows up, checks your ID, and hands you a plain white bag.</li>\n<li>Inside is your order. Neatly packaged, nicely pre-rolled, well-labeled.</li>\n<li>No tobacco, no shit weed, no surprises. You know exactly what you&#39;re getting and the experience you&#39;re gonna have.</li>\n</ol>\n<p>I got a pair of Indica joints and a pair of Sativa. Indica is supposed to help you relax, loosen up your muscles, and go to bed. Sativa is meant to give you a little euphoria and a lot of focus.</p>\n<h2>The result</h2>\n<p>I finished about half a joint each time. Then I got bored sitting outside by myself.</p>\n<p>Weed just isn&#39;t as much fun on your own as it is when you&#39;re sneaking around with your best friend at a children&#39;s playground late at night and giggling like maniacs every time you think a passerby spotted you.</p>\n<p>Plus my spidey senses were saying I&#39;d had enough. You can&#39;t really tell how high you are until you stand up. Funny, that.</p>\n<p>So, the first night I tried an indica strain.</p>\n<p>The indica worked as advertised. I was relaxed. I was what you would call stoned. Somehow, I wasn&#39;t too hungry. But I spent an hour deciding what to watch before I gave up and went to bed.</p>\n<p>As soon as I put the laptop away, I was asleep and I slept like the dead for just the right amount of hours. In the morning, I woke up refreshed and feeling great.</p>\n<p>Then I went on a 40km run, and the weed had done exactly what I wanted. My muscles were loose and relaxed. I can&#39;t remember the last time I felt so un-sore when waking up.</p>\n<p>Run went well. Indica worked.</p>\n<blockquote class=\"instagram-media\" data-instgrm-captioned data-instgrm-permalink=\"https://www.instagram.com/p/Bka1FhQF9S-/\" data-instgrm-version=\"8\" style=\" background:#FFF; border:0; border-radius:3px; box-shadow:0 0 1px 0 rgba(0,0,0,0.5),0 1px 10px 0 rgba(0,0,0,0.15); margin: 1px; max-width:580px; padding:0; width:99.375%; width:-webkit-calc(100% - 2px); width:calc(100% - 2px);\">\n<div style=\"padding:8px;\">\n<div style=\" background:#F8F8F8; line-height:0; margin-top:40px; padding:37.5% 0; text-align:center; width:100%;\">\n<div style=\" background:url(data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAACwAAAAsCAMAAAApWqozAAAABGdBTUEAALGPC/xhBQAAAAFzUkdCAK7OHOkAAAAMUExURczMzPf399fX1+bm5mzY9AMAAADiSURBVDjLvZXbEsMgCES5/P8/t9FuRVCRmU73JWlzosgSIIZURCjo/ad+EQJJB4Hv8BFt+IDpQoCx1wjOSBFhh2XssxEIYn3ulI/6MNReE07UIWJEv8UEOWDS88LY97kqyTliJKKtuYBbruAyVh5wOHiXmpi5we58Ek028czwyuQdLKPG1Bkb4NnM+VeAnfHqn1k4+GPT6uGQcvu2h2OVuIf/gWUFyy8OWEpdyZSa3aVCqpVoVvzZZ2VTnn2wU8qzVjDDetO90GSy9mVLqtgYSy231MxrY6I2gGqjrTY0L8fxCxfCBbhWrsYYAAAAAElFTkSuQmCC); display:block; height:44px; margin:0 auto -44px; position:relative; top:-22px; width:44px;\"></div>\n</div>\n<p style=\" margin:8px 0 0 0; padding:0 4px;\"> <a href=\"https://www.instagram.com/p/Bka1FhQF9S-/\" style=\" color:#000; font-family:Arial,sans-serif; font-size:14px; font-style:normal; font-weight:normal; line-height:17px; text-decoration:none; word-wrap:break-word;\" target=\"_blank\">Ok got the stamina down, now I got 3 weeks to work on the speed 🏃‍♀️</a></p>\n<p style=\" color:#c9c8cd; font-family:Arial,sans-serif; font-size:14px; line-height:17px; margin-bottom:0; margin-top:8px; overflow:hidden; padding:8px 0 7px; text-align:center; text-overflow:ellipsis; white-space:nowrap;\">A post shared by <a href=\"https://www.instagram.com/swizec/\" style=\" color:#c9c8cd; font-family:Arial,sans-serif; font-size:14px; font-style:normal; font-weight:normal; line-height:17px;\" target=\"_blank\"> Swizec Teller</a> (@swizec) on <time style=\" font-family:Arial,sans-serif; font-size:14px; line-height:17px;\" datetime=\"2018-06-24T19:30:34+00:00\">Jun 24, 2018 at 12:30pm PDT</time></p>\n</div>\n</blockquote>\n<p><script async defer src=\"//www.instagram.com/embed.js\"></script></p>\n<p>The second night, on Sunday, I tried a sativa strain.</p>\n<p>Sativa is meant to give you laser focus. And it did. It gave me so much focus that it was crazy. </p>\n<p>Anything I looked at, I was pulled into with complete clarity and total focus. Look at a chatroom? Nothing else exists in the world. Look at a productive task? Nothing else exists in the world.</p>\n<p>It was a strange experience. I don&#39;t remember ever being focused like that before. Anything you start doing becomes the only thing in the world and that internal pull to stop doing stuff and go do something else… it just goes away.</p>\n<p>But if something <em>does</em> distract you, you&#39;re in trouble. You switch focus, and you won&#39;t come back on your own.</p>\n<p>So that was kind of weird. I had intense focus, but it was switchable focus. </p>\n<p>Like pushing a marble over a series of gravitational wells. Falls into a well. Takes a lot of effort to push over the crest to the next one, then falls right in and stays there.</p>\n<p>It&#39;s hard to explain. You have to try it to get it.</p>\n<h2>Try again?</h2>\n<p>I think I will, but with vaping. Looks more civilized. 😇</p>\n<p>Indica works great before long runs. Helps with how sore I feel.</p>\n<p>Sativa for focus… needs more testing. Or maybe I need practice with what it feels like to have focused attention.</p>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"55bfc662-281f-53d7-86da-64239a3eb784"}}