{"data":{"wordpressPost":{"title":"The underwear your girlfriend really wants you to wear","content":"<p><a href=\"http://blog.mozganostroj.com/\" target=\"_blank\">Sparkica</a> wrote in a recent blogpost <a href=\"http://blog.mozganostroj.com/2008/11/20/komarka-stolkla-vampirja/\" target=\"_blank\">about a sexy man in minimalistic loose underwear</a>. Initially I only shrugged it off as interesting, but then it got me thinking about just how often women talk about men&#8217;s underwear. You&#8217;ll often hear a passing remark here and there, often they&#8217;ll even give comments on your underwear flat out &#8211; especially if it&#8217;s &#8220;that kind&#8221; of relationship.</p>\n<p>What&#8217;s most interesting to note here is that women seem to like a lot of different underwear as along as it&#8217;s on the right body. They like small and loose, like sparkica, or not so small and tight, because it supposedly makes balls look better, not sure, some even like small and tight. But the majority, like a classmate I recently asked, seem to like regular old boxers best.</p>\n<p>This means of course that if you&#8217;re a real man you already have what it takes in your trousers &#8211; boxers. Sure your body might not quite make the cut or anything, but at least you can&#8217;t go too wrong with regular boxers, most of them will like it. Strangely enough it&#8217;s a completely different situation with men. We like thongs and other tight, revealing underwear, whereas girls don&#8217;t really like wearing such all that much. Most prefer nice comfortable granny pants, at least when they&#8217;re not in a social situation.</p>\n<p>But most of all we must notice that women talk about men&#8217;s <em>underwear</em> not what&#8217;s in it. This tells us that they want you to keep it on, so no matter what you&#8217;re wearing, just remember to keep it on. Nobody likes those pesky one-eyed trouser snakes.</p>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"0784dafc-27a9-5af2-a9c3-cbb2634ac324"}}