{"data":{"wordpressPost":{"title":"Backbone → React: it&#8217;s a people problem after all ?","content":"<p>The Big Scary Refactor™, turning a largish, hard-to-manage Backbone app into an easier to manage React app… it got off to a <a href=\"https://swizec.com/blog/backbone-react-step-1/swizec/7042\">great start yesterday</a>. Today, not so much.</p>\n<p>First of all, I realized that our problem isn&#8217;t Backbone. The problem is that our UI is not a function of state. It&#8217;s an expression of state <em>and a sequence of user actions</em>.</p>\n<blockquote class=\"twitter-tweet\" data-lang=\"en\">\n<p lang=\"en\" dir=\"ltr\">Starting to realize our problem isn&#39;t Backbone. Our problem is that I didn&#39;t enforce the UI-as-expression-of-data rule well enough.</p>\n<p>&mdash; Swizec (@Swizec) <a href=\"https://twitter.com/Swizec/status/778300885017296896\">September 20, 2016</a></p></blockquote>\n<p><script async src=\"//platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></p>\n<p>To give you a simple example, we use this pattern a lot:</p>\n<pre lang=\"javascript\">\r\nclass Thing extends Backbone.View {\r\n\tconstructor() {\r\n\t\tthis.events {\r\n\t\t\t\"click button\": \"toggleActive\"\r\n\t\t}\r\n\t}\r\n\t\r\n\ttoggleActive() {\r\n\t\tif (checkSomething) {\r\n\t\t\tthis.$('button').addClass('active');\r\n\t\t}else{\r\n\t\t\tthis.$('button').removeClass('active');\r\n\t\t}\r\n\t}\r\n}\r\n</pre>\n<p>This is a trivial Backbone view. It listens for a <code>click</code> event on a <code>&lt;button&gt;</code>. When a click happens, it either adds or removes an <code>active</code> class on that button.</p>\n<p>Our real views do the same sort of thing, but on a grander scale. It might seem harmless enough, but if your code has this pattern, you can&#8217;t reliably wrap Backbone views in React components. You&#8217;d have to replay all user interaction on every re-render.</p>\n<p>That&#8217;s a no-go.</p>\n<p>A better approach, which we follow most of the time (but of course not all of the time), is to move that <code>checkSomething</code> into the View&#8217;s backing Model. Something like this:</p>\n<pre lang=\"javascript\">\r\nclass Thing extends Backbone.View {\r\n\tconstructor() {\r\n\t\tthis.events {\r\n\t\t\t\"click button\": \"toggleActive\"\r\n\t\t}\r\n\t\tthis.model = new Backbone.Model({active: false});\r\n\t\tthis.listenTo(this.model, 'change', this.render);\r\n\t\t\r\n\t\tthis.template = Handlebars.compile('<button class=\"{{#if active}}active{{/if}}\">Button</button>');\r\n\t}\r\n\t\r\n\ttoggleActive() {\r\n\t\tthis.model.set('active', !this.model.get('active'));\r\n\t}\r\n\t\r\n\trender() {\r\n\t\tthis.$el.html(this.template(this.model.attributes));\r\n\t}\r\n}\r\n</pre>\n<p>Now the UI is an expression of state and user actions manipulate that state instead of the UI. You can re-render as much as you want, and your UI will look correct.</p>\n<hr />\n<p>But why re-render in the first place? Because it&#8217;s the easiest way to deal with data changes from above. </p>\n<p>We&#8217;re moving towards a modern unidirectional data flow architecture where application state lives in a central Redux or MobX store. Right now, it&#8217;s scattered through a bunch of Backbone Models living inside each View individually. Then they interact.</p>\n<p>It&#8217;s a mess. Did I mention we have untraceable heisenbugs? Many.</p>\n<p>If you want unidirectional, then The Central Store is your single source of truth. That means that when new state comes down from the top, you follow.</p>\n<p>With a React component, your props change, React calls <code>render()</code>, and your UI updates.</p>\n<p>When your React component is just a thin wrapper for a Backbone View, well… then you have a choice. Update the view&#8217;s internal model and hope for the best, or throw the view away and render a new one… and once again hope for the best.</p>\n<p>There&#8217;s a lot of hoping for the best, but I think the &#8220;throw away and re-render&#8221; is going to be easier to deal with in the long run. It’s also better when we go through the process and all those child Backbone Views eventually become proper React components.</p>\n<p>Replaying user interaction to <em>exactly</em> match UI on re-render? Yeah, fuck that. That&#8217;s not gonna work with either strategy. ?</p>\n<p>Ok, so we have our first tradeoff: To avoid UI staleness, we&#8217;re going to have UI that forgets user interactions.</p>\n<p>Such is life ¯\\_(ツ)_/¯ </p>\n<p>Tomorrow, I&#8217;ll show you why I think MobX can&#8217;t work in our situation, but Redux might.</p>\n<p>PS: If you wanna help, we&#8217;re hiring. Ping me.</p>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"1abce38a-717d-5bb8-aa29-1defd54170dd"}}