{"data":{"wordpressPost":{"title":"&#8220;Startup rollercoaster&#8221; isn&#8217;t even the half of it","content":"<p>A year ago, to the day, I was sitting in <a href=\"http://en.wikipedia.org/wiki/Om_Malik\" target=\"_blank\">Om Malik</a>&#8216;s office in <a class=\"zem_slink\" title=\"San Francisco\" href=\"http://maps.google.com/maps?ll=37.7793,-122.4192&amp;spn=0.1,0.1&amp;q=37.7793,-122.4192 (San%20Francisco)&amp;t=h\" rel=\"geolocation\">San Francisco</a>. We were discussing a possible writeup about Preona/<a href=\"http://yukaii.com/web/lazyreadr/\" target=\"_blank\">LazyReadr</a> on <a class=\"zem_slink\" title=\"Om Malik\" href=\"http://www.gigaom.com\" rel=\"homepage\">GigaOM</a>.</p>\n<div style=\"width: 310px\" class=\"wp-caption alignright\"><img class=\" \" title=\"postme.me 2nd batch\" src=\"http://swizec.com/blog/wp-content/uploads/2011/10/tumblr_ltmfltFSp91qekjngo1_500.jpg\" alt=\"\" width=\"300\" height=\"300\" /><p class=\"wp-caption-text\">postme.me 2nd batch</p></div>\n<p>I know it was exactly a year ago because I remember saying something like <em>&#8220;Oh I&#8217;m 23 &#8230; wait, I&#8217;m 23 TODAY!&#8221;</em> when he asked how old I was.</p>\n<p>About a year before I set out on a voyage that would cement my decision to do <a class=\"zem_slink\" title=\"Startup company\" href=\"http://en.wikipedia.org/wiki/Startup_company\" rel=\"wikipedia\">startups</a>. With the help of some ultra early investorvisers (adviser+investor) I founded my first company and plunged off the deep end; fully expecting to build the plane before my head smashed into the jagged rocks below.</p>\n<p>I&#8217;d been working practically full time on <a class=\"zem_slink\" title=\"Twitulater\" href=\"http://twitulater.com/\" rel=\"homepage\">Twitulater</a> beforehand, but this was different, this evolved out of that original nugget and I remember thinking to myself &#8220;<em>Shit just got real brah!&#8221;</em></p>\n<p>And it did, it did get real! I was ready to face anything anyone would throw at me. People were saying it&#8217;s not all fun and games, that startup life is more like a roller coaster. Sure, it was difficult, there were hard times building a product, getting our first government grant &#8230; rebuilding the product again from scratch over that summer because <a class=\"zem_slink\" title=\"iPad\" href=\"http://www.apple.com/ipad/\" rel=\"homepage\">the iPad</a> came out and completely changed the landscape &#8230;</p>\n<p>Those two weeks last October &#8211; looking for funding in the US, mingling with the <a class=\"zem_slink\" title=\"Y Combinator\" href=\"http://www.ycombinator.com\" rel=\"homepage\">YC</a> crowd, going to awesome conferences &#8230; I felt like I was on top of the world! <em>&#8220;Everything I touch turns into gold!&#8221;, </em>I thought. Hell, out of all the seasoned veterans in that first <a href=\"http://www.brezmejnik.si/\" target=\"_blank\">Brezmejnik</a> batch we got the furthest with investors. Us, the young grasshoppers who but a month earlier looked like they wouldn&#8217;t even have anything to pitch, we got to a verbal &#8220;yes&#8221; to participate in a round if we can pull it together.</p>\n<h2>A lot has changed since then &#8230;</h2>\n<p>We did not, in fact, manage to pull together a round. The fact I hadn&#8217;t been making any money (full time startup plus a full time student, yeah, it doesn&#8217;t work) eventually caught up with me. Around December the first rat fled the ship. Just up and stopped responding to emails.</p>\n<div class=\"zemanta-img zemanta-action-dragged\" style=\"margin: 1em; display: block;\">\n<div style=\"width: 310px\" class=\"wp-caption alignleft\"><a href=\"http://en.wikipedia.org/wiki/File:RHP-Rollercoaster.jpg\"><img class=\"zemanta-img-configured\" title=\"Red House Painters (Rollercoaster)\" src=\"http://swizec.com/blog/wp-content/uploads/2011/10/300px-RHP-Rollercoaster1.jpg\" alt=\"Red House Painters (Rollercoaster)\" width=\"300\" height=\"295\" /></a><p class=\"wp-caption-text\">Image via Wikipedia</p></div>\n</div>\n<p>Then the fighting between cofounders started. It wouldn&#8217;t even be that bad if there was actual fighting. It was one of those quiet disputes that smack you when you aren&#8217;t looking.</p>\n<p>At some point we stopped talking for three weeks.</p>\n<p><em>&#8220;The product will save us!&#8221;</em>, I thought, <em>&#8220;I need to make the fucking product! I&#8217;ll finish it myself if I have to!&#8221;</em></p>\n<p>And I did try, for that month, month and a half, I was doing all the frontend and backend programming and trying to figure out where we could muster some money. Instead, I should be acting like a CEO and hiring people. <em>Actually</em> finding money. Realising the product cannot be finished before our negative runway becomes more than <a href=\"http://twitter.com/skatey\" target=\"_blank\">@skatey</a> can keep up with doing consulting.</p>\n<p>Around February Skatey and our investorvisers decided that the shit has gone far enough. Swizec is an idiot, he can&#8217;t code for shit, he sucks at getting money, why do we even need him? Plus he isn&#8217;t paying off that debt arising from company expenses he owed to Skatey.</p>\n<p>How could I? I was pulling 80+ hour workweeks trying to keep up with all the coding and the exam season was upon me. I had that pesky school to finish!</p>\n<h2>They kicked me out.</h2>\n<p>I was able to negotiate the nullification of my debt to Skatey, but this still left me about 2000 euro in debt.</p>\n<p>2000 euro may not sound like a lot, but out of all the work the previous year I think about 800 euro made it into my pocket &#8211; I bought a phone and some clothes. Everything else went into the startup either directly or by keeping me from dying of starvation.</p>\n<p>What&#8217;s more, the debt was due in four months &#8230; I was practically bankrupt. If it wasn&#8217;t for the pasta investment from my parents I&#8217;d be forced to live on the street.</p>\n<p>Here I was, 23, bankrupt, startup up in flames, the shredded remains of a guy who once thought he could take on the world and win.</p>\n<p>I was fed up with my life and myself. I was just about ready to pretty much check out &#8230; if not literally then at least figuratively, kill this blog, kill my twitter account, everything, just get away from the world. I did the next best thing and broke up with my girlfriend of three years. In fact I cheated on her and <em>then</em> broke up with her.</p>\n<p>Not the proudest moment of my life.</p>\n<h2>It got better</h2>\n<p>Around that time I also launched <a href=\"http://hipstervision.org\" target=\"_blank\">HipsterVision</a> &#8230; a fun little project to put me in a better mood. It even got a decent amount of traffic and if I remember correctly at some point got picked up by the <a class=\"zem_slink\" title=\"BBC\" href=\"http://www.bbc.co.uk/\" rel=\"homepage\">BBC</a> on a show about hot new tools online.</p>\n<p>But I had no energy to sustain growth. No ideas on how to get more traffic. No brainpower left to even contemplate making anything serious out of that project. Most of all, I simply couldn&#8217;t afford to work on anything other than quickly getting some job that will enable me to pay off my debts by June, the deadline.</p>\n<p>It was April.</p>\n<div class=\"zemanta-img zemanta-action-dragged\" style=\"margin: 1em; display: block;\">\n<div style=\"width: 250px\" class=\"wp-caption alignright\"><a href=\"http://www.flickr.com/photos/11552030@N00/152458957\"><img class=\"zemanta-img-configured\" title=\"Good Times\" src=\"http://swizec.com/blog/wp-content/uploads/2011/10/152458957_9d68be3827_m1.jpg\" alt=\"Good Times\" width=\"240\" height=\"180\" /></a><p class=\"wp-caption-text\">Image by Matt Niemi via Flickr</p></div>\n</div>\n<p>I did in fact manage to find such a job. But I was miserable, there was nothing about Slovenia that could cheer me up, I had to get away somehow, anyhow, whatever way possible. I wanted to go to the US over the summer, if push comes to shove, I&#8217;ll go there without money and find a freelancing gig.</p>\n<p>A month later the offer from <a href=\"http://doublerecall.com/#top\" target=\"_blank\">DoubleRecall</a> came that I can join them in <a class=\"zem_slink\" title=\"Palo Alto, California\" href=\"http://maps.google.com/maps?ll=37.4291666667,-122.138055556&amp;spn=0.1,0.1&amp;q=37.4291666667,-122.138055556 (Palo%20Alto%2C%20California)&amp;t=h\" rel=\"geolocation\">Palo Alto</a> during their YC experience.</p>\n<p>I ditched my job. Just stopped responding to emails.</p>\n<p>Another not very proud moment in my life. It was a soul sucking lucrative job with a bad culture fit. But ditching them like that wasn&#8217;t a very nice thing to do.</p>\n<p>But I paid off my debt by June. Nobody would come knocking at the door to take my socks!</p>\n<h2>It is now October.</h2>\n<p>I&#8217;m not quite at the same heights I was a year ago. The <a title=\"I suck at [formal] education or does education suck?\" href=\"http://swizec.com/blog/i-suck-at-formal-education-or-does-education-suck/swizec/2564\" target=\"_blank\">exam fiasco</a> that was September didn&#8217;t do much for my mood, but at least I&#8217;m not in too much shit financially. Two weeks ago I launched <a href=\"http://postme.me\" target=\"_blank\">Postme.me</a>, which has so far brought in infinitely more profits straight from users than all my previous projects combined. The Startup included.</p>\n<p>Actually I think I&#8217;m doing pretty great right now.</p>\n<p><a href=\"http://postme.me\" target=\"_blank\">Postme.me</a> is doing well and getting better, this blog is getting increasingly more traffic, I have two freelancing offers from cool startups in San Francisco on my plate (gonna have to pick), and I&#8217;m well set to graduate by next September and free myself geographically.</p>\n<p>Definitely the hardest year of my life, but I wouldn&#8217;t have it any other way.</p>\n<h6 class=\"zemanta-related-title\" style=\"font-size: 1em;\">Related articles</h6>\n<ul class=\"zemanta-article-ul\">\n<li class=\"zemanta-article-ul-li\"><a href=\"http://swizec.com/blog/i-couldnt-get-into-yc-so-i-joined-a-startup-that-did/swizec/1855\">I couldn&#8217;t get into YC so I joined a startup that did</a> (swizec.com)</li>\n<li class=\"zemanta-article-ul-li\"><a href=\"http://bijansabet.com/post/11734181174/there-are-so-many-options-now-for-fledgling-startups\">There are so many options now for fledgling startups now for seed investment and advice &#8211; YCombinators, Tech Stars, 500 Startups, etc. Should one pursue them all? Is one better than the rest? Does geography of where one is matter? Thanks in advance for</a> (bijansabet.com)</li>\n<li class=\"zemanta-article-ul-li\"><a href=\"http://davidcummings.org/2011/10/24/the-previously-strong-startup-employee-that-is-no-longer-effective/\">The Previously Strong Startup Employee That Is No Longer Effective</a> (davidcummings.org)</li>\n<li class=\"zemanta-article-ul-li\"><a href=\"http://swizec.com/blog/doing-a-startup-taught-me-the-value-of-staying-in-school/swizec/1819\">Doing a startup taught me the value of staying in school</a> (swizec.com)</li>\n</ul>\n<div class=\"zemanta-pixie\" style=\"margin-top: 10px; height: 15px;\"><a class=\"zemanta-pixie-a\" title=\"Enhanced by Zemanta\" href=\"http://www.zemanta.com/\"><img class=\"zemanta-pixie-img\" style=\"border: none; float: right;\" src=\"http://img.zemanta.com/zemified_e.png?x-id=cb3d124d-9196-4388-81ed-61579ca76ce8\" alt=\"Enhanced by Zemanta\" /></a></div>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"65df9c29-d018-5049-9743-3c496fdff0a1"}}