{"data":{"wordpressPost":{"title":"Follow up to The most pleasant job interview I have ever had","content":"<img src=\"https://www.filepicker.io/api/file/9HlBZ5SbQGeZE0urzi2s\" alt=\"\" />\n<p><em>&#8220;Hey mum, I&#8217;m going to Canada in September to work for <a class=\"zem_slink\" title=\"Shopify\" href=\"http://shopify.com\" rel=\"homepage\" target=\"_blank\">Shopify</a>.&#8221;</em></p>\n<p><em>&#8220;Yeah I know, why did you take a month to realize that?&#8221;</em></p>\n<p>Just over a month ago I described my experience interviewing with Shopify as <a href=\"http://swizec.com/blog/the-most-pleasant-job-interview-i-have-ever-had/swizec/6121\">the most pleasant job interview I have ever had</a>.</p>\n<p>Just three days after the interview I got an offer, but fussed over the decision for a month. Originally, to give some other opportunities a fair chance, later because some new opportunities showed up &#8230;</p>\n<p>Seriously, what are the chances for a client to sell his company to a huge investment bank and wanting to bring you on board juuust as you&#8217;re thinking about moving to Canada? Crazy. I didn&#8217;t take that one because, you know, <em>bank</em>. Huge corporation. Not really my style &#8230; at least not for that kind of money.</p>\n<p>Remember kids, if you&#8217;re going to sell your soul, sell it well.</p>\n<p>I loved Shopify when I was there, it was the most fun and enjoyable looking environment I have ever seen. If I had to decide there and then, I&#8217;d go for it at the drop of a hat. But the more I thought about it, the more my fear of commitment acted up.</p>\n<p>The main reason I freelance is the pace of switching whole technology stacks every few months. But I also have <em>a lot</em> of free time to pursue my own stuff. Deadlines for a book you say? No problem, ten billable days in a month is enough.</p>\n<p>Think I won&#8217;t be able to do that anymore.</p>\n<p>Oh, you like waking up at 9am, taking an hour to exercise and then two hours for writing and an hour for lunch and <em>then</em> get to work work? No problem, you&#8217;re more productive coding-wise in the afternoon/evening anyway.</p>\n<p>I have a suspicion I won&#8217;t be able to do that anymore either.</p>\n<p>In the end, that&#8217;s why I decided to work at Shopify. Because it scares me shitless. That which scares you the most is usually the best way forward. It&#8217;s your inner comfy coward screaming from the top of his wee lungs that way lies change.</p>\n<p>Change is good. I like change.</p>\n<p>At least I&#8217;ll still have the freedom to work on my own stuff &#8211; yes, I asked &#8211; and following <a class=\"zem_slink\" title=\"Ramit Sethi\" href=\"http://www.ramitsethi.com/\" rel=\"homepage\" target=\"_blank\">Ramit Sethi</a>&#8216;s advice to ask for a few extra $k/year, I&#8217;m going to have plenty of financial independence as well. Important things those two.</p>\n<p>I can&#8217;t weave this smoothly into the story so I&#8217;m just going to say it. Subscribe to Ramit&#8217;s mailing list. Do it. Read it. It will change the way you think in ever so subtle ways. I mean, when was the last time casually reading a free mailing list made you a few thousand dollars? Exactly.</p>\n<p>But yeah, in September I start working for Shopify and that will be the end of my relatively short-lived full-time freelancing career. For now.</p>\n<p>Now how the hell do I write a resume that will impress a government clerk deciding whether I&#8217;m good enough for a visa?</p>\n<div class=\"zemanta-pixie\" style=\"margin-top: 10px; height: 15px;\"><a class=\"zemanta-pixie-a\" title=\"Enhanced by Zemanta\" href=\"http://www.zemanta.com/?px\"><img class=\"zemanta-pixie-img\" style=\"border: none; float: right;\" src=\"http://img.zemanta.com/zemified_e.png?x-id=ccd882ae-571f-43ec-9b15-e95340b0edcf\" alt=\"Enhanced by Zemanta\" /></a></div>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"22694646-72e4-59e9-a158-9402d2adf8a3"}}