{"data":{"wordpressPost":{"title":"World of Goo is the third game I ever bought legally","content":"<p>A few months ago I wrote about <a href=\"http://swizec.com/blog/why-mafiaa-is-fighting-a-losing-battle/2/422\">the failings of MAFIAA&#8217;s business model</a> and pleaded with the aether for them to find something better. Well, now it would seem that a small independent games studio <a href=\"http://2dboy.com/\" target=\"_blank\">2D Boy</a> has discovered a solution I am willing to support. So I bought <a href=\"http://www.worldofgoo.com/\" target=\"_blank\">World of Goo</a>.</p>\n<p>But let me first tell you a little bit about my gaming history so you&#8217;ll have a better sense of why World of Goo is only the third game I bought legally. The first game I ever bought legally was Theme Hospital way back when my 166mHz pentium with 16 megs of RAM was the best gaming rig money could buy. I only bought that one ecause I traded in a birthday gift from mum that wasn&#8217;t all that great. Later I bought Resident Evil together with a friend and then &#8230; then we discovered pirates. Back then it was still possible to just go to a newspaper or some such place and find an advertisment from pirates selling games and other software for cheap.</p>\n<p>So we bought from them a lot, mostly because we were too poor to buy games legally. Later broadband came to our neck of the woods (this was still ISDN for some, slow ADSL for the lucky) and we downloaded many games. It was awesome. Of course we continued to do it because it was what we could afford and lately it turned more into an exercise in downloading games simply being much easier and more readily available and the fact that most games these days simply aren&#8217;t worth the money they&#8217;re asking for.</p>\n<p>Along comes World of Goo. This simple and marvelous game that&#8217;s so addicting it&#8217;s impossible not to play. And from a wonderful studio that is against DRM and other draconian measures of protecting copyright. I admit that at first I downloaded the game illegally if not for anything else than just because that&#8217;s how I&#8217;m used to trying out software, however as soon as I learned 2D BOY didn&#8217;t support DRM I made a decision to buy the game.</p>\n<p>It was a rather interesting sensation this, buying a game I&#8217;d already pirated for rather cheap money (I probably spend more in an evening of drinking) and even though I didn&#8217;t get any physical copy but a digital download I don&#8217;t mind paying for the game. This is a business model I think more, many more, publishers should adopt. Instead of making bad products and shoving them down our throats under draconian security measures the publishing world should be more like World of Goo. A simple and brilliant game that makes it a point to be against DRM and, here&#8217;s the shocker, people want to buy.</p>\n<p>In fact, I don&#8217;t know anyone who after a while of playing the game, didn&#8217;t say they feel guilty for downloading illegally and are going to buy it because it&#8217;s, quite simply, worth its money and doesn&#8217;t come with strings attached.</p>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"934e6c9b-947d-51a8-97a1-ce6168ba6232"}}