{"data":{"wordpressPost":{"title":"Blood fetish","content":"<p>\n Blood fetishism is very popular in goth subculture, which could be deemed rather misterious in itself. Is it that the goth subculture makes somebody prone to being sexually aroused by blood or is it vice versa and being aroused by blood makes a person more prone to also like other gothsy things?\n</p>\n<p>\n Personally I think it&#39;s the latter. Somewhere in a person&#39;s youth, somehow, a taste for blood develops, rather a taste for the macabre. Eventually all of this naturally leads to macabre music, macabre subcultures and so on. But why is it that blood fetishism, dark music, dark sexy clothing and BDSM are so connected? It&#39;s obviously no mistery how or why BDSM and blood are connected, dark sexy clothing is in turn closely connected to BDSM in that dark leather is &#8230; well &#8230; sexy and the epithome of BDSM. Now since everything is so dark already the music must naturally also be dark to properly fit in.\n</p>\n<p>\n But I digress. What I really wanted to talk about today was blood fetishism itself. Just what makes it so popular? Why the hell would anyone even like it? Perhaps lending our ear to some of the other names blood fetishism likes hiding behind, namely <em>vampire</em> fetish. Now vampires, I&#39;m sure, we can all agree are an attractive concept. Die, then live forever trapped in a gorgeous body with the ability to seduce anyone with a mere look? Why it&#39;s absolutely everything humans deep down want &#8211; to live forever and to be downright sexy.\n</p>\n<p>\n Still, however, that does not fully explain just why blood itself would be sexy. Perhaps when one takes into account the thrill of danger, the act of naked bodies playing, it comes to show that it&#39;s not really blood itself that is attractive, it&#39;s really more the whole act of playing with it that is. The biggest problem with being a haematophiliac, that I can think of, is probably the inherent danger and uselessness of the fetish.\n</p>\n<p>\n See, someone who gets their rocks off by being beaten &#8211; easily done. Someone who likes amputees? A tad harder, but amputees are still everywhere. Someone who likes orgies? Very doable. But what of someone who wants blood?\n</p>\n<p>\n You can&#39;t well cut your partner every time sex happens, it can&#39;t even really be done often. The problem here is that the damage you&#39;re doing with razors and such is of semi-permanent nature. It takes at least a week for the wounds to heal, let alone for the scars to vanish. Those who just like some bondage or sado-masochism &#8230; it turns out being whipped only leaves marks for an hour, if you&#39;re not a lunatic that is. Another problem with the nature of damage from blades is that when the damage is simpy superficial (just cut skin and so) the blood that comes out of it is neither plenty nor tasty, frankly, it sucks. But because you can&#39;t stab your partner, cut their arteries or any such fun nonsense, you are left with an unfun reality of blood fetishism.\n</p>\n<p>\n Sadly, haematophilia, although fun in mind and online imagery, is very disappointing in real life.</p>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"bc6d2f2c-d038-58bf-90f1-e5845da96499"}}