{"data":{"wordpressPost":{"title":"Life is simpler without love","content":"<p>\n  A <a href=\"http://morska.blog.siol.net/2008/02/07/koliko-partnerjev-imeti-ali-zakaj-ne-varam-vec/\" target=\"_blank\">certain blog</a> and my subsequent replies to it from yesterday got me into thinking under the shower, which I&#39;ll admit is never too bright an idea as it would seem everything I come  up with under there is as ludicrous as anything I come up with on the loo. I would like to propose a question, is life simpler without love? Or does love make it all worthwile? Well it&#39;s not that easy to say, but let&#39;s postulate for a moment here that life <strong>is</strong> simpler without love &#8230; now to see why that might be.\n</p>\n<p>\n  Well first and foremost love is very taxing on one&#39;s mind. A new obsession is introduced into your life when you fall in love and as we all know, hopefully, obsessions can mean the end of many things. You might for instance have to drop a hobby or two simply because you now spend more time obsessing over this new thing &#8211; person.\n</p>\n<p>\n  Because your mind is up there somewhere with the squirrels you find it more difficult to do your work, school related mandatory activities and all other manner of stuff. Instead of working late into the night you waste it all on talking to your fixation and grooming the relationship. Being in love is just quite simply not that good for your professional life.\n</p>\n<p>\n  Grooming the relationship,  another thing that isn&#39;t all that simple and takes a lot of effort, effort that is not present when you&#39;re all alone under a bridge in Hawai. There is suddenly this person in your life that you do not want to upset, fear to hurt and absolutely dread to make angry. Isn&#39;t it much easier when you&#39;re single and can say anything to anyone because hey, they don&#39;t matter a rat&#39;s arse in your life anyway. So why bother?\n</p>\n<p>\n  Money &#8230; another thing that can quickly dwindle when you&#39;re in love. it&#39;s not so much that you&#39;d need to buy stuff for your fixation more so than it is that many activities surrounding relationships demand certain expenses, like say, going for a date where you need to drink something, perhaps eat a little bit of something as well &#8230; it all demands money.\n</p>\n<p>\n  But lets be fair to this love thing that everyone seems so bent upon finding. All the hugsies and cuddlies <em>are</em> a whole lot of fun and let&#39;s say that, yes, having someone to turn to when life is rough is also very nice. But you know what, about turning to someone when life is rough &#8230; the roughness usually passes a lot quicker and hurts you a whole lot less when you don&#39;t mull over it and when there isn&#39;t anybody available to listen to your moaning you simply cannot mull over it. You simply move on &#8230; very quickly.\n</p>\n<p>\n  I guess, however, the times you&#39;re in a relationship make appreciating being alone at all possible and the times you&#39;re alone make appreciating being in love possible. It&#39;s a strange equilibrium, but it works. Personally I enjoy both sides of the coin greatly.</p>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"e1261b56-66a8-5b7a-ab57-c811b2a1217c"}}