{"data":{"wordpressPost":{"title":"First day with a new 2017 MacBook Pro","content":"<p><iframe width=\"853\" height=\"480\" src=\"https://www.youtube.com/embed/ed2xrQt0Qp4\" frameborder=\"0\" allowfullscreen></iframe></p>\n<p>It&#8217;s that time of the decade! I got a new laptop 🤘🏼</p>\n<p>Ordered <em>during</em> WWDC last week, received yesterday, used for the first full workday today. My old laptop has been with me through thick and thin for almost 5 years, but it was time.</p>\n<p>Roadtrips, airplanes, bangs and drops, some spills &#8230; Missing some screws, lacking a leg thing, crying for battery service for the past 2 years, so slow at encoding video it was dropping frames.</p>\n<p>Rest in peace MacBook Pro mid-2012. Long live MacBook Pro 2017!</p>\n<blockquote class=\"twitter-tweet\" data-lang=\"en\">\n<p lang=\"en\" dir=\"ltr\">I really wanted to hate the touchbar but my favorite writing app has a beautiful integration. <a href=\"https://t.co/PBTdl0Xn2m\">pic.twitter.com/PBTdl0Xn2m</a></p>\n<p>&mdash; Swizec (@Swizec) <a href=\"https://twitter.com/Swizec/status/874990108813926400\">June 14, 2017</a></p></blockquote>\n<p><script async src=\"//platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></p>\n<p>I really wanted to hate the Touchbar. The whole internet said it was stupid, reviewers said it was stupid, it <em>felt</em> stupid just thinking about it.</p>\n<p>Yet Apple wouldn&#8217;t sell me a top-spec laptop without the stupid Touchbar. So a Touchbar I paid for.</p>\n<p>And holy shit is that thing amazing!</p>\n<p>Maybe apps have caught up, maybe everyone just loved hopping on the hate Apple bandwagon, I don&#8217;t know. All I can say is that after a single day with my laptop, I am in love with the Touchbar.</p>\n<p>Yes, I never use it for <em>work</em> work.</p>\n<p>Yes, my laptop is closed in clamshell mode 80% of the time.</p>\n<p>Yep, I&#8217;m using an external clicky keyboard and mouse and big monitor.</p>\n<p>Yeah, it feels stupid that you have to look at your keyboard to use the Touchbar.</p>\n<p>I want one for my external mechanical keyboard anyway. It&#8217;s that good. Bloody thing is amazing. As much as I hate to admit it, I love it.</p>\n<p>So far I&#8217;ve found it most useful for typing emojis, changing and scrobbling songs on Spotify, and opening man pages.</p>\n<p>Wait what</p>\n<p>Yep, there&#8217;s Terminal integration. A <code>man page</code> button shows up that opens the man page for whatever is in your prompt.</p>\n<blockquote class=\"twitter-tweet\" data-conversation=\"none\" data-lang=\"en\">\n<p lang=\"en\" dir=\"ltr\">Ok fuck it Touchbar wins. This thing is amazing <a href=\"https://t.co/iYaAcLEMV1\">pic.twitter.com/iYaAcLEMV1</a></p>\n<p>&mdash; Swizec (@Swizec) <a href=\"https://twitter.com/Swizec/status/875157119447711744\">June 15, 2017</a></p></blockquote>\n<p><script async src=\"//platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></p>\n<p>I didn&#8217;t even know man pages were a feature in Terminal until the Touchbar showed me! That&#8217;s what I love about it. As an app designer you could really leverage this thing to help people discover features in your app.</p>\n<p>My favorite writing tool uses it for markdown shortcuts. I definitely use keyboard shortcuts for that, but the magic buttons are neat.</p>\n<p>Imagine Emacs integration that lists open files in the Touchbar for fast access. Wouldn&#8217;t that be cool? Safari does it for tabs.</p>\n<p>No Chrome integration tho &#8230; Google doesn&#8217;t give a shit about the Touchbar 😔</p>\n<h2>General Impressions</h2>\n<figure>\n<img src=\"https://i.imgur.com/7vPupbf.jpg\" alt=\"New laptop and old laptop\" /><figcaption>New laptop and old laptop</figcaption></figure>\n<p>Other than the Touchbar, the computer is very &#8230; well you know. It&#8217;s been 5 years since my previous new computer and I&#8217;m surprised by how little progress there has been.</p>\n<p>Fancy new laptop. Full Webpack build of our project at work is 30 second faster. That&#8217;s the biggest effect so far. 30 seconds off of compile time. </p>\n<p>In general everything feels a little snappier but not enough to put a finger on it. Video encoding is marginally faster and doesn&#8217;t turn on the fans. Boot times are the same. File copying is fast but not holy shit fast. 10 seconds to copy 1.3 gigs ¯_(ツ)_/¯</p>\n<p>I mean yeah, everything is a little snappier, a bit quicker to respond and run animations. But it just doesn&#8217;t feel like 5 years worth of a difference.</p>\n<p>Remember how big a difference there was between a computer in 1996 and a computer in 2001? Those were worlds apart. </p>\n<p>This one feels like a spick of polish on top of my old machine. It doesn&#8217;t even have more RAM.</p>\n<h2>Things I hate</h2>\n<p>The dongles. Holy shit the dongles. That stuff needs to go die in a fire.</p>\n<p>Yes I get it, USB-C is the future. We&#8217;re all gonna have all the things with USB-C in 5 years. <em>I&#8217;m gonna have a new laptop by then</em> 😡</p>\n<p>I didn&#8217;t even notice when Apple killed the CD. Or when they killed the Ethernet port. By the time Apple killed those, nobody was using them anymore.</p>\n<p>But USB? All my stuff is USB. Literally everything, I&#8217;m not even joking.</p>\n<p>Mouse, keyboard, camera, phone, backup drive, everything USB. Sure I can connect them via my monitor, <em>but I can&#8217;t even connect my monitor</em>.</p>\n<p>Oh, your monitor is Thunderbolt 2, not USB-C? Tough. You can buy a $50 dongle. A dongle for my dongle 🙄 </p>\n<p>To add insult to injury, the new charger is incompatible with my monitor&#8217;s charging cable <strong>and</strong> with my existing chargers. Hello zero redundancy!</p>\n<p>New Apple chargers come in &quot;brick with USB-C port&quot; form. There&#8217;s a USB-C to USB-C cable that you use to connect your laptop.</p>\n<p>Now I have to cary my charger around like a peasant. That shit&#8217;s heavy!</p>\n<p>I Guess it&#8217;s time to look for a new monitor. One that charges and connects through the same cable. Those exist, right? Proper docking stations for a modern laptop &#8230; one can hope.</p>\n<p>Here&#8217;s to the next 5 years. 🍻</p>\n<p>PS: TouchID is a pain in the arse in clamshell mode. Gotta open your laptop, smash your finger on the reader, close laptop every time it locks. Lame.</p>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"b855af7e-57e4-5aab-a390-58a4c7cc3125"}}