{"data":{"wordpressPost":{"title":"I learned two things today 20.8.","content":"<div id=\"attachment_2269\" style=\"width: 310px\" class=\"wp-caption alignright\"><a href=\"http://swizec.com/blog/wp-content/uploads/2011/08/photo2.jpg\"><img class=\"size-medium wp-image-2269\" title=\"Vegan food\" src=\"http://swizec.com/blog/wp-content/uploads/2011/08/photo2-300x224.jpg\" alt=\"\" width=\"300\" height=\"224\" srcset=\"https://swizec.com/blog/wp-content/uploads/2011/08/photo2-300x224.jpg 300w, https://swizec.com/blog/wp-content/uploads/2011/08/photo2.jpg 640w\" sizes=\"(max-width: 300px) 100vw, 300px\" /></a><p class=\"wp-caption-text\">Vegan food</p></div>\n<p>Today I learned that despite being the biggest carnivore you are likely to meet I can actually enjoy a vegan lunch when it&#8217;s done right. Was on a shopping spree in San Francisco today because I need some clothes and they&#8217;re somewhat cheap this side of the pond. Part of the trip involved lunch and we went to an interesting place on Valencia called <a href=\"http://www.herbivorerestaurant.com/\">Herbivore</a>.</p>\n<p>It&#8217;s a fully vegan restaurant that actually serves good food. The fake chicken I ate was so awesome I would never have guessed it wasn&#8217;t real chicken if I didn&#8217;t know in advance.</p>\n<p>Another thing I learned is that in the US it is in fact possible to get pulled over by a cop while riding a bicycle. Got confused at a very big crossroads and somehow ended up running a red light in a very very confused manner. Wanted to go left, but I couldn&#8217;t, then the lights started changing and everything went south quick.</p>\n<p>Whoo-whoop from a police bike and I was explaining myself to a cop. Got out scot free simply because I&#8217;m foreign and weird, but was told in a very sarcastic manner that here in the US you are supposed to stop when the light is red 😀</p>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"b1378155-b9ca-510b-aca8-0369837cd25e"}}