{"data":{"wordpressPost":{"title":"It&#8217;s a trap","content":"<p><em>&#8220;Hey mum, what&#8217;s your Apple ID password?&#8221;</em></p>\n<p><em>&#8220;What&#8217;s an Apple ID?&#8221;</em></p>\n<p>Thus began my mum&#8217;s visit to San Francisco and the United States. First thing this morning, after stretching and breakfast and showering and coffee and cigarettes and explaining how weather works in this city and that no, we are certainly not coming back home before the evening, was to buy a new iPhone.</p>\n<p>Her old phone makes bad photos.</p>\n<figure>\n<img src=\"http://i.imgur.com/lmAzcry.jpg\" alt=\"Im the one on the left\" /><figcaption>I&#8217;m the one on the left</figcaption></figure>\n<p>Then we had to set it up. Try three emails, try two passwords, convince Gmail that yes, this is the first time logging in from the States, but it&#8217;s definitely my mum. Thank God her phone receives SMS, even in the US.</p>\n<p>Half an hour later, we were on our way… to the Cheesecake Factory across the street because it was lunch time by now. But yay, new phone! \\o/ </p>\n<p>Let&#8217;s hope she learns how to use this one. 5 years of Android meant nothing. I asked her if she wanted to transfer her apps, and she said, <em>&#8220;What&#8217;s an app?&#8221;</em></p>\n<p>And hey, it&#8217;s not like the sexy convertible I rented for our trip to Half Moon Bay had been waiting for us since 8am or anything like that. Or like I&#8217;d gotten up at 7:30am and then waited an hour and a half for everyone else to wake up then waited <em>again</em> until 11am to leave the apartment.</p>\n<p>Oh no, nothing like that. Why ever would I make plans like that?</p>\n<figure>\n<img src=\"http://cdn.playbuzz.com/cdn/57a9496f-a3ec-45b4-bb22-961191e4c8a0/ae518471-76e2-407d-897c-e6aae1021a44.jpg\" alt=\"\" /><br />\n</figure>\n<p>It&#8217;s not like she&#8217;s here for 10 days and this is the only free day I have outside the weekend. It’s nothing like that. Of course not. <em>Surely</em> none of us would be as frivolous with time if that were the case. Surely not!</p>\n<p>And yet…</p>\n<p>But hey, we hit the road by 2pm, got stuck in traffic half way to Half Moon Bay, turned around, went aaaaaaallll the way back up to San Francisco, drove across the Golden Gate Bridge, and went to Sausalito.</p>\n<p>You’d expect Sausalito to be a magical place full of beautiful views and amazing things to see and do. Rich people flock there to build summer homes. They must be onto something!</p>\n<p>The ice cream is good, San Francisco in the distance is gorgeous, and it&#8217;s a great excuse to drive visitors across a famous bridge, but man, that place be boring. You park. You stroll for 20 minutes. Done.</p>\n<figure>\n<img src=\"http://i.pbase.com/o5/00/474800/1/69784843.eJFexdTh.proofs061008_0958SausalitoCalifornia.jpg\" alt=\"San Francisco view from Sausalito\" /><figcaption>San Francisco view from Sausalito</figcaption></figure>\n<p>Why do people go here? Why do <em>I</em> keep going?</p>\n<p>Oh yeah, the bridge &#8230;</p>\n<p>It was smooth sailing from then on. We picked up groceries for the week, found out that fruits and veggies really <em>are</em> expensive in the States and they look like plastic, and we went home. Then the girlfriend and I dropped off the rental while my mum and her friend put the groceries away.</p>\n<p>I came back home to <em>&#8220;I don&#8217;t know how your fridge works. You do it.&#8221;</em></p>\n<p>Is she paying me back for all the shit I put her through as a teenager? That&#8217;s definitely an excuse I&#8217;d try to pull…</p>\n<p>It is now 9pm. I&#8217;m ready to collapse into bed for a nap, my girlfriend is half asleep, and my mum goes: <em>&#8220;Can we get some coffee? What is this jet lag you keep warning me about? I don&#8217;t feel tired at all!&#8221;</em></p>\n<p>Yes, mother, it is 6am in your timezone. That&#8217;s when you wake up every day to go to work. You don&#8217;t say you&#8217;re not tired!</p>\n<figure>\n<img src=\"http://vignette3.wikia.nocookie.net/videogames-fanon/images/6/6f/You_don't_say%3F.jpg/revision/latest?cb=20140611160252\" alt=\"\" /><br />\n</figure>\n<p>9 more days, Swiz. You can do it. Remember: you love your mum. Even when she&#8217;s not 9,000 kilometers away and she’s sleeping on your couch. </p>\n<p>I wish she could speak English.</p>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"8ed3da14-074e-53b0-aded-daf8ef7c0be3"}}