{"data":{"wordpressPost":{"title":"Getting readership","content":"<p>\nActivity, activity, activity. Just as in the real estate world it&#39;s all about location, location, location in the blogosphere it&#39;s all about activity. The more active a blogger is the more readers they get and yes, while I do understand that there are people out there who aren&#39;t at all interested in having many readers some of us are quite vain and love readers almost as much as they like watching us dance like monkeys and do summersaults just to get that one more view. We&#39;re like spoilt attention seeking brats really &#8230;</p>\n<p>But it&#39;s not just about activity, it&#39;s important what kind of activity you have. For example you can post every day, even more than once a day, and if what you&#39;re posting are just copy pastes of images or videos and your posts rarely contain any real content there won&#39;t be readers because, let&#39;s face it, they need to have something of value to read if you want them coming back. Don&#39;t fall into the quality over quantity scham though, there won&#39;t be any readers if they don&#39;t have something new to read at least a few times a week either.</p>\n<p>Another important aspect of getting a high readership is reading other people&#39;s blogs and commenting! Comments are good because they get your name out into the aether, alert other bloggers to your existance and, most of all, tell readers of blogs that hey, there&#39;s another guy out there whom they can check out.\n</p>\n<p>\nA good tactic, also, is getting a <a href=\"http://technorati.com/claim/3h4sn3jvks\">Technorati Profile</a>, which gets your link out as well, also notifying other <a href=\"blogorola.com\">online aggregators</a>  can only be good. In fact I&#39;d venture to say that the more aggregators that know about you the more readers know about you and there&#39;s bound to be some who decided they like you.</p>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"7c69e359-791e-5baa-a45c-b63be635c096"}}