{"data":{"wordpressPost":{"title":"Don&#8217;t say yes when you&#8217;re happy","content":"<p><iframe width=\"580\" height=\"435\" src=\"https://www.youtube.com/embed/PWvgHcjmuXc?feature=oembed\" frameborder=\"0\" allow=\"autoplay; encrypted-media\" allowfullscreen></iframe></p>\n<p>This is a story of how I got spread thin like butter on too much toast, as Bilbo Baggins would say.</p>\n<p>It starts on the <a href=\"https://swizec.com/blog/teaching-backend-devs-react-redux-stubhub-boston/swizec/7952\">flight back from Boston</a> in December. My friend asks <em>&#8220;Hey, so I&#8217;ve got this project that&#8217;s almost finished, and my guy can&#8217;t work on it anymore. It&#8217;s just a little polish to wrap up. Would you be interested in helping me out?&#8221;</em></p>\n<p>I gave my usual weasel-out-of-this answer. Errr I dunno man I&#8217;m pretty busy there&#8217;s a lot going on not sure I can help you with this. Maybe.</p>\n<p>You never say No. Learned that from the general Silicon Valley culture. Everything&#8217;s a maybe. Keep your options open.</p>\n<p>He asked me again a few weeks later.</p>\n<p>This time, I was chilling. Solving Advent of Code puzzles, thinking about projects I might do in 2018, getting ready for some holiday downtime. Felt like I had all the time in the world.</p>\n<p>So I said, “Yes, I&#8217;ll help you out. Let&#8217;s talk in January after the holidays.”</p>\n<p>Aaaaaaand crap. January comes, life gets back to normal, things kick back into high gear, and guess who doesn&#8217;t <em>really</em> have as much time as he thought.</p>\n<p><center><img src=\"https://i.imgur.com/2YTSQ3k.jpg\" /></center></p>\n<p>Now, here I am, spread thin like butter over too much toast.</p>\n<p>Guess it&#8217;s just one of those lessons you always learn the hard way again and again and again and then some more. It never really sinks in.</p>\n<p>When agreeing to projects and ideas, consider your mental state and how it differs from the usual. You&#8217;re more likely to say Yes to things when you&#8217;re happy, and you&#8217;re very likely to think you&#8217;ll always have time if you currently have time.</p>\n<p>Or as a popular meme once put it 👇</p>\n<p><center><img src=\"https://pics.me.me/22-year-old-me-after-a-night-out-of-drinking-3050859.png\" /></center></p>\n<p>P.S.: The project is never &#8220;quick&#8221; or &#8220;just some polish&#8221;. Never.</p>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"187fbd9f-3fab-5cc3-b8b4-92cd43704cec"}}