{"data":{"wordpressPost":{"title":"Week 4: Tiny insects evolve anuclear neurons","content":"<p><em>[This post is part of an ongoing challenge to understand 52 papers in 52 weeks. You can read previous entries, <a href=\"http://swizec.com/blog/category/52-papers-in-52-weeks\">here</a>, or subscribe to get notified of new posts by <a href=\"http://swiz.ec/52papers-list\">email</a>]</em></p>\n<p>There is a species of <a class=\"zem_slink\" title=\"Parasitoid wasp\" href=\"http://en.wikipedia.org/wiki/Parasitoid_wasp\" target=\"_blank\" rel=\"wikipedia\">parasitic wasp</a> smaller than an amoeba or a paramecium. Imagine that, a whole wasp smaller than some <a class=\"zem_slink\" title=\"Microorganism\" href=\"http://en.wikipedia.org/wiki/Microorganism\" target=\"_blank\" rel=\"wikipedia\">single cell organisms</a>. Sure amoebas and parameciums are some of the biggest single cell organisms, but that&#8217;s still amazing.</p>\n<p>Alexey A. Polilov&#8217;s <a href=\"http://entomology.ru/archiv_text/polilov/Polilov%202012%20Megaphragma.pdf\">The Smallest Insects Evolve Anucleate Neurons</a> talks about one of the adaptations <a class=\"zem_slink\" title=\"Megaphragma mymaripenne\" href=\"http://en.wikipedia.org/wiki/Megaphragma_mymaripenne\" target=\"_blank\" rel=\"wikipedia\">Megaphragma mymaripenne</a> evolved to become the tiniest flying animal in existence.</p>\n<div style=\"width: 591px\" class=\"wp-caption alignnone\"><img title=\"The wasp compared to an amoeba and a paramecium\" alt=\"The wasp compared to an amoeba and a paramecium\" src=\"https://draftin.com:443/images/3796?token=fz6gf4fpQFawUGpEuCNjkdF8_nr57YuZGXQncMUocnQLDBZSqtTuDNB_lSyjD2x927n7VOOgyPdRKTH5NsHOi2U\" width=\"581\" height=\"863\" /><p class=\"wp-caption-text\">The wasp compared to an amoeba and a paramecium</p></div>\n<h2 id=\"miniaturization\">Miniaturization</h2>\n<p>Vertebrates achieve miniaturization by changing their skeleton and organ size, but invertebrates get into some real trouble because when tiny insects become even tinier there just isn&#8217;t a lot of space left. In particular, the <a class=\"zem_slink\" title=\"Nervous system\" href=\"http://en.wikipedia.org/wiki/Nervous_system\" target=\"_blank\" rel=\"wikipedia\">nervous system</a> isn&#8217;t something that can just magically become smaller.</p>\n<p>Some species of microscopic ants move parts of their brain out of the head and into other parts of the body. This happens during the <a class=\"zem_slink\" title=\"Pupa\" href=\"http://en.wikipedia.org/wiki/Pupa\" target=\"_blank\" rel=\"wikipedia\">pupa</a> stage of metamorphosis &#8211; between the larva and an adult animal. In butterflies this would be the cocoon, which comes between the caterpillar and butterfly stages.</p>\n<p>But wasps have very articulate heads and there isn&#8217;t enough room in their neck to have a multi-part brain. This causes problems at the <a class=\"zem_slink\" title=\"Cell (biology)\" href=\"http://en.wikipedia.org/wiki/Cell_%28biology%29\" target=\"_blank\" rel=\"wikipedia\">cellular level</a> and means they have to do something pretty amazing.</p>\n<p>Most of the neurons lose their nucleus.</p>\n<h2 id=\"research\">Research</h2>\n<p>The researchers compared pupa and adult stages of two closely related microscopic wasps &#8211; the Megaphragma mymaripenne and the larger <a class=\"zem_slink\" title=\"Trichogramma evanescens\" href=\"http://en.wikipedia.org/wiki/Trichogramma_evanescens\" target=\"_blank\" rel=\"wikipedia\">Trichogramma evanescens</a>. Specimens were fixed in formaldehyde and sliced into 1µm slices.</p>\n<p>Using these slices they created 3D models of the specimens, which helped them calculate volumes of different tissues. Later on the slices were coated in gold so they could be looked at under an electronic microscope.</p>\n<p>The research and methodology section isn&#8217;t very interesting in general, but the detailed info on software and equipment used might help you reproduce the experiment. You know, because you have that Jeol JEM-1011 microscope just lying around and don&#8217;t know what to do with it.</p>\n<h2 id=\"results\">Results</h2>\n<div style=\"width: 646px\" class=\"wp-caption alignnone\"><img title=\"Nervous system inside the head and brain with sporadic nucleae\" alt=\"Nervous system inside the head and brain with sporadic nucleae\" src=\"https://draftin.com:443/images/3798?token=FYylBHf9Ei9fsS-76rQP2fIEUqB684atwnwRrwVJvHEZ87pG5Gfwd7izyKCMGuIwH7pxlkrWy8PyVykclzygImQ\" width=\"636\" height=\"565\" /><p class=\"wp-caption-text\">Nervous system inside the head and brain with sporadic nucleae</p></div>\n<p>Megaphragma mymaripenne&#8217;s nervous system undergoes a significant change during the pupa stage. Much greater than other insects.</p>\n<p>Most of the ganglia merge to form single ganglia for specific parts of the body. The abdominal ganglia merge into a single one and so on. This saves a lot of space, but that pesky brain occupies most of the head.</p>\n<p>That&#8217;s why 95% of neurons also undergo lysis, which basically means parts of the cells disintegrate. In this case, they lose the nucleus so the adult wasp has only 339 to 372 nuclei in its whole nervous system, 179-253 of which are in the brain. Compared to normal wasps&#8217; 37,000 <a class=\"zem_slink\" title=\"Cell nucleus\" href=\"http://en.wikipedia.org/wiki/Cell_nucleus\" target=\"_blank\" rel=\"wikipedia\">nucleated</a> neurons that&#8217;s not a lot.</p>\n<p>In fact, 2.9% of this tiny wasp&#8217;s volume is taken up by the nervous system. Considering normal insect brains take up only 0.35% to 1.02% of the owner&#8217;s volume you can say something really special is going on here.</p>\n<p>The discussion section mentions this wasp might have hit the lowest possible size limit for an animal with a nervous system. Reducing size further would introduce problems on the chromosome level, and would have to include removing whole neurons.</p>\n<p>Which is apparently something that doesn&#8217;t just happen. According to volume calculations the adult M. mymaripenne has got the same number of neurons as the pupa stage, but makes them smaller with the nucleus trick.</p>\n<p>Interestingly, the M. mymaripenne is completely typical during the pupa stage. Not only does it have the normal number of neurons, even their volume percentage is typical &#8211; 19%.</p>\n<div style=\"width: 723px\" class=\"wp-caption alignnone\"><img title=\"Changes to the head\" alt=\"Changes to the head\" src=\"https://draftin.com:443/images/3799?token=I4C-cFwa4623Goj_qVslEZ_4IgEt7C9Gi1f6auMhbg2cjG5c8_i6acFBYrFO-c3zSt44Tv8LXLGh9eo91J9KTDg\" width=\"713\" height=\"781\" /><p class=\"wp-caption-text\">Changes to the head</p></div>\n<p>Better still, the M. mymaripenne retains all functions you&#8217;d expect from an adult wasp. Despite the low number of nucleotal neurons it can still fly around, find hosts, and lead a normal life for the five days it&#8217;s supposed to live. Pretty amazing if you ask me.</p>\n<p>One thing I didn&#8217;t find in the paper is the exact significance of neurons without nuclei, it was assumed readers understand that much of biology. From what I could gather elsewhere, the nucleus contains cell <a class=\"zem_slink\" title=\"DNA\" href=\"http://en.wikipedia.org/wiki/DNA\" target=\"_blank\" rel=\"wikipedia\">DNA</a> and regulates gene expression, which tells the cell what to do. So I&#8217;m guessing all those anucleate neurons aren&#8217;t doing much to help the wasp&#8217;s life.</p>\n<p>But there you have it, the animal that needs the least brain power to fly. Amazing.</p>\n<div class=\"zemanta-pixie\" style=\"margin-top: 10px; height: 15px;\"><a class=\"zemanta-pixie-a\" title=\"Enhanced by Zemanta\" href=\"http://www.zemanta.com/?px\"><img class=\"zemanta-pixie-img\" style=\"border: none; float: right;\" alt=\"Enhanced by Zemanta\" src=\"http://img.zemanta.com/zemified_e.png?x-id=80563da2-1ec1-47a5-958d-70478513119e\" /></a></div>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"b630b019-849d-51ef-9c47-f706ed2bc562"}}