{"data":{"wordpressPost":{"title":"Blackberries are arsehats","content":"<p>On Tuesday I bought a blackberry to replace my old phone and make a step into the new age of ultra connectivity on the go. But there was a hitch &#8211; it was the blackberry.</p>\n<p>Don&#8217;t get me wrong, I love my Blackberry 8310, but its user interface is just such a horrible mess I feel like hunting down the UI designers and bludgeoning them with an axe or something similar. Half of the time the damn thing is making me feel like a complete idiot, even making me turn to the user manual or google for answers, and the other half of the time the blackberry&#8217;s UI is making me want to hurt somebody.</p>\n<p>Can&#8217;t sync via bluetooth &#8211; not supported, have to turn on bluetooth receiving in media gallery (rather than the bloody SETTINGS menu) to receive files, trackball scrolling of long lists making my thumb fall apart, no obvious way of locking keyboard with a single key, having spent all night trying to figure out how to update firmware to 4.5, music player forgetting where it&#8217;s left off last time, three clicks AND scrolling to write a bloody text, several clicks to get to contacts, all different kinds of optins being scattered all over the place instead of staying inside &#8220;settings&#8221; &#8230; to name a few I can think of off the top of my head.</p>\n<p>Seriously UI designer guys, doesn&#8217;t it tip you off that there is something horribly awry going on when you have to have access to &#8220;Help&#8221; in every single menu? Or when your phone has to ship with a special &#8220;quick tips&#8221; booklet that teaches people how to use the bloody keyboard? You might call it well documented, I call it poorly designed because a well designed UI doesn&#8217;t need a user manual since users can use it intuitively.</p>\n<p>But there are many things I do love about the blackberry (let&#8217;s leave alone the fact it&#8217;ll take me ages to get used to its keyboard). I like that it feels big and solid in my hand while remaining light, the way it displays text as a conversation is a bloody marvelous idea, the calendar showing next two appointments on main screen and being very easy to manuever and see what you&#8217;re up to &#8211; fucking awesome. The fact that it can sync with my iCal is brilliant as well. I love the fact normal headphones plug into this phone instead of proprietary crap, regular mini USB port is brilliant as well. And I&#8217;m sure that once simobil stops being a fuckup I&#8217;ll love my internet stuff as well.</p>\n<p>Overall I quite enjoy the blackberry and love it thusfar, just the UI &#8230; seriously, are you kidding me? Could stand to be a little quicker as well, but alright, it&#8217;s a phone and packed with stuff, I&#8217;m sure the hardware is straining to keep up.</p>\n<p>This only leaves simobil to rant about. What the fuck guys, I bought a blackberry in a blackberry only package, and I can&#8217;t get internet working because I didn&#8217;t order a data plan!? What the hell! Sure you later admit to having given me the <em>wrong fucking plan</em>. But how on earth did you manage confusing the specifically-for-blackberries-and-blackberries-sold-only-with-it plan for that other generic crap? Bastards.</p>\n<p>Hopefully simobil will correct their fuck up quickly and I&#8217;ll be able to use the blackberry to its full extent, until then I will remain with an oversized, overkeyed &#8230; telephone.</p>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"8fd56523-7bfd-5994-b3b9-b8d423c2a1da"}}