{"data":{"wordpressPost":{"title":"What I learned from Viktor E. Frankl&#8217;s Man&#8217;s Search for Meaning","content":"<blockquote><p>“Ultimately, man should not ask what the meaning of his life is, but rather must recognize that it is he who is asked.”<br />\n― <a class=\"zem_slink\" title=\"Viktor Frankl\" href=\"http://en.wikipedia.org/wiki/Viktor_Frankl\" target=\"_blank\" rel=\"wikipedia\">Viktor E. Frankl</a>, <a class=\"zem_slink\" title=\"Man's Search For Meaning\" href=\"http://www.amazon.com/Mans-Search-Meaning-Viktor-Frankl/dp/0671023373%3FSubscriptionId%3D0G81C5DAZ03ZR9WH9X82%26tag%3Dageewitahat-20%26linkCode%3Dxm2%26camp%3D2025%26creative%3D165953%26creativeASIN%3D0671023373\" target=\"_blank\" rel=\"amazon\">Man&#8217;s Search for Meaning</a></p></blockquote>\n<p>Man&#8217;s Search for Meaning is a book about many things. It comes in two parts: the first about Frankl&#8217;s experience as a prisoner in <a class=\"zem_slink\" title=\"Auschwitz concentration camp\" href=\"http://en.wikipedia.org/wiki/Auschwitz_concentration_camp\" target=\"_blank\" rel=\"wikipedia\">Auschwitz</a>, and the second about logotherapy &#8211; the psychotherapy principle he developed based on what he saw in the camps.</p>\n<p>Frankl puts forward the idea that we all seek meaning. That as long as our lives have meaning, we are happy. When life loses meaning, we fall into existential despair. This idea is in stark contrast to Freud&#8217;s will to pleasure, and Adler&#8217;s will to power.</p>\n<p>He builds this idea from behaviors observed at concentration camps.</p>\n<p>When a person first arrived at camp, they were in a state of shock. They could not fathom what is happening. That it&#8217;s happening to <em>them</em>. <em>&#8220;It&#8217;s just a fluke&#8221;</em>, they would think, <em>&#8220;No way are they going to ask <strong>me</strong> to stay here.&#8221;</em>.</p>\n<p>They would beg and plead and try to offer trinkets in return for favors or release. They would explain that they are influential people in their communities and that this must be some sort o mistake. They were doctors, merchants, businessmen, scientists, scholars.</p>\n<p>Surely <em>they</em> do not deserve this treatment. Surely <em>they</em> should be released. Whoever is in charge will soon realize their mistake and let them go.</p>\n<p>Surely.</p>\n<p>All were selected either for immediate death, or for months of slave labor followed by death. Doctors and peasants alike. Based solely on whether they looked fit enough to work after a five second inspection.</p>\n<p>A limp meant instant death.</p>\n<p>After shock came apathy. Prisoners cared only for what was immediately important to their survival. They fought for scraps of food, they watched people get beaten to death and did nothing. They even got angry with the injured person on a crew that slowed them down. If a guard noticed, they&#8217;d all get beaten.</p>\n<p>With no ambition, with no personality, with no human decency, their life was no more than surviving until the next hour, the next day, the next week. Without a visible end to the suffering even hope could not exist. Not really.</p>\n<blockquote><p>“Everything can be taken from a man but one thing: the last of the human freedoms—to choose one’s attitude in any given set of circumstances, to choose one’s own way.”<br />\n― Viktor E. Frankl, Man&#8217;s Search for Meaning</p></blockquote>\n<p>Despite all this, despite having everything taken away, despite the starvation and the beatings and the work, one freedom remained: their attitude.</p>\n<p>They could choose how they reacted. They could give in or they could fight. They could plead and beg, or they could keep their honor. They could bring harm to other prisoners, or they could help as much as possible.</p>\n<p>When somebody had a cough, they helped hide it. When somebody limped, they propped them up. When a friend came for soup, they could scoop deeper and get more meat scraps.</p>\n<p>If it did not put them in danger, they helped.</p>\n<p>As Frankl put it, they all had someone looking down on them. Someone or a something that would expect to not be disappointed. There was family waiting back home, or they had a business to get back to, or a life&#8217;s work to complete, or even a god.</p>\n<p><em>Something</em> kept them alive. Gave them reason to keep going.</p>\n<p>And so they lived.</p>\n<blockquote><p>“Those who have a &#8216;why&#8217; to live, can bear with almost any &#8216;how&#8217;.”<br />\n― Viktor E. Frankl, Man&#8217;s Search for Meaning</p></blockquote>\n<p>But many lost the something. For some reason or another, they stopped fighting. They stopped surviving.</p>\n<p>Frankl says you could always tell when this happened to a person. They stopped doing the little survival tricks. They didn&#8217;t stuff their shoes with newspaper, they didn&#8217;t patch a hole on their shirt, they ate all their food in one go, they smoked rather than traded cigarettes.</p>\n<p>The next morning they would not get out of bed. Not go to work. Never get up again. Malnutrition, overwork, disease. They&#8217;d kill them in less than a week.</p>\n<p>Frankl tried to remind his fellow inmates that suffering can have meaning in and of itself. If suffering is unavoidable, then withstanding it with poise and honor has inherent meaning. Not in the least because it gives strength to others with a similar fate.</p>\n<p>Entire careers have been built on withstanding suffering. <a class=\"zem_slink\" title=\"Nick Vujicic\" href=\"http://en.wikipedia.org/wiki/Nick_Vujicic\" target=\"_blank\" rel=\"wikipedia\">Nick Vujicic</a> &#8211; the man with no limbs, but happy about having at least a chicken drumstick &#8211; for instance. He is happy despite having no limbs. He inspires people. His life has meaning.</p>\n<p>It&#8217;s why fat loss instagrams are so popular. It&#8217;s why cancer patients share their lives online. It&#8217;s why Rudimental used the BMXer who lost a leg for their music video. Person suffers. Person perseveres. Person inspires us to beat down our daily struggles.</p>\n<p>But if suffering is avoidable, we think the person not inspiring, but stupid. That&#8217;s why we roll our eyes at bridezillas and those insufferable sweet sixteen twats.</p>\n<p>For those who survived, after liberation came a third stage. Stripped of their identity as prisoners, stripped of the singular focus on survival, they found themselves lost once more. Life after camp had no more inherent meaning than life during camp.</p>\n<p>Some looked for justice, but found themselves the monsters they escaped from. Some looked for loved ones, but found the homestead empty. Some looked for recognition, but found the world didn&#8217;t even know of Auschwitz. Some found themselves marked as evil men because they had survived and somebody else did not.</p>\n<p>Whatever kept them going before, did not exist now. Once more they would have to find their own meaning, Because life cannot give you meaning, <em>you</em> have to give meaning to life. No matter how silly.</p>\n<figure><img src=\"http://cmster.com/media/AGPYQ87OmD2X8o6yJVHyQsLdluisRD7Zl2tpjJlD5QBUuJgVlntNuCDQ4uweYN6j.jpg\" alt=\"Bruce Lee quote about goals\" /><figcaption><a class=\"zem_slink\" title=\"Bruce Lee\" href=\"http://en.wikipedia.org/wiki/Bruce_Lee\" target=\"_blank\" rel=\"wikipedia\">Bruce Lee</a> quote about goals</figcaption></figure>\n<p>And that is why I train for marathons, why I punch things at the gym, why I have a bet about net worth with a friend. It may be stupid, but it gives me something to do.</p>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"857a3ea6-048c-50c2-b22b-9a01d07b8ac8"}}