{"data":{"wordpressPost":{"title":"How I became a 3 hour per day workout nutter","content":"<p>On Sunday I went to boot camp &#8211; an hour of fast paced <a class=\"zem_slink\" title=\"Calisthenics\" href=\"http://en.wikipedia.org/wiki/Calisthenics\" rel=\"wikipedia\" target=\"_blank\">calisthenics</a> &#8211; followed half an hour later by <a class=\"zem_slink\" title=\"Boxing\" href=\"http://en.wikipedia.org/wiki/Boxing\" rel=\"wikipedia\" target=\"_blank\">boxing</a> practice. Three hours at the gym in total. On a sunny, if cold, Sunday afternoon. I had also spent half an hour working out that morning.</p>\n<p>That evening, whimpering in bed from muscle soreness, complaining loudly, but secretly enjoying every moment, it dawned on me that this might not be normal.</p>\n<img src=\"https://www.filepicker.io/api/file/tAksLfZcRAmuZv2A4tIj\" alt=\"\" />\n<img src=\"https://www.filepicker.io/api/file/etIlPIqTRSiFoFDE4sQg\" alt=\"\" />\n<p>Every day the internet tells me that as a human being of a sit-down, stare-at-a-computer persuasion, I should cower from physical strain. I should be looking up to the <a href=\"http://frac.org/initiatives/hunger-and-obesity/obesity-in-the-us/\" target=\"_blank\">30% of the population that isn&#8217;t fat</a>, admire the perhaps 5% that&#8217;s actually in shape, and shout profanities at society for making me feel bad about my body while nomming on a bag of crisps.</p>\n<p>If that&#8217;s normal, then there is definitely something wrong with me. Deeply and horrifically wrong.</p>\n<p>Last week I spent 20 hours working out, the week before that it was 18. Both weeks I spent only 19 hours doing full on productive billable work. And about 18 hours writing.</p>\n<p>I also count calories, watch what I eat, and I don&#8217;t even remember what a sugar craving feels like anymore.</p>\n<p>I must be deeply disturbed &#8230;</p>\n<p>But how does a person even get to the point where a third of their productive time is spent working out?</p>\n<h2>How the hell?</h2>\n<p>For me, it all started in high school. I was a scrawny kid, and I decided that this won&#8217;t do and I want some muscle. Maybe I got mugged or something, can&#8217;t remember the exact catalyst anymore.</p>\n<p>So I signed up for a gym membership and started weight lifting three days a week, an hour each. But I started getting bored and the results weren&#8217;t coming quickly enough. The hour swelled up to two hours, then two and a half.</p>\n<p>Okay, this isn&#8217;t sustainable, maybe I can partition my time better by working out six days a week for an hour.</p>\n<p>That eventually became six days a week for two hours.</p>\n<p>The results were spectacular. Like, truly magnificent. I weighed 65 kilograms and could squat just over 120 kilograms five times in a row.</p>\n<p>But I wanted more. More muscle. More weight. The plateau was immense, for the life of me I couldn&#8217;t get my weight above the magic 25 <a class=\"zem_slink\" title=\"Body mass index\" href=\"http://en.wikipedia.org/wiki/Body_mass_index\" rel=\"wikipedia\" target=\"_blank\">BMI</a> line. That&#8217;s officially the top non-obese BMI you can have by the way.</p>\n<p>Then I got bored and who has time to work out six times a week when they&#8217;re launching a startup anyway?</p>\n<p>So I started boxing. Just three days a week. Fun. With a proper trainer. About the same price. Marvelous!</p>\n<div style=\"width: 730px\" class=\"wp-caption alignnone\"><img class=\" \" title=\"THE boxing photo\" src=\"http://www.omaa.org.uk/sites/default/files/Boxing-008.jpg\" alt=\"THE boxing photo\" width=\"720\" height=\"540\" /><p class=\"wp-caption-text\">THE boxing photo</p></div>\n<p>In that first year or so of boxing, I fast realised boxing does much more than just get you in great physical shape. It&#8217;s also a spectacular way to get in mental shape.</p>\n<p><em>People annoying you all day?</em> Violently punch it out.</p>\n<p><em>Been dealing with a pesky bug for a week?</em> Violently punch it out.</p>\n<p><em>Intimidating meetings hard on your confidence?</em> No worries, you can beat the crap out of anyone in the room.</p>\n<p>Now, I&#8217;m not a violent man, but there&#8217;s just something so primal, so very confidence inducing, about knowing not a single person in the room is a physical match for you. I can&#8217;t really explain it, maybe it&#8217;s just the difference between being a scrawny kid that&#8217;s a head shorter than everyone, and being an agile pile of muscle that&#8217;s a head shorter than everyone.</p>\n<p>And it goes so much further than just physical might and an escape into introversion. You become sort of calmer, more able to think things through &#8230; it genuinely makes you better at your intellectual work.</p>\n<p>But we&#8217;re still at just 5 hours a week. The final piece of the puzzle is my first trip to the US two years ago.</p>\n<p>Two weeks without boxing practice or any <a class=\"zem_slink\" title=\"Physical exercise\" href=\"http://en.wikipedia.org/wiki/Physical_exercise\" rel=\"wikipedia\" target=\"_blank\">physical activity</a>? Now that just won&#8217;t do will it? Time to start working out in the morning, just a few situps and pressups and such. No biggie.</p>\n<p>Fifteen minutes a day. Just enough to wake you up and keep you in shape somewhat, not enough to take any real amount of time. Perfect.</p>\n<p>When I cam back to Slovenia. I simply didn&#8217;t stop. Eventually it ballooned to thirty minutes, then forty minutes. Lately I&#8217;ve started using <a href=\"http://pumpup.co/\" target=\"_blank\">PumpUp</a> to get new exercises and to get out of another plateau.</p>\n<p>The morning workouts ballooned to an hour and a half. Just over an hour if I completely destroy myself and barely take a moment to breathe.</p>\n<p>And so I became one of those nutters that spends at least an hour a day working out. Three hours on a good day &#8230;</p>\n<p>But hey, at least I&#8217;m in shape for the inevitable zombie apocalypse or robot uprising. Right?</p>\n<div class=\"zemanta-pixie\" style=\"margin-top: 10px; height: 15px;\"><a class=\"zemanta-pixie-a\" title=\"Enhanced by Zemanta\" href=\"http://www.zemanta.com/?px\"><img class=\"zemanta-pixie-img\" style=\"border: none; float: right;\" src=\"http://img.zemanta.com/zemified_e.png?x-id=4e72e8c8-dd1e-4284-bed2-f6bbaec992ac\" alt=\"Enhanced by Zemanta\" /></a></div>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"c6805f0f-bdb9-50a3-ab4c-8c1ec4524d79"}}