{"data":{"wordpressPost":{"title":"Switching to feed readers","content":"<p>When I was redesigning my blog I had the marvelous idea of adding a reBlog widget to the sidebar on the left. The main reason behind this idea was that since my readers hopefully enjoy what i have to say they might also enjoy giving a glance or two to the things I read myself, seeming as how when it comes to authors of published works people are always interested in seeing where the influence and ideas come from. Therefore I decided to simplify this process for people and a conventional blogroll simply wasn&#8217;t enough.</p>\n<p>Why it wasn&#8217;t enough, though, is a complex reason. Mainly I find them to be overly static, quite boring and rarely attracting any sort of attention. My reBlog feature on the other hand is useful to make my website a tad more dynamic, which is something google and other search engines love very much. it also serves as a simple way to be quickly involved in any buzz going through the blogosphere &#8230; also raising hits.</p>\n<p>The most profound change in my life coming from adding reblog was that it suddenly made me realise how awesome feed readers are. I was probably wasting several hours daily on making sure I kept up to date on everything from slashdot to different blogs and more often than not I&#8217;d simply forget about a blog or two and then be happily surprised when I found them again later. This is why I promptly installed <a href=\"http://akregator.kde.org/\" target=\"_blank\">Akregator</a> on my home computer and <a href=\"http://www.vienna-rss.org/\" target=\"_blank\">Vienna</a> on my mac.</p>\n<p>Vienna I don&#8217;t like so much, it&#8217;s better than others but I do have my qualms. Akregator is rather awesome though and now my life is simpler. So here&#8217;s to a simpler life via RSS feeds!</p>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"7698e1e8-3374-548e-8283-2320309877a6"}}