{"data":{"wordpressPost":{"title":"Language","content":"<p>After my third cup of tea in twenty minutes I was still wasted. Emacs staring me down, terminal blaring with test failures, social networks bleeping and blapping for attention, coworkers daring to make sounds. Music was annoying.</p>\n<p><em>&#8220;for starters just make a collection and write some tests&#8221;</em>, I wrote down in my notebook. I stared at the words for five minutes.</p>\n<p>I knew what I wanted to do. I knew how to do it. I couldn&#8217;t do it. I just sat there, staring at those 10 words.</p>\n<p><em>&#8220;Lollobrigida&#8221;</em>, a tiny voice in the back of my mind whispered.</p>\n<p><iframe src=\"//www.youtube.com/embed/-W4rXdz319o\" height=\"360\" width=\"640\" allowfullscreen=\"\" frameborder=\"0\"></iframe></p>\n<p>So I put them on.</p>\n<p>I fell in love with Lollobrigida at last year&#8217;s EXIT festival. The energetic stage performance, sexy vocals and funny lyrics in a language I only used to know from jokes won me over.</p>\n<p>In the next few hours I banged out two new features from scratch. Alone in my world with only Emacs and Lollobrigida for company the world could be crumbling around me and I wouldn&#8217;t notice.</p>\n<img alt=\"\" src=\"https://www.filepicker.io/api/file/7sfFwonuTcC5KdBhmcBP\" />\n<p>Lollobrigida wasn&#8217;t English. That&#8217;s all it took. Something not-English blasting in my ears.</p>\n<p>I&#8217;m not one to shy away from using English, after all I&#8217;ve been writing this blog in English for years, the books I&#8217;m writing are English, most of my Twitter posts are English, even the online forum I&#8217;ve been a part of for 8 years is English.</p>\n<p>Hell, anyone who knows me will tell you the language I usually speak is a mix between English and Slovenian. When I can&#8217;t think of a word in one language I&#8217;ll simply use the other. I often begin my sentences in Slovenian and switch to English half-way through because it flows better or expresses a concept better.</p>\n<p>A favourite drinking game in my group of friends is banning English from the conversation. It&#8217;s pretty brutal.</p>\n<p>But here in the US I can&#8217;t do that. These four weeks mark the longest streak I&#8217;ve ever had of using only one language. There&#8217;s simply nobody around who speaks Slovenian.</p>\n<p>It&#8217;s tiring.</p>\n<p>When I talk and a word doesn&#8217;t immediately come to mind, I can&#8217;t just switch to a different language, I have to stop and think until a synonym comes to mind or somebody helps me out. I always have to be vigilant about what I&#8217;m saying because when I&#8217;m tired and we&#8217;re just hanging out, I often almost say something Slovenian, bite my tongue midway through and say it in English.</p>\n<p>I don&#8217;t think anyone&#8217;s noticed though. If they have, they haven&#8217;t mentioned it.</p>\n<p>But Lollobrigida relaxed my brain, even though it&#8217;s in Croatian &#8211; a language I was convinced I didn&#8217;t know until last year I suddenly realised it&#8217;s actually rather understandable. The trips to Serbia and then Croatia and Bosnia and in winter again Bosnia and then Serbia confirmed that, yup, I understand the language. Can almost speak it now.</p>\n<p>No idea where or how I learned, but it seems to relax my brain just because it&#8217;s much more similar to Slovenian than English, even though English is far more familiar.</p>\n<p>Strange.</p>\n<p>Considering how second nature English is to me and how much I use it every day, I would never have thought using it exclusively could be a problem. But there you go. The problems almost-bilinguals face &#8230;</p>\n<p><iframe src=\"//www.youtube.com/embed/Gi8Fx2EPDfw\" height=\"360\" width=\"640\" allowfullscreen=\"\" frameborder=\"0\"></iframe></p>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"5fa14c5a-b54a-5a49-b604-7a7025862eb6"}}