{"data":{"wordpressPost":{"title":"First JavaScript meetup in Ljubljana is right around the corner","content":"<a href=\"http://www.flickr.com/photos/lamantin/5143354092/sizes/m/in/photostream/\"><img class=\"alignnone\" title=\"Cupcakes by lamantin\" src=\"http://farm5.staticflickr.com/4040/5143354092_9aef18b63e_o.png\" alt=\"Cupcakes by lamantin\" width=\"640\" height=\"425\" /></a>\n<p>A while ago I realized that whenever someone asks me if I know any javascript developers, I always come up empty. Shame on me! Using a technology heavily for many years and not really knowing anyone from the community.</p>\n<p>That&#8217;s why I decided to organise a meetup! The first purely Javascript event in Ljubljana. Sure there have been barcamps and webcamps and mobilecamps &#8230; plenty of occasional Javascript users come to those, but that&#8217;s not what we&#8217;re on about here. This time we want to focus on people who use Javascript <em>a lot</em>.</p>\n<p><span style=\"font-size: 1.2em;\"><a href=\"http://www.meetup.com/Ljubljana-JavaScript-User-Group/events/112046942/\" target=\"_blank\">Come join us</a> on the 30th of April at 7pm in Kiberpipa! It&#8217;s gonna be fun!</span></p>\n<p>People doing full stack Javascript, or writing fancy frontend apps in various MV* frameworks. That sort of stuff. It&#8217;s time the community gets to know each other, or at least for me to find the community. 🙂</p>\n<p>I&#8217;m happy to announce that after weeks of effort (read: remembering to send an email or tweet a link once in a while) we finally have four presenters, free beer and plenty of people who promised they&#8217;d make it. Hooray!</p>\n<p>There&#8217;s even going to be a lady giving one of those talks! That one did actually take a lot of effort to find &#8230; I don&#8217;t know what is it with girls, but it sure is difficult to find some willing to give a talk about something cool in front of a bunch of dudes. We&#8217;re not that scary, are we?</p>\n<p>Here&#8217;s the list of talks:</p>\n<ul>\n<li>AngularJS (<a href=\"https://twitter.com/bancek\">Luka Zakrajsek</a>)</li>\n<li>Frontend testing with Casperjs (<a href=\"https://twitter.com/robertbasic\">Robert Basic</a>)</li>\n<li>MV* libraries (Jana Bergant)</li>\n<li>Bare Metal Coding: Optimising Your Javascript for Leaner, Meaner Performance (<a href=\"https://twitter.com/krofdrakula\">Klemen Slavič</a>)</li>\n</ul>\n<p>There are also going to be cupcakes!</p>\n<p>What do you think a JavaScript Cupcake should look like? I really need your help with this one. Google doesn&#8217;t have a single idea. Imagine that, all these years and nobody&#8217;s tried to design a javascript cupcake before.</p>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"de16abcd-69a7-5150-8dbb-a4810ae4a874"}}