{"data":{"wordpressPost":{"title":"A King was happy to give me his palace","content":"<div class=\"zemanta-img\" style=\"margin: 1em; display: block;\">\n<div>\n<dl class=\"wp-caption alignright\" style=\"width: 250px;\">\n<dt class=\"wp-caption-dt\"><a href=\"http://www.flickr.com/photos/42619839@N00/128671367\"><img title=\"dark_is_bad? [or matches how you felt before?]\" src=\"http://farm1.static.flickr.com/46/128671367_39fadce25e_m.jpg\" alt=\"dark_is_bad? [or matches how you felt before?]\" width=\"240\" height=\"219\" /></a></dt>\n<dd class=\"wp-caption-dd zemanta-img-attribution\" style=\"font-size: 0.8em;\">Image by <a href=\"http://www.flickr.com/photos/42619839@N00/128671367\">johnbullas</a> via Flickr</dd>\n</dl>\n</div>\n</div>\n<p>There I was, smack in the middle of the most lavishly decorated palace I&#8217;ve ever been to! The king was giddily showing me around and nearly popped his eyes out with happines when he was about to show me all the secret passageways and corridors that he oh so secretly uses to get to the maids quarters. Wonder why. Calmly though I refused, I said <em>Oh no dear king, I&#8217;d already seen all this last year as a tourist. Paid extra for the special tourguide.</em></p>\n<p>But Swizec! I want to show you all of this before it&#8217;s yours, I cannot give away just the palace and not its secrets, I cannot!</p>\n<p><em>Alright kingy show me.</em></p>\n<p>To be honest, like with many people I regularly chat to, I had no idea whether I knew him from somewhere or not. He was acting like we were friends, so I acted like we were friends. How should I know better? Maybe we&#8217;ve seen each other on twitter or something &#8230;</p>\n<p>Then to celebrate the king&#8217;s giving away his palace and my receiving the palace, don&#8217;t know where the gf was in all this, we went to a <a class=\"zem_slink\" title=\"Marilyn Manson\" rel=\"wikipedia\" href=\"http://en.wikipedia.org/wiki/Marilyn_Manson\">Marilyn Manson</a>, let&#8217;s call him Empty Suit and I&#8217;ll tell you why later, concert with Empty Suit and some of my old classmates from primary school. Guess the king knew them too or something.</p>\n<p>There we were, going to a concert, calmly shrugging away the usher who wanted trouble and went into our special lodge. Best, and worst, thing about this lodge was that you couldn&#8217;t see the stage at all because of how it was cooped up in the corner of a ceiling.</p>\n<p>Empty Suit seemed really distressed and sad about being at his concert, he felt depressed that he was the only adult person left to like his music and was afraid we&#8217;d make fun of him if she admited to it. To make him feel better I grabbed him by the shoulders &#8211; and it felt like grabbing an empty suit &#8217;cause he&#8217;s so skinny &#8211; and said <em>Let&#8217;s go drinking!</em></p>\n<p><em></em>We did. But somehow he managed to get drunk the moment we left our lodge and decided he didn&#8217;t care one bit whether we make fun of him or not. Empty Suit started dancing and flailing his skinny limbs in odd configurations, his <a class=\"zem_slink\" title=\"Platform boot\" rel=\"wikipedia\" href=\"http://en.wikipedia.org/wiki/Platform_boot\">platform boots</a> making him look like a spider on drugs. The young bastards all around him started mimicking his moves and soon enough everyone was looking rather much like an idiot.</p>\n<p>Then I woke up and had a shower.</p>\n<div class=\"zemanta-pixie\" style=\"margin-top: 10px; height: 15px;\"><a class=\"zemanta-pixie-a\" title=\"Zemified by Zemanta\" href=\"http://reblog.zemanta.com/zemified/2aced468-abc9-4e45-a251-b456c702bd7d/\"><img class=\"zemanta-pixie-img\" style=\"border: none; float: right;\" src=\"http://img.zemanta.com/reblog_e.png?x-id=2aced468-abc9-4e45-a251-b456c702bd7d\" alt=\"Reblog this post [with Zemanta]\" /></a><span class=\"zem-script more-related\"><script src=\"http://static.zemanta.com/readside/loader.js\" type=\"text/javascript\"></script></span></div>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"d470dd55-ac13-5a4c-8689-4c3a90d19b5c"}}