{"data":{"wordpressPost":{"title":"Why offices are where work goes to die","content":"<p>They say that in an early stage startup we should all sit together in a big room while working. They say it increases collaboration.</p>\n<p>And it does. There&#8217;s more collaboration. But it&#8217;s of a lower quality and almost completely useless.</p>\n<p>After a super productive year of working from home &#8211; 4 major client engagements, 1 book, 1 video course, countless blogposts &#8211; I started going to an office again.</p>\n<p>Here&#8217;s what my typical day at the office looks like:</p>\n<p><strong>10:12am</strong> &#8211; roll in after having to stop writing just as it started flowing<br />\n<strong>10:30am</strong> &#8211; tea is ready, Emacs is running, work can start<br />\n<strong>10:35am</strong> &#8211; <em>&#8220;Hey did you check my PR?&#8221;</em>, coworker<br />\n<strong>10:50am</strong> &#8211; finish leaving many comments on PR<br />\n<strong>10:51am</strong> &#8211; start priming brain on what I have to work on<br />\n<strong>11:00am</strong> &#8211; <em>&#8220;Oh no hey, you misunderstood, all those PR things are actually correct&#8221;</em>, coworker<br />\n<strong>11:01am</strong> &#8211; <em>&#8220;Oh okay then, let me just merge that&#8221;</em>, <em>me</em><br />\n<strong>11:05am</strong> &#8211; <em>&#8220;Oh hey I just noticed you didn&#8217;t check my PR&#8221;</em>, <em>me</em> to coworker<br />\n<strong>11:06am</strong> &#8211; <em>&#8220;Sure, I&#8217;ll do that eventually, just assume it&#8217;s merged for now&#8221;</em>, coworker<br />\n<strong>11:15am</strong> &#8211; found the perfect music to match code, getting into it<br />\n<strong>11:25am</strong> &#8211; <em>&#8220;Hey can you look at this?&#8221;</em>, intern<br />\n<strong>11:40am</strong> &#8211; write first line of code 2 hours after coming in<br />\n<strong>11:50am</strong> &#8211; <em>&#8220;Shit, what did we say we needed to do here?&#8221;</em>, <em>me</em> to coworker<br />\n<strong>12:15pm</strong> &#8211; after briefly distracting the designer, the biz ops guy, and another two engineers, have a less muddy idea of what the thing should do<br />\n<strong>12:30pm</strong> &#8211; fuck, I&#8217;m hungry<br />\n<strong>12:35pm</strong> &#8211; stop working, start arranging to go for lunch<br />\n<strong>12:50pm</strong> &#8211; find compatriots to go to lunch<br />\n<strong>13:30pm</strong> &#8211; tea is ready, get to work<br />\n<strong>14:13pm</strong> &#8211; <em>&#8220;I got the thing done, I think, is this what it needs to do?&#8221;</em>, intern<br />\n<strong>14:35pm</strong> &#8211; after teaching the intern some theory and explaining how to apply it to our use case, make another cup of tea<br />\n<strong>15:01pm</strong> &#8211; <em>&#8220;Hey did the intern get that thing done, I need it now?&#8221;</em>, coworker<br />\n<strong>15:45pm</strong> &#8211; fuck the nearest Starbucks closes in 15 minutes and I&#8217;m getting hungry anyway<br />\n<strong>16:20pm</strong> &#8211; get back to work, re-sync with coworker about what I&#8217;m doing and what he&#8217;s doing<br />\n<strong>16:50pm</strong> &#8211; <em>&#8220;I got the new UX done for that thing that you own, do we have clarity on everything now?&#8221;</em>, designer<br />\n<strong>17:10pm</strong> &#8211; stop talking to designer, back to coding<br />\n<strong>17:55pm</strong> &#8211; fuck, I have to dash off to go boxing<br />\n<strong>18:15pm</strong> &#8211; leave office after answering one quick question to the intern, and syncing with coworker on how things are going</p>\n<p>Eight hours of office time. Two, maybe three, hours of sporadic coding. Very sporadic coding. Yay offices are great.</p>\n<p>Here&#8217;s what went wrong:</p>\n<h2 id=\"1:verbalcommunicationisnotself-documenting\">1: Verbal communication is not self-documenting</h2>\n<p>Did you notice? Every conversation in my example started with somebody not remembering the details of a previous conversation. Yes I hyperbolized, but it&#8217;s not far from truth.</p>\n<p>I don&#8217;t have hard numbers, but it <em>feels</em> like most conversations in the office start like that. <em>&#8220;Hey what did we say about X?&#8221;</em>, <em>&#8220;Errm, how did you say that module works?&#8221;</em>, <em>&#8220;What&#8217;s that config option again?&#8221;</em> &#8230;</p>\n<p>An endless stream of conversations rehashing previous conversations.</p>\n<p>When you talk in chat or in email or in anything but face-to-face, the conversation is self-documenting. You can always go back and see what somebody said. You can search the conversation.</p>\n<p>You can come to an agreement about something, then refer back to it two months from now if you need to. Or just an hour from now. Text is great.</p>\n<p>Hell, <a href=\"https://scholar.google.com/scholar?hl=en&amp;q=human+memory+fallible&amp;btnG=&amp;as_sdt=1%2C5&amp;as_sdtp=\">many studies</a> have shown that human memory is extremely fallible and we can&#8217;t remember most of the things we talked about. We just think we can. But in reality something like 80%, if not more, of our memories are complete fabrication retrofitted into a story we told ourselves.</p>\n<p>At an office, we throw self-documenting tools away and rely on fallible humans. In the name of better collaboration. Right.</p>\n<h2 id=\"2:everyonecantalktoanyoneatanytime\">2: Everyone can talk to anyone at any time</h2>\n<p>Another issue you&#8217;ll notice in my not all that hyperbolic example is that impromptu meetings happen all day every day. If a meeting is any time two people talk for more than five minutes, then I was six meetings that day.</p>\n<p>Six meetings ranging from 5 to 30 minutes. That&#8217;s too many meetings. And not a single block on the <a href=\"http://swizec.com/blog/why-programmers-work-at-night/swizec/3198\">maker&#8217;s schedule</a>.</p>\n<p>Fuck, man, how could <em>anyone</em> get any work done that way?</p>\n<p>And I am just as much to blame for starting those impromptu meetings as my intern or any of our coworkers. When everyone&#8217;s together in an office, it&#8217;s just too easy.</p>\n<p>Of course you&#8217;re going to bother the person sitting right next to you as soon as you have a question. Especially when part of their job is to help you. I mean why wouldn&#8217;t you? Isn&#8217;t that the whole reason you&#8217;re at an office in the first place?</p>\n<p>Sure, you could schedule a meeting, but you don&#8217;t really have a whole meeting of stuff to say do you? And it feels too rigid and too enterprisey. We&#8217;re a startup, man. We like each other.</p>\n<p>Even if you do schedule a meeting, there&#8217;s no telling when it will happen. It might be 5 minutes before the schedule, or 15 minutes after, if somebody gets snagged in a thing. We&#8217;re all there, it&#8217;s all good, we can handle it.</p>\n<p>That doesn&#8217;t work if you&#8217;re remote and talking through Skype or Hangouts. When a meeting is set to happen, it <em>happens</em>. With a minute accuracy. People have shit to do.</p>\n<p>At an office we throw away structure and predictability for chaos and disarray. In the name of better collaboration. Right.</p>\n<h2 id=\"3:nobodytakesthetimetocommunicatewell\">3: Nobody takes the time to communicate well</h2>\n<p>A follow on issue is that because communication is so easy, nobody values communication. It&#8217;s there. It&#8217;s always available. If something is unclear, you can always ask again later.</p>\n<p>You see, when people write, they think. They weigh what they&#8217;re saying, they consider how it comes across, they go back and edit and change what they said.</p>\n<p>In short, they put value and effort into their words.</p>\n<p>I don&#8217;t know why exactly people care more about what they write than what they say, but it works. When somebody has to write an email, they make bloody well sure that it&#8217;s clear and well thought out. Especially when they know the other person is going to read it hours from now and will have to understand what you want from them.</p>\n<p>I think it&#8217;s because everyone knows that context and emotion and body language and all those meta things that we get in verbal communication for free, don&#8217;t always translate well to text. But the side-effect is that they write with more clarity. It&#8217;s pretty great.</p>\n<p>Yes, there are times when it&#8217;s better to drop into a face-to-face conversation. Like when you have to discuss something highly interactive, or you have to bounce ideas off of one another. But those times are rare.</p>\n<p>The only major drawback to written communication I can think of is that when people write something down, they commit to it. It becomes clear in their minds. And their minds become difficult to change. When they&#8217;re wrong, and you tell them they&#8217;re wrong, they will dig their heels in and fight back.</p>\n<p>But again, the main effect that&#8217;s got is that they think long and hard before they write.</p>\n<p>At an office we replace clarity and well thought out words with chaos, muddled thoughts, and low signal to noise ratios. In the name of better collaboration. Right.</p>\n<h2 id=\"officelogisticsblow\">Office logistics blow</h2>\n<p>But I guess all my points about chaotic collaboration have decent solutions. You can take notes when you&#8217;re talking to people, even though nobody does. You could schedule real meetings, even though it feels too corporate. You could encourage people to think more and speak less, even though egos are big and this is hard.</p>\n<p>The one thin you can&#8217;t solve though, is all the time you&#8217;re wasting on just being there.</p>\n<p>When you work from home, your office is a 30 second walk away from your kitchen. Your kitchen is stocked with all your favorite things. You can cook delicious foods because it doesn&#8217;t bother anyone. And you&#8217;re wearing your comfy clothes and have total peace and quiet all day.</p>\n<p>Okay, San Francisco culture means you can be in comfy clothes at an office as well.</p>\n<p>But someone&#8217;s always ramping up the cold or the heat. There&#8217;s no real food anywhere. You can&#8217;t cook, going out to eat every day is expensive and unhealthy, and bringing meal prep to the office every day is a bother.</p>\n<p>And I guess I can deal with all of that. I can change my habits, I can fill the commute with audiobooks, and I can put on more clothes when I&#8217;m cold.</p>\n<p>But what sucks the most is that ever since I started working at an office, I&#8217;ve had to slash my already thin social life. Dealing with people at the office all day saps all of my energy.</p>\n<p>I&#8217;m an introvert and being forced to spend 8+ hours a day surrounded by people leaves me feeling like a wet rag. When I come home, I can&#8217;t get back to important work. I can&#8217;t write. I can&#8217;t do anything. All I want is just to be alone.</p>\n<p>And that alone time is hard to find.</p>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"74c895fd-3579-55f5-aef6-86f84af4d6e6"}}