{"data":{"wordpressPost":{"title":"I Got Schooled","content":"<figure>\n<img src=\"http://i.imgur.com/F5ryCT5.png\" alt=\"\" /><br />\n</figure>\n<p>Steve&#8217;s right. He got the last email in my 10-day email sequence, and it doesn&#8217;t even link back to my site. It’s my very last chance at a sale before I shut up about <a href=\"https://swizec.com/reactd3js/\">The Book</a> and send you only the regular emails that I send.</p>\n<p>And yet, no link. Nothing for you to do but to focus on my failings and answer the question <em>&#8220;Why didn&#8217;t you open your wallet? Don&#8217;t you want it?&#8221;</em></p>\n<p>1.2% of recipients who get that far unsubscribe. That&#8217;s 8 people. Of course, only 45% even open the email. That&#8217;s 294 people.</p>\n<p>4.5% reply. That&#8217;s 29 people in the five months.</p>\n<p>This is the only email in the whole sequence with a reply rate higher than 0.0%. </p>\n<p>But no sales.</p>\n<p>At least, none that I can attribute to this email. Hell, none of my sales get attributed to any of these emails. Gumroad lumps it all together with Direct, anyway.</p>\n<p>49 sales from Direct/Email/IM vs. 316 sales from the landing page itself.</p>\n<figure>\n<img src=\"http://i.imgur.com/cGHt0lV.png\" alt=\"\" /><br />\n</figure>\n<p>The conversion rate also looks much better without the emails. ?</p>\n<p>And yet, a significant amount of traffic coming to the website originates in email. Just under 9%.</p>\n<figure>\n<img src=\"http://i.imgur.com/DfwSxBc.png\" alt=\"\" /><br />\n</figure>\n<p>I have no idea where all those Direct users come from. It&#8217;s not like anyone types <a href=\"https://swizec.com/reactd3js/\">swizec.com/reactd3js</a> into their browser. That would be strange. </p>\n<p>Well, okay. <em>I</em> type it in all the time when I check stuff. But I’m pretty sure I&#8217;m the only person in the world who does that.</p>\n<p>Could those 8,603 people come from email as well? If they are, that changes things. It makes the intricate email marketing setup worth it. ?</p>\n<p>I mean, with that one FB Lead Ad that I have running, I&#8217;m paying $1.20 for each of those leads. And I just found out that I stupidly have double opt-in set up, and many people never actually sign up after already costing me a conversion on Facebook.</p>\n<p>Not that I&#8217;m complaining about one dollar, but that shit ads up.</p>\n<p>I have no idea what I&#8217;m doing, obviously. But sometimes I get emails like this, and that gives me hope:</p>\n<figure>\n<img src=\"http://i.imgur.com/5MRoXQc.png\" alt=\"\" /><br />\n</figure>\n<p>PS: the email with the most unsubscribes says <em>&#8220;Yo, look at all these other people who liked my thing&#8221;</em> and shows some testimonials &#8211;&gt; 1.9% unsubscribes. ¯\\_(ツ)_/¯</p>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"ad8f233d-15e9-5d95-a533-621802d4e989"}}