{"data":{"wordpressPost":{"title":"London 2","content":"<p>\nToday started off with a bang as I got my first internet fix in a while and made the previous blog post. It continued with a whole new way of eating breakfast, at least for me, since I don&#39;t usually eat anything in the morning. Guess traveling changes that.\n</p>\n<p>\nI pranced around the streets having no clear direction or current location in mind when I was looking for a cash machine. Suddenly I found myself next to a sign saying &quot;Camden Town Hall&quot; &#8230; luckily there was a cash machine right next to it and, as was hoped and expected, my Slovene plastic money works in London as well (later we found out it works for direct purchases as well). Walking around London is great.\n</p>\n<p>\nWhen I managed to navigate the tubes to what I&#39;d deem the dead center of London I did my best to see as many sights as possible. There was Big Ben, Buckingham Palace and so on. The best of them all was, without a doubt, Westminster Abbey. The 7 quid admissoin fee feels awful at first, but it&#39;s utterly worth it when you realise just how big the place actually is, and it&#39;s bloody huge. What I thought would be more of a church turned out to be more of a burial site for the rich and important. There were early kings, Richard the Lionheart and such, very old graves too, some were about 700 years old even. Best was the Poet&#39;s corner with Chaucer&#39;s tomb and many other an important writer.\n</p>\n<p>\nTower bridge and Tower of London were a bit of a let down because I got there too late to get in and the Eye of London was a complete ripoff at 15 quid, sure the view was pretty, but damn not for that price eh.\n</p>\n<p>\nIt&#39;s also impressively difficult to find a place of tea buying and drinking when you don&#39;t know what to look for and just randomely blunder around trying to look like you know what you&#39;re doing. It also makes your legs very very sore in the evening &#8230; damn walking.</p>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"1b701bfd-e2e1-57b8-8f32-8b8eb54a99dc"}}