{"data":{"wordpressPost":{"title":"Why an internet diet and not cold turkey","content":"<p>Two days ago <a title=\"My ideas are shitty so I’m going on an internet diet\" href=\"http://swizec.com/blog/my-ideas-are-shitty-so-im-going-on-an-internet-diet/swizec/2239\">I went on an internet diet</a> and a whole lot of <a title=\"I learned two things today 17.8.\" href=\"http://swizec.com/blog/i-learned-two-things-today-17-8/swizec/2244\">people heard about it</a>. Flaking out is simply not an option.</p>\n<div style=\"width: 410px\" class=\"wp-caption alignright\"><img title=\"Man in box\" src=\"http://www.theage.com.au/ffxImage/urlpicture_id_1063625039656_2003/09/16/blaine,0.jpg\" alt=\"\" width=\"400\" height=\"258\" /><p class=\"wp-caption-text\">Man in box</p></div>\n<p>I may have turned into one of those curiosities, like a guy who puts himself in a glass box in the middle of a square and claims he will live in there for a week &#8230; people are intrigued by idiots doing idiotic stuff.</p>\n<p>While a few people applauded my effort, a lot of readers came out to tell me I&#8217;m Doing It Wrong &#8482;. That my list of rules is too permissive and won&#8217;t let me achieve whatever I set out to achieve (I don&#8217;t even know, I&#8217;m just seeing what happens, honest).</p>\n<p>Because the hour a day is too short to respond to everyone, let me try explaining the reasons behind every item on the list 🙂</p>\n<h2>as a coding reference, the internet is ok</h2>\n<p>Here&#8217;s the thing, I&#8217;m a programmer, in an average day I work in four-ish different languages across at least three distinct pieces of technology. Some of which is changing so rapidly any offline resources I could find would be woefully out of date before even reaching the printer. Sometimes I need to pick up a new piece of technology quickly, it would be impossible to download docs in advance.</p>\n<p>I can&#8217;t let experiments like these affect what I do for a living. No go.</p>\n<h2>wikipedia is alright, but keep it down</h2>\n<p>I am about to enter exam season. Wikipedia has proven to be the single best source for studying large swaths of computer science and mathematics. Normal reading material just isn&#8217;t enough. I&#8217;m not talking about mindlessly browsing here, I&#8217;m just trying to avoid wastingtime whenever I want to make sure I understand something.</p>\n<h2>I will continue writing my blog</h2>\n<p>A few months ago I set a goal to myself to reach 20k monthly readers of this blog by the end of the year. If I don&#8217;t keep writing it this goal has no hope of being reached. I am doing my best to fit blogging into the hour of internet I have a day.</p>\n<p>I love writing and it&#8217;s something I have to do regularly &#8230; might as well publish it somewhere, see how people like it, get feedback, improve.</p>\n<h2>using <a href=\"http://750words.com\" target=\"_blank\">750words.com</a> every morning is good</h2>\n<p>This barely counts as internet. It&#8217;s just somewhere I write what&#8217;s on my mind every morning for nobody to ever read. But it keeps score and I don&#8217;t want to break a 110 day streak.</p>\n<h2>there will be at most an hour every evening of HN/fb/twitter/email</h2>\n<p>For a guy who is online 24/7 going to just an hour of internet is &#8230; huge. I need to keep up with email because I have clients and stuff, twitter/fb are because I need a way of keeping in touch with people, especially because the exam season means I won&#8217;t be able to meet them in person much. Similar to email, I have to respond to people talking to me on Twitter.</p>\n<p>And HN &#8230; well I don&#8217;t absolutely need need that, but I want to at least skim the titles on the frontpage to keep a grip on reality a bit.</p>\n<p>Oh and those complaining I&#8217;m on twitter outside the hour. I use <a href=\"http://bufferapp.com\">Buffer</a> to schedule tweets 😉</p>\n<h2>if something absolutely spectacular happens you are allowed to tweet, no reading outside the hour!</h2>\n<p>Some news just shouldn&#8217;t be kept to myself. What if I see aliens? Or <a title=\"I learned two things today 14.8.\" href=\"http://swizec.com/blog/i-learned-two-things-today-14-8/swizec/2207\">meet a celebrity</a>? This is again part of that whole &#8220;keeping in touch&#8221; thing.</p>\n<h2>checking in to foursquare is questionable &#8230; perhaps ban it?</h2>\n<p>Foursquare is arguably useless, but I want to check-in to places. If I go missing or something weird happens to me, at least people know where to start looking. And I like having a history of uninteresting places I have visited.</p>\n<h2>skype is ok</h2>\n<p>I don&#8217;t use a phone.</p>\n<p>Skype is honestly my only means of communication with anyone. Especially now that I&#8217;ve banned twitter for most of the day &#8230; twitter used to be the only reliable means of reaching me in a hurry.</p>\n<h2>Fin</h2>\n<p>So there you have it. I hope that clears up some of the issues everyone had with my little experiment. And hey, if you think you can do better, you&#8217;re welcome to try. We can compare notes 🙂</p>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"214e1329-396a-53ea-bf66-40e2d3b60f11"}}