{"data":{"wordpressPost":{"title":"How to think of your business logic as data","content":"<p>I&#8217;ll never forget this lesson I learned from a friend in 6th or 7th grade.</p>\n<p>We were building our own Windows clone. In <a href=\"https://en.wikipedia.org/wiki/Turbo_Pascal\">Turbo Pascal</a>, running in <a href=\"https://en.wikipedia.org/wiki/DOS\">DOS</a>, using a <a href=\"https://en.wikipedia.org/wiki/Text-based_user_interface\">textual user interface</a> because we didn&#8217;t know how to do graphics.</p>\n<p>If you&#8217;re too young to know about textual user interfaces, they looked like this:</p>\n<img src=\"https://upload.wikimedia.org/wikipedia/commons/c/c5/Fdedit.png\" />\n<p>It&#8217;s got windows, buttons, a mouse cursor, and everything else you&#8217;d want in a modern user interface. Except graphics. It&#8217;s all made with ASCII characters.</p>\n<p>I used to know the ASCII table by heart by back then 🤓</p>\n<p>Now, when I say <em>we</em> were building a new Windows, I don&#8217;t mean working together on a single project. We didn&#8217;t know how to do that. There was no Git or CVS or SVN back then. At least not that we knew of. The best we could do back then was to use diskettes to borrow each other&#8217;s code.</p>\n<p>Oh, we also didn&#8217;t know about putting code in multiple files, so that was fun.</p>\n<p>Anyway, the lesson he taught me about business logic being data came when we were both implementing our top row navigation. Like a menu, but for your whole system.</p>\n<p>Oh yes, we built dropdown menus and everything. It&#8217;s amazing what a 13 year old with infinite free time can build in a few months.</p>\n<h2>Avoid encoding business logic in the shape of your program</h2>\n<p>Let&#8217;s say you have 6 items. <code>File</code>, <code>Edit</code>, <code>Format</code>, <code>View</code>, <code>Window</code>, and <code>Help</code>. That&#8217;s what iA Writer has.</p>\n<p>Now let&#8217;s say you want to have a user action that goes through these items. My system used <code>left</code> and <code>right</code> arrow keys, my friend liked <code>j</code> and <code>k</code>, while MacOS relies on mouse alone.</p>\n<p>You could build navigation like this:</p>\n<pre lang=\"javascript\">\nonLeftKeyPress() {\n    if (currentMenu === \"File\") {\n        goTo(\"Help\")\n    }else if (currentMenu === \"Edit\") {\n        goTo(\"File\")\n    }else if (currentMenu === \"Format\") {\n        goTo(\"Edit\")\n    }else if (currentMenu === \"View\") {\n        goTo(\"Format\")\n    }else if (currentMenu === \"Window\") {\n        goTo(\"View\")\n    }else if (currentMenu === \"Help\") {\n        goTo(\"Window\")\n    }\n}\n\nonRightKeyPress() {\n    if (currentMenu === \"File\") {\n        goTo(\"Edit\")\n    }else if (currentMenu === \"Edit\") {\n        goTo(\"Format\")\n    }else if (currentMenu === \"Format\") {\n        goTo(\"View\")\n    }else if (currentMenu === \"View\") {\n        goTo(\"Window\")\n    }else if (currentMenu === \"Window\") {\n        goTo(\"Help\")\n    }else if (currentMenu === \"Help\") {\n        goTo(\"File\")\n    }\n}\n</pre>\n<p>Nothing wrong with that. It&#8217;s readable, gets the job done, everything&#8217;s perfect. You congratulate yourself on an engineering problem well solved.</p>\n<p>Then the PM comes in and says, <em>&#8220;We&#8217;ve been running tests, and this sequence doesn&#8217;t really work. Let&#8217;s change the order.”</em></p>\n<p>Uh-oh.</p>\n<p><em>&#8220;Oh, and we want different apps to have different menus.&#8221;</em></p>\n<p>💩</p>\n<p>Now you have to rewrite that whole logic for every app. Every time the PM decides to change the order. That&#8217;s not fun at all!</p>\n<p>So here&#8217;s what you can do instead.</p>\n<pre lang=\"javascript\">\nitems = [\"File\", \"Edit\", \"Format\", \"View\", \"Window\", \"Help\"]\ncurrentItem = 0\n\nonLeftKeyPress() {\n    currentItem -= 1;\n    if (currentItem < 0) currentItem = items.length-1;\n    goTo(items[currentItem]);\n}\nonRightKeyPress() {\n    currentItem += 1;\n    if (currentItem >= items.length) currentItem = 0;\n    goTo(items[currentItem]);\n}\n</pre>\n<p>Array of options, pointer to current selection, move pointer when user does something. Now we&#8217;re talking!</p>\n<p>With this approach, your system is flexible. You can change ordering, add elements, remove elements, even have different lists for different apps or users. It&#8217;s great.</p>\n<p>No difficult refactoring every time your PM changes their mind, just a data change.</p>\n<h2>But Swizec, nobody builds keyboard menus anymore!</h2>\n<p>That&#8217;s true! People don&#8217;t use keyboards as much as they used to. My whole thing above is pointless when a user can directly tap or click whatever they want.</p>\n<p>But we still live in a world of sequental flows. More than ever, things are designed as user flows that go backwards or forwards. Onboarding flows are a good example.</p>\n<p>Screen1: &#8220;Hai&#8221;, Screen2: &#8220;Our app does X&#8221;, Screen3: &#8220;Sign up&#8221;, Screen4: &#8220;Gives us your phone number&#8221;, Screen5: &#8220;Credit card maybe?&#8221;, Screen6: &#8220;Do The Thing&#8221;</p>\n<p>I simplify, but many apps have that flow.</p>\n<p>You can build it as a hard-coded sequence of steps where each step must know who to call next. When your PM experiments, you&#8217;re in for a world of heavy refactoring.</p>\n<p>I had fun like that just this week. Not my fault even! Others on the team decided to build it the not-data way, and now we all suffer. I&#8217;m sure they will learn their lesson soon 🙂</p>\n<h2>But Swiz, my flow has branches and shit</h2>\n<p>So?</p>\n<p>You&#8217;re going to go into your super fancy logic and insert a bunch of if statements all the time?</p>\n<p>if goNext and currentScreen is &#8216;phone&#8217; and userSubscribed and…</p>\n<p>Fuck.That.</p>\n<p>Here&#8217;s how you do it:</p>\n<pre><code>[() =&gt; userSubscribed ? &lt;CreditCard /&gt; : &lt;DoTheThing /&gt;, ...]\n</code></pre>\n<p>Put functions in your previous/next logic! Core logic stays simple, end result for user is a complex tree of options.</p>\n<p>That can get tricky too, I know. But you know what always works? Tree traversal. You can model your flow as a tree and build a simple walker that goes into different branches of the tree based on stuff. Perhaps based on functions in the tree nodes themselves.</p>\n<p>😉</p>\n<p>Save time. Make business logic your data. If a Turing machine can do it, so can your app.</p>\n<p>Happy hacking.</p>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"65b0b7b5-3033-5c55-b03a-38d0bfde3c82"}}