{"data":{"wordpressPost":{"title":"Why I switched to making products","content":"<p>Four weeks ago, I made $3,000 while stuffing my face with my grandma’s cake.</p>\n<p>She makes this amazing Slovenian cake called a <em>potica</em>. You can’t really get it outside Slovenia unless you bake it yourself or go to Cleveland.</p>\n<p>Grandmas being grandmas, her cake is much better than mine. And I’ve never been to Cleveland.</p>\n<p>Now, I don’t visit my grandma very often anymore. Once a year, twice tops. Sure, my mum makes a great cake too, but I don’t visit her any more often than I visit my grandma.</p>\n<p>Distance and oceans can do that to a person.</p>\n<p>The cake is definitely a big highlight of my trips back. There’s only so much a 70-year old woman from the rural lands and a 28-year old city slicker have to talk about.</p>\n<p>She asks when she’s getting grandkids. I stuff my face with cake. It works.</p>\n<p>Visiting gramps and grandma is great, even without the goats and the chickens and the rabbits and most of the cats and even with the old vineyard and most of the orchard gone. It’s great to visit.</p>\n<p>I get a day without computers. What bliss. When I’m there, I’m <em>there</em>. Well, I try. There’s like 1 bar of LTE coverage…</p>\n<p>And despite enjoying my time away from the internet, I still made $3,000 in a single weekend. The work happened days before when I scheduled two emails, one to start a sale and one to end it.</p>\n<p>Wait. What?</p>\n<p>Elementary, my dear Watson. …</p>\n<p>No? Too much? Too much.</p>\n<p>Products, man. Products are great. Just two years ago, I had a pretty stupid opinion about products. A local startup had just announced their sales figures – $80,000 in a year.</p>\n<p>I had a real dickhead moment when I thought: <em>“Man, at that point, why do you even bother with products? You can make that much money solo freelancing, and it’s way less risky.”</em></p>\n<p>I could smell that I was wrong. I could tell that there was something I didn’t understand. I was also pretty sure that a team of 5 or 6 people should be making way more than that.</p>\n<p>For the past year, I’ve been putting a lot more energy into products than into freelancing. You could say I’ve stopped freelancing, but that’s a post for another time. One I’ve been busy putting off for a year now.</p>\n<p>Funny how those dates coincide, isn’t it?</p>\n<p>The focus on products has been going great. Just take a look at the sales graph for my React+d3.js ES6 book.</p>\n<img class=\"alignnone size-large wp-image-6816\" src=\"http://swizec.com/blog/wp-content/uploads/2016/06/Screen-Shot-2016-06-01-at-23.25.55-1024x469.png\" alt=\"Screen Shot 2016-06-01 at 23.25.55\" srcset=\"https://swizec.com/blog/wp-content/uploads/2016/06/Screen-Shot-2016-06-01-at-23.25.55-1024x469.png 1024w, https://swizec.com/blog/wp-content/uploads/2016/06/Screen-Shot-2016-06-01-at-23.25.55-300x137.png 300w, https://swizec.com/blog/wp-content/uploads/2016/06/Screen-Shot-2016-06-01-at-23.25.55-768x352.png 768w, https://swizec.com/blog/wp-content/uploads/2016/06/Screen-Shot-2016-06-01-at-23.25.55.png 1057w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" />\n<p>I know. It’s not much. $8,000 dollars. It’s nowhere <em>near</em> the $80,000 I was so critical of two years ago.</p>\n<p>Why even bother, right? 2 to 3 hours of loose focus per day just to make $8,000. What a waste of life. I could’ve freelanced those out and made about $20,000 in the same two months.</p>\n<p>Or maybe I could just spend that time with my girlfriend and my bird. They’d love me for it. They might even stop complaining that I work too much.</p>\n<p>Yes, yes. Grandma gets me for a weekend, girlfriend gets to put up with me working nights and weekends. C’est la vie. ¯_(ツ)_/¯</p>\n<p>But just look at that big fat spike in the middle. The $3,000 weekend. Like, holy shit, dude. How the hell did I do that?</p>\n<img class=\"alignnone size-large wp-image-6815\" src=\"http://swizec.com/blog/wp-content/uploads/2016/06/Screen-Shot-2016-06-02-at-00.31.34-1024x468.png\" alt=\"Screen Shot 2016-06-02 at 00.31.34\" srcset=\"https://swizec.com/blog/wp-content/uploads/2016/06/Screen-Shot-2016-06-02-at-00.31.34-1024x468.png 1024w, https://swizec.com/blog/wp-content/uploads/2016/06/Screen-Shot-2016-06-02-at-00.31.34-300x137.png 300w, https://swizec.com/blog/wp-content/uploads/2016/06/Screen-Shot-2016-06-02-at-00.31.34-768x351.png 768w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" />\n<p>I couldn’t <em>dream</em> of numbers like that as a freelancer. There’s just no way I can do that by writing code. Some can, I can’t. Not yet.</p>\n<p>To make that much money freelancing on a weekend, you’d have to bust your ass or have a sky-high rate. Probably both.</p>\n<p>I did neither.</p>\n<p>I spent Saturday on a hike of some sort and Sunday stuffing my face with grandma’s cake. With 1 bar of LTE, I couldn’t work even if I had wanted to.</p>\n<p>On Friday, an automated email went out to a few thousand people. It said <em>“Yo! To celebrate my US visa, books are 50% off this weekend”</em>.</p>\n<p>On Sunday, an automated email went out saying <em>&#8220;Yo! Weekend’s over. Sale ends when I get home from grandma’s house“</em>.</p>\n<p>They were longer and nicer emails, but that’s the gist of it. In a nutshell, that’s how I made $3,000 in a single weekend while stuffing my face with grandma’s cake.</p>\n<p><em>That’s</em> why I’m switching to products. It’s not quite passive money, but it sure beats selling your time.</p>\n<p>Now I’ve just gotta figure out how to sell more products than time. How hard can it be?</p>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"7d96aed2-c5a5-528f-bc89-8a376ff4d9bb"}}