{"data":{"wordpressPost":{"title":"Hire these interns","content":"<p>A few weeks ago I made an offer: <em>Come work with me, and I&#8217;ll pay you to learn React.</em></p>\n<p>20 people applied. I am not famous 🤔</p>\n<p>But I only had room for 1, so that&#8217;s plenty. Now I was faced with a challenge: <em>How do you pick 1 person out of 20 to help you code things you don&#8217;t have time to code?</em></p>\n<p>The original problem I&#8217;m solving is all about time and energy – I don&#8217;t have enough of either. Interviewing everyone individually was out of the question.</p>\n<p>So I designed <a href=\"https://swizec.com/blog/tech-intern-job/swizec/8454\">a sort of interview audition system</a>. Something like this:</p>\n<ol>\n<li>Hold a one-to-many webinar where I explain a React concept. Learning something is valuable to applicants, I hope.</li>\n<li>Ask for app submissions built with this concept. Building something for practice is valuable to applicants, I hope.</li>\n<li>Rank folks based on how fast they learn. This is based on my subjective spidey senses, I&#8217;m afraid. I don&#8217;t know how to make it objective.</li>\n</ol>\n<p>Many said they don&#8217;t have time for this bullshit and dropped out before the webinar. That&#8217;s okay. I designed the process this way. If you don&#8217;t have time to talk to me, you won&#8217;t have time to work on stuff either.</p>\n<p>You might <em>make</em> time if I could offer oodles of money or super crazy interesting problems. But I don&#8217;t have either of those yet. Sorry.</p>\n<p>Some new people showed up at the webinar. That&#8217;s cool, too. The more, the merrier.</p>\n<p><iframe width=\"580\" height=\"326\" src=\"https://www.youtube.com/embed/zCYuhqW2Qeo?feature=oembed\" frameborder=\"0\" allow=\"autoplay; encrypted-media\" allowfullscreen></iframe></p>\n<p>The webinar got 226 views. 49 while it was live.</p>\n<p>Of those, 6 sent me an app to look at. 🎉</p>\n<p>That&#8217;s a conversion rate of 30%. Pretty good considering the best I can offer is a sort of intern apprenticeship with a bit of money involved.</p>\n<p>Although some folks applying had like 2 or 3 years of experience, and that&#8217;s crazy. Is nobody hiring juniors anymore? 🤔</p>\n<h2>Here&#8217;s what people built</h2>\n<p>Here&#8217;s some stuff that people built. I promised I&#8217;d share it with the world, and who knows, you might decide you need someone to help you code, too.</p>\n<p><a href=\"mailto:judenangoli@yahoo.com\"><strong>Jude</strong></a> built a cool names meaning thingy. Great styling, lovely use of React context. Works great and has many buttons that show there&#8217;s good ideas to go forward.</p>\n<a href=\"https://test-ad62f.firebaseapp.com/\"><img src=\"https://d.pr/i/qOD5jH.jpg\" width=\"6016\" height=\"3192\" class=\"alignnone size-large\" /></a>\n<p><a href=\"mailto:ferwee@gmail.com\"><strong>Frikan</strong></a> built an entire hat shop! Uses React context to share state around and works pretty well. Nice simple styling, good code behind the scenes.</p>\n<a href=\"https://frikanrw.github.io/contexthatshop/\"><img src=\"https://d.pr/i/u3SgS7.jpg\" width=\"6008\" height=\"2940\" class=\"alignnone size-large\" /></a>\n<p><a href=\"mailto:fred.thefriedone@gmail.com\"><strong>Fred</strong></a> built a World Cup red/yellow card app of sorts. Helps you keep track of how many red and yellow cards your favorite players got this time around. Great idea!</p>\n<a href=\"https://codesandbox.io/s/8kvnzq98p8\"><img src=\"https://d.pr/i/RyIvtI.jog\" width=\"2724\" height=\"1834\" class=\"alignnone size-large\" /></a>\n<p><a href=\"mailto:hello@xiaoru.li\"><strong>Xiaoru</strong></a> had the best cover letter I have ever seen and he built an amazing Pomodoro timer. Looked great, worked great, tugged at my heart strings. Loved some of the older projects he built as well.</p>\n<img src=\"https://d.pr/i/TXCXG5.jpg\" width=\"3360\" height=\"1392\" class=\"aligncenter size-large\" />\n<p><a href=\"mailto:hsribei.pub@gmail.com\"><strong>Helder</strong></a> built a cool recursion visualizer that shows before your eyes how you can use React context instead of prop drilling to make your life easier. Said it helped him explain stuff to his dad who is learning how to code. Wow.</p>\n<a href=\"https://codesandbox.io/s/3vmrlm0175\"><img src=\"https://d.pr/i/s14tMy.jpg\" width=\"2718\" height=\"2336\" class=\"alignnone size-large\" /></a>\n<p><a href=\"mailto:shawnhosea@shawnhosea.com\"><strong>Shawn</strong></a> built a neat newsletter sign up form with an animated background. A little forced for a React context example, but I like how it looks, and he seems cool.</p>\n<a href=\"https://craftatoms.github.io/newslettertemplate/\"><img src=\"https://d.pr/i/jEL88f.jpg\" width=\"6016\" height=\"2668\" class=\"alignnone size-large\" /></a>\n<h2>How I picked</h2>\n<p>Ranking people is strange and weird, and it took me a long time to not make a choice in the end. I hired both Shawn and Helder.</p>\n<p>Best way to see who you wanna work with is to work with them for a little and see what&#8217;s up. Right?</p>\n<p>My stated goal was to pick based on slope –&nbsp;how fast they learn. I did my best to follow that principle, but human factors came into play, too.</p>\n<p>Shawn is the most excited person about React I&#8217;ve ever seen, and Helder has a lot of professionalism. Xiaoru looked amazing, but he&#8217;s still in school, and I remember what freelancing was like when I was still in school. Balls got dropped.</p>\n<p>I&#8217;m gonna be dropping plenty of balls on my own! I don&#8217;t want the people helping me dropping them, too 😀</p>\n<img src=\"https://upload.wikimedia.org/wikipedia/commons/c/c8/Bubble-sort-example-300px.gif\" alt=\"Bubble sort\" />\n<p>Oh, and I used <a href=\"https://en.wikipedia.org/wiki/Bubble_sort\">bubble sort</a>. Bubble sort is great. Instead of looking at a heap of people and being overwhelmed, you compare 2 at a time. It&#8217;s easier to decide that way and eventually the best bubble up to the top.</p>\n<p>Need some help building your side projects or whatnot? Consider the folks above! Each name links to their email. They&#8217;d love to help!</p>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"9d727a3f-0d6b-590a-a0d3-c6233f86774a"}}