{"data":{"wordpressPost":{"title":"What I learned from So Good They Can&#8217;t Ignore You by Cal Newport","content":"<a href=\"https://www.amazon.com/gp/product/1455509124/ref=as_li_tl?ie=UTF8&amp;camp=1789&amp;creative=9325&amp;creativeASIN=1455509124&amp;linkCode=as2&amp;tag=ageewitahat-20&amp;linkId=587d677953d0d74a82ea05cfaf4bc611\"><img src=\"https://images-na.ssl-images-amazon.com/images/I/51IjORMFLkL.jpg\" /></a>\n<p><a href=\"https://www.amazon.com/gp/product/1455509124/ref=as_li_tl?ie=UTF8&amp;camp=1789&amp;creative=9325&amp;creativeASIN=1455509124&amp;linkCode=as2&amp;tag=ageewitahat-20&amp;linkId=587d677953d0d74a82ea05cfaf4bc611\">So Good They Can&#8217;t Ignore You</a> is <a href=\"https://swizec.com/blog/cal-newports-deep-work/swizec/7616\">Deep Work&#8217;s</a> sister book. Where Deep Work talks about how to get things done like your career depends on it, <em>So Good They Can&#8217;t Ignore You</em> talks about how to get said career in the first place.</p>\n<p>I audiobooked it while running, and I think it&#8217;s great. Much food for thought, should&#8217;ve read it years ago.</p>\n<p>Here&#8217;s what I remember 3 weeks later. That&#8217;s how long it took to get around to writing this 😇</p>\n<img src=\"https://swizec.com/blog/wp-content/uploads/2017/07/good-shit-stays.jpg\" />\n<h2>The One Thing</h2>\n<p>The core premise of <em>So Good They Can&#8217;t Ignore You</em> is that you should identify the one thing that matters and get really good at it.</p>\n<p>If you want to be an Olympic Gold Medalist Sprinter, you should focus on sprinting. Whatever it takes, your 100m time is all that matters. Everything else will fall into place.</p>\n<p>If you want to be the highest paid boxer of all time, focus on drawing a large crowd. Winning fights is but a precondition. Entertainment and large crowds bring the money.</p>\n<p>The example Newport uses is of a guy who wants to become a screenwriter in Hollywood. At first, he tries many different things, an assistant job here, small writing gigs there. Then he realizes that writers are judged on writing.</p>\n<p>Write well, and you will get through the gatekeepers. Write poorly, and you won&#8217;t.</p>\n<p>Newport identifies two types of skills markets. Winner-take-all and… errr… the other kind. In winner-take-all markets, your One Thing is all that matters. They&#8217;re ruled by the <a href=\"https://en.wikipedia.org/wiki/Pareto_principle\">Pareto Principle</a></p>\n<blockquote><p>\nThe Pareto principle (also known as the 80/20 rule, the law of the vital few, or the principle of factor sparsity)[1] states that, for many events, roughly 80% of the effects come from 20% of the causes.\n</p></blockquote>\n<p>In a winner-take-all market, all that matters is how good you are at the One Thing your performance is measured upon.</p>\n<p>Newport also mentions skills markets that prize breadth. Stuff like entrepreneurship where you have to know a lot of things just well enough to find an expert. Or… he doesn&#8217;t really go too deep into those markets. They&#8217;re less interesting 🙂</p>\n<h2>Career Capital</h2>\n<p>As you build this One Thing You&#8217;re Judged By, you&#8217;re building something Newport calls Career Capital.</p>\n<p>Amazing careers and jobs are, by definition, rare and valuable. Why doesn&#8217;t everyone have a job they love and a career they&#8217;re passionate about? Because they&#8217;re hard to get.</p>\n<p>When something is valued and rare, it&#8217;s expensive. What makes a career expensive? Well, that depends.</p>\n<p>To be a top surgeon, you have to spend decades in school and work insane shifts. To be a world famous movie star, you need to have insane work ethic, talent, and the willingness to say No to a lot of stuff.</p>\n<p>Fundamentally, you need to have something that&#8217;s valuable and rare, if you want a career that&#8217;s valuable and rare. Career Capital.</p>\n<p>As your skills in X grow, you become more valuable. You can leverage that valuableness into better opportunities.</p>\n<p>Newport uses an example of a software engineer. She worked in QA, and she became so good that she was offered promotion after promotion. Instead, she leveraged those offers into working 30 hours per week for the same pay.</p>\n<p>This improved her quality of life.</p>\n<p>Because she was working only 30 hours a week, she further optimized those QA processes. Everything was smoother and faster.</p>\n<p>She was able to leverage her skill in building QA processes into a job at a young startup that needed to build a team from scratch. Because she was That Good, she was given a lot of freedom and the ability to work remote.</p>\n<h2>Up to you</h2>\n<p>One huge benefit of acquiring career capital is that it gives you choice. You&#8217;re valuable and rare, which means you have leverage.</p>\n<p>When you have leverage, <em>you</em> can decide what you want. You can decide how you&#8217;re measuring success and go after that metric. Want promotions and high wages? Go for it. Want freedom? Go for that.</p>\n<p>Building career capital and being great at The Thing gives you choice and freedom. And it&#8217;s that choice and freedom that is the strongest predictor of job satisfaction.</p>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"af0098aa-6d49-508a-9a67-bd85841c68b3"}}