{"data":{"wordpressPost":{"title":"A flight","content":"<p><!-- p.p1 {margin: 0.0px 0.0px 0.0px 0.0px; font: 13.0px Arial} p.p2 {margin: 0.0px 0.0px 0.0px 0.0px; font: 13.0px Arial; min-height: 15.0px} -->It is 8 o&#8217;clock airplane time and I just got caught red handed making some unauthorized tea.</p>\n<p>It&#8217;s a bit boring up here, I&#8217;ve already watched two movies, did some actual work, read about 70 pages of Ulysses, transfered a bunxh of music to the iPad, drank hundreds of cups of water, three cups of tea, had fi ve walks, ten bathroom breaks, and ate two chocolate bars.</p>\n<p>All @skatey has done is sleep. Ha!</p>\n<p>We find out who&#8217;s better at evading jet lag tomorrow. He&#8217;ll be getting lots of sleep, while I&#8217;ll be arriving at San Francisco quite sleepy, but after an 8 hour sleep should wake up in the correct timezone.</p>\n<p>Anywho, I was back in the rear galley. Just sort of loitering. And I figured the pots of hot water and adjacent baggie of tea were just as self service as the trays of water and juice and the buckets of chocolate.</p>\n<p>Just as I proceeded to help myself a very cross flight attendant told me I can&#8217;t just do that. Something about those specific baggies of yummy tea being for the big pot &#8230; then she gave me some el cheapo tea in a small baggy.</p>\n<p>Also, her &#8220;good god man, stop being an idiot and let me do my job, i hatebeing here because of assholes like you&#8221; look was sooper cute.</p>\n<p>Another thing I noticed in the last eight hours trapped in this tiny chair and surrounded by incredibly dry air is that laptops are the most perfectly impractical device for economy flying.</p>\n<p>iPads fare much better, but lack the ability to &#8230; work well with dried out fingers. Stupid fake climate!</p>\n<p>It&#8217;s a mystery how I felt like doing a bit of creative writing when I started out wr iting this post, but ended up with this rather monotonous drivel. Maybe I should just stick to programming.</p>\n<div class=\"zemanta-pixie\" style=\"margin-top: 10px; height: 15px;\"><a class=\"zemanta-pixie-a\" title=\"Enhanced by Zemanta\" href=\"http://www.zemanta.com/\"><img class=\"zemanta-pixie-img\" style=\"border: none; float: right;\" src=\"http://img.zemanta.com/zemified_e.png?x-id=fc430327-b2c2-4590-9a0a-3286e69b92d0\" alt=\"Enhanced by Zemanta\" /></a><span class=\"zem-script more-related more-info pretty-attribution\"><script src=\"http://static.zemanta.com/readside/loader.js\" type=\"text/javascript\"></script></span></div>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"1458d8b3-7aae-5578-8144-b74ced847819"}}