{"data":{"wordpressPost":{"title":"Livecoding #17: Particle physics is hard","content":"<p><em>This is a Livecoding Recap – an almost-weekly post about interesting things discovered while livecoding ?. Shorter than 500 words. With pictures. You can follow my channel, <a href=\"https://livecoding.tv/swizec\">here</a>. New content almost <strong>every Sunday at 2pm PDT</strong>. There’s live chat, come say hai ?</em></p>\n<p><iframe src=\"https://www.livecoding.tv/swizec/videos/wa6qm/embed\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"true\" scrolling=\"no\"></iframe></p>\n<p>Did you know particle physics was hard? I had no idea.</p>\n<p>I wanted to inject interestingness into the animated particles experiment. Take a random animation of a bunch of particles and turn it into a simulation of the forces between charged particles. It would look so totally cool!</p>\n<p>It did not go so well. </p>\n<blockquote class=\"imgur-embed-pub\" lang=\"en\" data-id=\"a/dERre\"><p><a href=\"//imgur.com/dERre\"></a></p></blockquote>\n<p><script async src=\"//s.imgur.com/min/embed.js\" charset=\"utf-8\"></script></p>\n<p>Sure, I had <em>some</em> idea that deriving electrostatic force equations from scratch was hard, but it&#8217;s 2016, we know this stuff! Teachers show it to us in middle school and high school and college too. How hard can it be?</p>\n<p>Pretty hard.</p>\n<p>The Wikipedia article on <a href=\"https://en.wikipedia.org/wiki/Electric_field\">electric fields</a> did not help. It has a bunch of equations, but none that seem useful. Or maybe my reading comprehension is bad when I&#8217;m on camera. </p>\n<p>The article does link to <a href=\"https://en.wikipedia.org/wiki/Coulomb%27s_law\">Coulomb&#8217;s law</a>, which looks a lot like the equation a theoretical physicist explained in the live chatroom. I think his name was zimaguy, but livecoding.tv won&#8217;t let me scroll back in the chatroom to check.</p>\n<p>How cool is it that we had a real life theoretical physicist on the live stream? Wow.</p>\n<p>The formula he gave says that force between a static charge and a particle is equal to <code>1/r^2</code>, where <code>r</code> is the euclidian distance between two points. We get it using Pythagorus&#8217; formula:</p>\n<pre>\r\ndx = x1 - x2\r\ndy = y1 - y2\r\nr^2 = dx^2 + dy^2\r\n</pre>\n<p>Remember middle school maths and asking the professor <em>&#8220;But miiiissss when will I ever need this in real life?&#8221;</em>. When you&#8217;re coding cool stuff, that&#8217;s when.</p>\n<p>The best part of this formula is that we use <code>r^2</code> and don&#8217;t need a square root. Roots are expensive, multiplication is cheap. </p>\n<p>The tricky part is turning this scalar into a vector. The debate with zimaguy went back and forth and I had to settle for a rough approximation. It only understands 4 directions (Up/Down, Left/Right) and misses all of the beauty of vector mathematics, but the end result looks good enough.</p>\n<p>We use the calculation for each static charge. Like this:</p>\n<pre lang=\"javascript\">\r\n// reducer that moves each particle\r\n\r\np.x += vx*multiplier;\r\np.y += vy*multiplier;\r\n\r\nstate.charges.forEach(charge => {\r\n    let dx = p.x - charge.x,\r\n          dy = p.y - charge.y,\r\n            r2 = dx*dx + dy*dy,\r\n            rX = (dx < 0 ? -(1/r2) : 1/r2)*charge.strength,\r\n            rY = (dy < 0 ? -(1/r2) : 1/r2)*charge.strength;\r\n\r\n    p.x += rX;\r\n    p.y += rY;\r\n});\r\n</pre>\n<p>First we calculate each particle&#8217;s new position, then go through the list of charges, and calculate electric force effects. Movement has to happen first, otherwise the charges have a delayed effect that looks weird.</p>\n<p>And voila.</p>\n<blockquote class=\"imgur-embed-pub\" lang=\"en\" data-id=\"a/dERre\"><p><a href=\"//imgur.com/dERre\"></a></p></blockquote>\n<p><script async src=\"//s.imgur.com/min/embed.js\" charset=\"utf-8\"></script></p>\n<p>This week I want to play with an interesting dataset of some sort. Something that takes a lot of moving parts to showcase … ideas?</p>\n<p>PS: the edited and improved versions of these videos are becoming a video course. Readers of the engineer package of <a href=\"http://swizec.com/reactd3js/\">React+d3js ES6</a> get the video course for free when it’s ready.</p>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"df4ed47d-a155-5c6f-a9dd-529a59935463"}}