{"data":{"wordpressPost":{"title":"The Angry Walk","content":"<p>\n   You know that feeling when you say or do something and suddenly your bird storms off into the distance and you are left standing there like a moron with nothing but the cold air and condescending looks around you? I&#39;m sure every guy out there knows about it, but do you know what to do when it happens?\n</p>\n<p>\n   Well first off let me just mention that doing what I tell you to do does not necessarily mean you aren&#39;t a total arse and that you are now free to do anything you want to your girlfriends just because you know how to clear yourself of any implications. Don&#39;t be me. Only I&#39;m allowed to do that.\n</p>\n<p>\n<object classid=\"clsid:D27CDB6E-AE6D-11cf-96B8-444553540000\" codebase=\"http://download.macromedia.com/pub/shockwave/cabs/flash/swflash.cab#version=6,0,29,0\" width=\"425\" height=\"355\"><param name=\"movie\" value=\"http://www.youtube.com/v/ekpUdlx286c&amp;rel=1\" /><param name=\"quality\" value=\"high\" /><param name=\"menu\" value=\"false\" /><param name=\"wmode\" value=\"\" /><embed src=\"http://www.youtube.com/v/ekpUdlx286c&amp;rel=1\" wmode=\"\" quality=\"high\" menu=\"false\" pluginspage=\"http://www.macromedia.com/go/getflashplayer\" type=\"application/x-shockwave-flash\" width=\"425\" height=\"355\"></embed></object></p>\n<p>\n   Right, so there&#39;s a video example &#8230; in very poor quality, with shaky hands and &#8230; well it&#39;s a cell phone video, cut me some slack.\n</p>\n<p>\n  The shooting began right after I was punched in the abdomen, she punches like a girl thankfully, and the storming off happened. A regular offender might stand there dumbstruck, but my deep knowledge of human female behaviour told me immediately what I was to do. I needed to follow, but keep my distance. Remember, don&#39;t be pushy or try to run after her, don&#39;t even say anything. Just follow.\n</p>\n<p>\n  Oh I also videotaped because it felt like there was some artsy fartsy beauty in it.\n</p>\n<p>\n  At first the distance greatens, but you must keep walking at regular pace. Do not panic like a normal speeder would do. She&#39;s panicking enough for the both of you, keep calm. Quite soon, however, she will magically begin to slow her pace. This is when the initial emotional reaction begins to subside and she once again needs your hug. Do not get antsy, keep walking at regular pace and the distance will do what it&#39;s ought to do. It will remove itself from the equation. Now is the time for you to drag it out a little bit, walk just behind her for a while, just a little bit quicker than she is.\n</p>\n<p>\n  When it becomes too difficult to walk slow enough to keep away. Stop. Stop keeping away that is. This is the time where you hug her and do whatever else it is that she needs. Appologise. Admit that yes you did go out with a hooker or that yes, it was you who left the baby in the fridge on accident.\n</p>\n<p>\n  Disclaimer: this might not work with all models of human females.</p>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"7bdbc3af-5782-5589-9bb9-778ac80482df"}}