{"data":{"wordpressPost":{"title":"You, take a break","content":"<p><em>[I sent this out to the <a href=\"http://swiz.ec/nightowls-list\" target=\"_blank\">Nightowls bi-monthly</a> yesterday and it got a great response, so I&#8217;m reposting it here. Take a break.]</em></p>\n<p>Hey You,</p>\n<p>finally! That time of the year when the world slows down, people fly away for two weeks, and you can just work. Nobody there to bother you at all.</p>\n<p>Don&#8217;t.</p>\n<p>I know it&#8217;s a big temptation, I know it&#8217;s the perfect time to start a side-project, or finish an old one. The perfect time to wrap up that refactoring job you&#8217;ve been sneaking into your task estimates &#8230; I don&#8217;t think there&#8217;s been a holiday in the last few years that I didn&#8217;t open a new Github repository.</p>\n<p>Don&#8217;t.</p>\n<p>You won&#8217;t finish that side-project. You&#8217;ll start with enthusiasm, then realise that hey maybe you actually don&#8217;t have as much time as you thought.</p>\n<p>Just relax. It&#8217;s going to be fine.</p>\n<p>Let&#8217;s play a game right now. Stop reading. Lean back. Stretch. Close your eyes. Do nothing for two minutes. Just breathe.</p>\n<p>Hard, right? You wanted to at least run the test suite or something while you&#8217;re waiting. Just so the time wouldn&#8217;t be completely lost.</p>\n<p>So how the hell are we going to do this for a week? Two weeks? Impossible!</p>\n<p>Sure, there&#8217;s a bunch of work to finish. But there&#8217;s always a bunch of work to finish. And I completely understand all the business owners who are tearing their hair out about the next two weeks. What ever will happen to the company? So much lost productivity!</p>\n<p>Don&#8217;t worry, you&#8217;ll make it all up when you get back. I promise.</p>\n<p>Even if you&#8217;re a freelancer. Just &#8230; chill. I know you want to work, I know you want to get ahead of the competition. Don&#8217;t worry about it. You&#8217;ll be even awesomer after the break.</p>\n<p>If you&#8217;re just a nerd who likes staying at home with their computer, stop. Go out. Meet people. Party.</p>\n<p>Dance like nobody&#8217;s watching.</p>\n<p>The biggest forum for tech nerds in Slovenia just closes down on New Year&#8217;s Eve. Go there and you&#8217;re greeted with <em>&#8220;Step away from the computer. Party.&#8221;</em></p>\n<p>I used to think that was stupid. But it&#8217;s really really awesome. Listen to their advice. Go have fun.</p>\n<p>Let&#8217;s make a deal.</p>\n<p>I will personally find a way to slap anyone who writes a line of code between the 30th of December and the 2nd of January. I&#8217;ll do it through TCP/IP if I have to.</p>\n<p>But! If you do take a few days off, and you like it, I will buy you a beer or coffee or a slice of cake or whatever when I&#8217;m in your part of the world. Deal?</p>\n<p>No links today. No productivity tips. Go out and have fun. Come back fresh. Win.</p>\n<p>Cheers,<br />\n~Swizec</p>\n<p>PS: if you have any suggestions for new year&#8217;s fun in new york, I&#8217;m all ears. See, I&#8217;m taking my own advice 🙂</p>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"5c665d0c-928d-5f00-9d71-462acd136126"}}