{"data":{"wordpressPost":{"title":"Working IN your career vs. ON your career","content":"<img src=\"https://swizec.com/blog/wp-content/uploads/2018/03/hitesh-choudhary-562332-unsplash-1024x683.jpg\" alt=\"Bloke holding a CODE post-it, Hitesh Choudhary\" class=\"alignnone size-large wp-image-8249\" srcset=\"https://swizec.com/blog/wp-content/uploads/2018/03/hitesh-choudhary-562332-unsplash-1024x683.jpg 1024w, https://swizec.com/blog/wp-content/uploads/2018/03/hitesh-choudhary-562332-unsplash-300x200.jpg 300w, https://swizec.com/blog/wp-content/uploads/2018/03/hitesh-choudhary-562332-unsplash-768x512.jpg 768w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" />\n<p>A reader recently asked me how they can do things next to their demanding day job as a software engineer. Contribute to GitHub, write blogs, give talks, be active in the community, and maybe even sidehustle some money on the side.</p>\n<p>You know, all the things that we look at and say, <em>&#8220;That dude is amazing! Rockstar! Much love 😍 How does she talk at 50 conferences per year wtf!?&#8221;</em></p>\n<p>But first I want to answer <strong>why</strong>.</p>\n<h3>Why you should work ON your career, not just IN your career</h3>\n<p>I&#8217;m borrowing a concept from <a href=\"https://kaidavis.com/\">Kai Davis</a>, a famous consultant. He talks a lot about the difference between working <strong>in</strong> your business versus working <strong>on</strong> your business.</p>\n<p>When you work <em>in</em> your business, you deliver value to clients.</p>\n<p>When you work <em>on</em> your business, you deliver value to yourself.</p>\n<p>Engineering careers are similar. There&#8217;s work that benefits your employer: you go to meetings, you deliver code, you code review, you help your team and act as a force multiplier, etc. You do stuff that delivers value to others.</p>\n<p>You build features for your users, and you make your boss happy by showing up on time and going to meetings even when you don&#8217;t really quite feel like it. Stuff like that.</p>\n<p>This also builds experience, so it often feels like working <em>on</em> your career. You&#8217;re solving problems you haven&#8217;t solved before. You&#8217;re gonna solve them faster next time.</p>\n<p>It improves your career a little.</p>\n<p>If you want to improve your career a lot, you have to work <em>on</em> your career. You have to do work that force multiplies yourself, not just those around you.</p>\n<p>For 1 unit of effort, how do you get 3 units of career growth?</p>\n<h3>How to work ON your career</h3>\n<p>There are many ways you can work <em>on</em> your career. Depends what you want.</p>\n<p>You can become a better engineer specialist through pet projects. Explore some new tech, develop some new skills. Watch talks, read blogs, go to conferences. Learn more skills.</p>\n<p>Next time somebody needs a thing, you can say, <em>&#8220;I can do that!&#8221;</em>.</p>\n<p>And your career as an engineer improves. You can do more stuff.</p>\n<hr />\n<p>You can become a thought leader and rockstar 🤘 Give talks at meetups and conferences, publish blogs, be active in the community. This makes people know about you and how awesome you are.</p>\n<a href=\"https://medium.com/@swizec/how-to-get-lucky-263c1808f66a\"><img src=\"https://cdn-images-1.medium.com/max/1600/0*t__Nj5wNw8YSYzKp.jpg\" width=\"550\" height=\"413\" class=\"alignnone size-large\" /></a>\n<p>Now you&#8217;re a thought leader in some area or community. People come to you for opinions and advice because they value the way you think and approach problems.</p>\n<p>And your career improves. When someone needs advice, they think of you.</p>\n<hr />\n<p>An easier way at the beginning, and harder when your projects take off, is to work on open source. It&#8217;s a lot like giving talks, but easier to fit in your schedule. Until you&#8217;re famous. Then it&#8217;s harder.</p>\n<p>Publishing open source projects makes you That Person Whose Tools We Use™.</p>\n<p>Now you&#8217;re not just telling people how to fish, you&#8217;re giving them <em>actual</em> fish. This is a great place to be.</p>\n<p>The more people use your tools, the more they will like you, the more they will value your opinions. This can lead to speaking opportunities, being generally known of in the community, and sometimes even getting hired as a job perk for other engineers because everyone wants to work with you.</p>\n<p>And your career improves. People know of you, people rely on you, they want to work with you.</p>\n<hr />\n<p>You can be a connector. Go out and meet people. Introduce people to each other. Make people comfortable in social situations. Connect person who needs X with a person who knows X.</p>\n<p>This approach may sound silly. Bah, I&#8217;m an engineer, and engineers are judged on their merits and their code!</p>\n<p>But are they? We&#8217;re all humans, and we work in teams, and we like to work in teams with people we like and enjoy spending time with. Humanness matters.</p>\n<p>An engineer who is good at social is a rare breed. Your career will skyrocket. This is how you become a VP of Engineering. You think they code? No, they deal with people.</p>\n<p>The connector approach works best if you ever want to start your own team. Oh, you need 5 engineers with skills in X, Y, and Z? Yeah, I know them. I&#8217;m buddies with 10 of them. I&#8217;ll have a team put together in 2 weeks.</p>\n<p>And your career improves. People come to you when they need help because they know you&#8217;ll point them in the right direction.</p>\n<h2>Whatever it is, do <em>something</em></h2>\n<p>Most importantly, you should do <em>something</em> that builds your career, not just your code.</p>\n<img src=\"https://media.giphy.com/media/u0v3z2iQLxyHC/giphy.gif\" />\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"94b0674a-6306-585a-9943-d064c38b39f4"}}