{"data":{"wordpressPost":{"title":"Opensource delight","content":"<p>\n    You know why I love working on open source programming? It&#39;s not because the model in itself is a wonder or even that good, frankly it has many problems, but that&#39;s not what we&#39;re here to discuss. It&#39;s not even because I love giving back to the community. The reasons are completely and totally vain and because, well, it&#39;s easier to do open source than closed source.\n</p>\n<p>\n    One thing about open source is that every now and then I get an e-mail from a developer that so loved a function or two of mine that they felt like they should tell me about how much it helped them. And sometimes, just sometimes, something far better happens.\n</p>\n<p>\n    Today I received this:\n</p>\n<p>\n<cite title=\"Dave Stewart on a function of mine\">Hi Swizec,</p>\n<p>    Just wanted to say &ndash; great function!</p>\n<p>    I couldn&rsquo;t work out why it was working until I littered it with traces and realised that because directories are listed last (I&#39;d never thought to look), there&#39;s no recursion issues, as the files are already disposed of.</p>\n<p>    That&#39;s a neat trick to take advantage of!</p>\n<p>    Cheers,</p>\n<p>    Dave<br />\n</cite><br />\n    And at first I even thought he was right, wow, he found out something about my own code I did not know. But a moment later it hit me and I explained to him his error and that the reason said function works is that it first goes into the directory and removes it after it&#39;s empty. Neat trick, not too obvious apparently. His next response was also quite a delight:\n</p>\n<p>\n<cite title=\"Dave Stewart replies again\">Hey Swizec.</p>\n<p>     You&#39;re right. You&#39;re right!<br />\n     I do lots and lots of recursion for all sorts of things, but in my head this<br />\n    definitely seemed more complicated, as the removal of directories demands<br />\n    you start from the &quot;outside in&quot; rather than the &quot;inside out&quot;. But as you&#39;ve proved, doing the branches first is the workaround.<br />\n     It&#39;s great being wrong! A little humbling (which I admit, I&#39;m not THAT keen<br />\n    on!) but you get to learn something new.<br />\n     Thanks for the workout!<br />\n    Cheers,<br />\n    Dave</p>\n<p></cite>\n</p>\n<p>\n    We were talking about <a href=\"http://si.php.net/manual/en/function.rmdir.php#76806\">this</a> function by the way.\n</p>\n<p>\n    So thank you Dave Stewart, whoever you are, for making my day.</p>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"26a55652-333c-52e3-b301-390d33ffd07b"}}