{"data":{"wordpressPost":{"title":"I infiltrated another Rails Girls event, #RailsGirlsMb","content":"<div style=\"width: 624px\" class=\"wp-caption alignnone\"><img title=\"Rails Girls Maribor heart\" src=\"https://www.filepicker.io/api/file/LLvKgLJ7Tf6Qyxcmcloy\" alt=\"Rails Girls Maribor heart\" width=\"614\" height=\"409\" /><p class=\"wp-caption-text\">Rails Girls <a class=\"zem_slink\" title=\"Maribor\" href=\"http://maps.google.com/maps?ll=46.55,15.65&amp;spn=1.0,1.0&amp;q=46.55,15.65 (Maribor)&amp;t=h\" rel=\"geolocation\" target=\"_blank\">Maribor</a> heart</p></div>\n<p>Last time <a href=\"http://swizec.com/blog/i-infiltrated-railsgirlsj-heres-what-it-was-like/swizec/5717\" target=\"_blank\">I infiltrated a Rails Girls event</a> angry internet feminists gave me a lot of flak about volunteering a day to teach girls &#8211; sorry, strong independent women aged about 19 and up &#8211; about the web and programming and this crazy world of technology I breathe every day.</p>\n<p>But those harpies are angry about everything, let&#8217;s not worry about them. Real girls are <em>awesome</em>. They love learning cool things and don&#8217;t mind if a guys do the teaching.</p>\n<p>No idea what I did last time, but I actually got invited to mentor at <a href=\"http://railsgirls.com/maribor\" target=\"_blank\">Rails Girls Maribor</a>. Something about having done it once before. Must&#8217;ve been the cool hat, because I was rubbish at it last time. Think the girls spent more time guiding me around than I did them.</p>\n<p>But off my big mouth went and on Saturday, at 9am sharp, I showed up at the Maribor technical faculty, FERI. Well, no, I was an hour late because I <em>really</em> hate mornings and Maribor is super far for someone whose daily commute consists of getting out of bed.</p>\n<div style=\"width: 624px\" class=\"wp-caption alignnone\"><img title=\"Me and my jolly lasses\" src=\"https://www.filepicker.io/api/file/3k8emjdYSw6hNpMPrreU\" alt=\"Me and my jolly lasses\" width=\"614\" height=\"458\" /><p class=\"wp-caption-text\">Me and my jolly lasses</p></div>\n<p>This time will be different! I have four months of proper rails experience! This time I&#8217;ll be the awesomest mentor ever and will teach girls all the secret ruby incantations!</p>\n<p>Fat chance.</p>\n<p>By far the most unreliable part was the girls&#8217; typing. Telling them retyping is better for memorisation than copy pasting was a grave mistake. Not one managed to write <code>mkdir railsgirls</code>. We had two railgirls and one prailsgirls.</p>\n<p>Another missed half the line for scaffolding generation and <a class=\"zem_slink\" title=\"Bracket\" href=\"http://en.wikipedia.org/wiki/Bracket\" rel=\"wikipedia\" target=\"_blank\">curly braces</a> were forever the bane of carefully painted nails. Copy pasting worked much better and two of the girls got through the main guide before lunch.</p>\n<p>Yay!</p>\n<p>Unfortunately we had to concede defeat with one of the girls. Four mentors tried to solve the problem. All were defeated. Windows 8, it seems, does not play well with <a class=\"zem_slink\" title=\"Ruby on Rails\" href=\"http://rubyonrails.org\" rel=\"homepage\" target=\"_blank\">Ruby on Rails</a> and we simply could not install some needed dependencies &#8230; no <a class=\"zem_slink\" title=\"Python (programming language)\" href=\"http://www.python.org/\" rel=\"homepage\" target=\"_blank\">Python</a>. Yep.</p>\n<p>In the end, none of my Rails experience did any good. The girls were far more interested in tweaking the visuals. But then, you can&#8217;t really learn to code in an afternoon. But you can learn to learn. By far the biggest win was showing them how to use Bootstrap documentation, <a class=\"zem_slink\" title=\"Google Chrome\" href=\"http://www.google.com/chrome\" rel=\"homepage\" target=\"_blank\">Chrome</a> console and poking around the <a class=\"zem_slink\" title=\"HTML\" href=\"http://en.wikipedia.org/wiki/HTML\" rel=\"wikipedia\" target=\"_blank\">HTML</a>, to figure things out on their own.</p>\n<p>Nothing like teaching someone how to teach themselves. Then you get to play with your phone instead of being chirpy and communicative when the caffeine content in your blood runs out &#8230; I wish event organisers stopped forgetting some of us like tea, not coffee.</p>\n<p>The girls and I also discovered a bug with the Rails Girls Guide thingy &#8211; when you put your site on <a class=\"zem_slink\" title=\"Heroku\" href=\"http://www.heroku.com/\" rel=\"homepage\" target=\"_blank\">Heroku</a>, image uploads stop working because they rely on local disk persistency and Heroku doesn&#8217;t really <em>do</em> that. Rather a big shame &#8211; my whole group left soon after that.</p>\n<p>Or I was just boring.</p>\n<p>But all in all, a smashing success! If at least some of the girls use their new-found knowledge for more than just understanding their boyfriends better, the programming world will be a better place.</p>\n<p>Can&#8217;t wait to do this again!</p>\n<p><em>PS: both images taken from <a href=\"https://twitter.com/railsgirlsmb\" target=\"_blank\">@RailsGirlsMb</a> twitter stream</em></p>\n<div class=\"zemanta-pixie\" style=\"margin-top: 10px; height: 15px;\"><a class=\"zemanta-pixie-a\" title=\"Enhanced by Zemanta\" href=\"http://www.zemanta.com/?px\"><img class=\"zemanta-pixie-img\" style=\"border: none; float: right;\" src=\"http://img.zemanta.com/zemified_e.png?x-id=c3911d06-d977-4af7-b647-35b517979806\" alt=\"Enhanced by Zemanta\" /></a></div>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"baef51c4-e740-5cef-a9a1-1300e13126d0"}}