{"data":{"wordpressPost":{"title":"You have permission to suck","content":"<p>It&#8217;s been 40 days since I published <a href=\"https://www.youtube.com/watch?v=IvR-vxTYhKQ&amp;index=30&amp;list=PLF8WgaD4xmjWuh7FTYTealxehOuNor_2S\">my last daily video</a>.</p>\n<p>26 days since I said, <a href=\"https://swizec.com/blog/learned-recording-educational-video-every-day/swizec/8405\">”Ok. getting back to it now.”</a></p>\n<p>Last night, I finally made a new one. After 50 minutes of procrastination, it took 15 minutes to produce.</p>\n<p>But I didn&#8217;t publish. Yet.</p>\n<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">You’re harder on yourself than your viewers are. Just make a single update video &lt;2 mins in length. A small win will give you the inertia to start again. If that doesn’t help, then just shut it down and don’t do daily videos again for a while—because that’s ok, too.</p>\n<p>&mdash; Ken Wallace (@boaticus) <a href=\"https://twitter.com/boaticus/status/1009067338241576960?ref_src=twsrc%5Etfw\">June 19, 2018</a></p></blockquote>\n<p><script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></p>\n<p>It&#8217;s all got to do with <a href=\"https://dcgross.com/accomplish-dread-tasks/\">the psychology of daunting tasks</a> and the vicious cycle that creates.</p>\n<p>Here&#8217;s how it works for me 👇</p>\n<p>You do something creative every day. You&#8217;re having a blast. You make a video or a blog post or a piece of code or a tiny open source library. Create create create. Write write write. Publish publish publish.</p>\n<img src=\"https://media.giphy.com/media/UogSmj4xDjQZO/giphy.gif\" alt=\"\" />\n<p>The feedback loop is tremendous. The more you create, the more creative you become. Every idea breeds five new ideas.</p>\n<p>Explore a concept, find five new concepts. I should write about that and that, and oh that too! Someone asked me a question, amazing. Ooh, that tweet was interesting, I can do so much with that.</p>\n<p>You get feedback, you get help, you get questions. The results compound and soon you have more ideas than you have time.</p>\n<p>And then you stumble.</p>\n<img src=\"https://media.giphy.com/media/rvasIXgTtFkze/giphy.gif\" alt=\"\" />\n<p>You have a conference. Or you get a little tired. A little burnt out. Your girlfriend says you&#8217;re an ass and should spend time with her, too. Or your creative practice leads to some cool opportunities and you have to say to yourself <em>&#8220;Well fuck, this is such a cool opportunity, I can&#8217;t not do this! But then I won&#8217;t have time to create every day. But I have to do this. Isn&#8217;t this what I&#8217;ve been working towards this whole time? I gotta.”</em></p>\n<p>You miss a day. No biggie.</p>\n<p>You miss two days. Okay.</p>\n<p>You miss 3 days.</p>\n<p>Ooof, now you need something worthy of 3 days to come back with. But what?</p>\n<p>You don&#8217;t know what. 3 more days pass.</p>\n<p>Shit. Now it needs to be awesome enough for 6 days!</p>\n<p>That&#8217;s intimidating. What could possibly be good enough to warrant a 6 day hiatus?</p>\n<p>6 more days pass.</p>\n<p>Damn it!</p>\n<img src=\"https://media.giphy.com/media/WVqfM4G3o0W64/giphy.gif\" alt=\"\" />\n<p>Now you&#8217;re stuck in a loop. The more time passes, the more pressure you feel that the next thing you publish has to be really, really good. The harder you are on yourself, the harder it becomes to do anything.</p>\n<p>That pressure to create something good is the killer. It guarantees you will never create anything at all.</p>\n<p>And without creating, you won&#8217;t have ideas. You won&#8217;t have the compounding effect of ideas making more ideas. You&#8217;ll just have the compounding effect of pressure and more pressure bringing you down.</p>\n<p>The only solution is to create. Force yourself to do something tiny. Stupid. Simple. It doesn’t have to be big or awesome. You&#8217;re just breaking the cycle.</p>\n<p>And you know what they say about creative things that don&#8217;t spread, don&#8217;t you? They don&#8217;t spread.</p>\n<p>That&#8217;s a blessing. An idea or video or blogpost or article or book that doesn&#8217;t spread is an idea, video, blogpost, or article that nobody saw.</p>\n<p>You have permission to suck. Nobody&#8217;s gonna see it anyway. 😉</p>\n<h2>Here’s the point…</h2>\n<p>Don&#8217;t be like that band who makes a great album, goes on tour, and forgets to make the next album. Too busy being successful.</p>\n<p>Or that author who writes a book, makes some sales, and feels too much pressure to write the next hit.</p>\n<p>Or that maker who launches an app, gets some customers, but &#8220;not enough&#8221;, and spends 2 years polishing and perfecting the next one only to find out they&#8217;re solving the wrong problem.</p>\n<p>Stephen King asks <a href=\"https://www.nytimes.com/2015/08/31/opinion/stephen-king-can-a-novelist-be-too-productive.html\">Can a novelist be too productive?</a>. Maybe. Probably not.</p>\n<p><iframe width=\"580\" height=\"326\" src=\"https://www.youtube.com/embed/xR7XMkjDGw0?feature=oembed\" frameborder=\"0\" allow=\"autoplay; encrypted-media\" allowfullscreen></iframe></p>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"b7ddf5d2-d494-5d97-b1be-870f0ba3c0c6"}}