{"data":{"wordpressPost":{"title":"Today I nearly died &#8230; four times","content":"<div style=\"width: 310px\" class=\"wp-caption alignright\"><img class=\"  \" title=\"My longboard\" src=\"http://swizec.com/blog/wp-content/uploads/2011/12/313552641a8b11e19896123138142014_73.jpg\" alt=\"My longboard\" width=\"300\" height=\"300\" /><p class=\"wp-caption-text\">My longboard</p></div>\n<p>Today has been such an epically clumsy day &#8211; knocking over everything I touch, nearly killing random people in the street and myself in the process &#8211; that I just had to share with everyone. Reading this might give you a good chuckle at my expense 🙂</p>\n<p>Let&#8217;s start at the beginning then, shall we?</p>\n<p>The day started out as any other day would. I woke up, looked at the internet, exercised, had a shower, ate some breakfast &#8230; pretty normal stuff right there.</p>\n<p>Then I had a friend come over and I somehow managed to apply my knee to her ankle in what looked like an extremely painful manner. Judging from her shriek and holding her leg like the best football star in the champion&#8217;s league.</p>\n<p>On my way to class I nearly tripped over an unwitting pedestrian. But hey, these things happen sometimes, people don&#8217;t look where they&#8217;re going and traveling on a longboard doesn&#8217;t make a lot of noise while still being quite fast for a sidewalk. Plus people don&#8217;t really expect to meet a guy traveling on a longboard when it&#8217;s below zero outside &#8230; I think.</p>\n<p>Then at a stoplight I nearly tripped over another pedestrian. She was just sort of standing there and I wasn&#8217;t very efficient with my breaking and I think she got a bit spooked when I suddenly ran past her as I jumped off my longboard, narrowly avoiding killing her.</p>\n<p>Got overtaken by a classmate on a bike and he offered to pull me to class to make the whole affair much quicker. I agreed &#8230; but it took me five tries to get a decent grip on his backpack.</p>\n<p>In the process I nearly killed another pedestrian.</p>\n<p>Actually, two pedestrians, they were suddenly in my way and I awkwardly jumped off the longboard so it sort off got between their legs and they&#8217;re quite lucky neither of them accidentally stepped on it because that would be a pretty nasty fall.</p>\n<p>A hundred meters after this incident there was a car idly parked over the sidewalk &#8211; and when I say parked, I mean there was a guy chatting on the phone while lazily manuevering a big SUV into his garage thing.</p>\n<div style=\"width: 310px\" class=\"wp-caption alignleft\"><a href=\"http://commons.wikipedia.org/wiki/File:Longboarding.jpg\"><img class=\"zemanta-img-inserted zemanta-img-configured\" title=\"English: Downhill longboarding example picture\" src=\"http://swizec.com/blog/wp-content/uploads/2011/12/300px-Longboarding4.jpg\" alt=\"English: Downhill longboarding example picture\" width=\"300\" height=\"185\" /></a><p class=\"wp-caption-text\">Image via Wikipedia</p></div>\n<p>Had to jump off the longboard. Nearly killed another pedestrian who was just waiting there for the car to move.</p>\n<p>Not ten minutes later we approached a stoplight with great speed and I couldn&#8217;t decide what to do. Should I jump off? But we&#8217;re going too fast for me to run. Should I just brake? But I&#8217;m not stable enough at this speed for driving with one foot &#8230; and if I just wait until I lose speed I&#8217;ll end up a hundred meters beyond the crossroads.</p>\n<p>So I did the stupidest thing possible &#8211; kept hanging on to the backpack and trying to break like that. Ended up nearly taking the guy over his handlebars. Lost my footing on the longboard and before I knew it I was standing in the middle of a busy crossroads picking up the damn thing from the ground.</p>\n<p>Luckily nobody ran me over.</p>\n<p>Not sure how many pedestrians I nearly killed on my way home from class, but at one point I nearly smashed into the side of a car who didn&#8217;t see me crossing the road. Not even a hint of trying to stop, was just plain going and I had to jump off the longboard at the last minute with about a meter to spare.</p>\n<p>Then I went to an event at the Cyberpipe, again with a longboard. At this point I seriously stopped counting the number of pedestrians magically winding up in my way and almost ending up killed. It&#8217;s all just a blur, indistinctive people always winding up riiiiiight where I want to go.</p>\n<p>As if by magic!</p>\n<p>An even more interesting thing happened on my way back home. I was passing a group of pedestrians and another group suddenly appeared out of nowhere so people took up almost the entire sidewalk. Somehow managed to swerve around everyone and just as I was about to propel myself forward I suddenly lost balance and try to catch my footing.</p>\n<div style=\"width: 173px\" class=\"wp-caption alignleft\"><a href=\"http://www.flickr.com/photos/40230716@N03/5044996221\"><img class=\"zemanta-img-inserted zemanta-img-configured \" title=\"Longboarding\" src=\"http://swizec.com/blog/wp-content/uploads/2011/12/5044996221_e7c0225126_m1.jpg\" alt=\"Longboarding\" width=\"163\" height=\"240\" /></a><p class=\"wp-caption-text\">Longboarding</p></div>\n<p>Sure enough, to catch my footing I stepped on the longboard and shot it from underneath me with great speed. Didn&#8217;t fall but did have to run after the damn thing. Just when I almost caught it, the longboard went off the sidewalk and into the street.</p>\n<p>Ran after it, but there was a bus and &#8230; hey, it&#8217;s going to come out the other end right!? It did come out the other end, or rather somewhat to the side and juuuust as I was about to pick it up, it approached a car.</p>\n<p>And the light turned green. The driver not noticing anything started off and drove right over the front-left side of my longboard, shooting it up into the air about a meter and right in my fucking leg.</p>\n<p>The longboard then bounced off my bone and under the bus again narrowly missing being run over by a very huge tyre.</p>\n<p>Not counting another guy who nearly ran me over because he didn&#8217;t see my crossing the street, the rest of the trip home was rather uneventful.</p>\n<p>Should I be happy I&#8217;m alive?</p>\n<h6 class=\"zemanta-related-title\" style=\"font-size: 1em;\">Related articles</h6>\n<ul class=\"zemanta-article-ul\">\n<li class=\"zemanta-article-ul-li\"><a href=\"http://www.coolhunting.com/design/erickson-longbo.php\">Erickson Longboards</a> (coolhunting.com)</li>\n<li class=\"zemanta-article-ul-li\"><a href=\"http://www.thestar.com/news/article/1052107--army-of-skateboarders-takes-over-downtown-streets\">Army of skateboarders takes over downtown streets</a> (thestar.com)</li>\n<li class=\"zemanta-article-ul-li\"><a href=\"http://coedmagazine.com/2011/12/10/chill-original-longboarding-country-roads-session-video/\">Wake and Bake To This Chill Longboarding Sesh [VIDEO]</a> (coedmagazine.com)</li>\n</ul>\n<div class=\"zemanta-pixie\" style=\"margin-top: 10px; height: 15px;\"><a class=\"zemanta-pixie-a\" title=\"Enhanced by Zemanta\" href=\"http://www.zemanta.com/\"><img class=\"zemanta-pixie-img\" style=\"border: none; float: right;\" src=\"http://img.zemanta.com/zemified_e.png?x-id=90c754a9-3b5e-49e1-9d1e-d0e48e96fcbb\" alt=\"Enhanced by Zemanta\" /></a></div>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"1a292ff4-9817-5d26-89f7-e1c202556d62"}}