{"data":{"wordpressPost":{"title":"Advent of Code Day 24 – The A* Algorithm, I think","content":"<p>On Day 24 of Advent of Code we had to build a path finding algorithm. We&#8217;re given a set of nodes and a heuristic and have to find the best possible path.</p>\n<blockquote class=\"twitter-tweet\" data-width=\"550\">\n<p lang=\"en\" dir=\"ltr\">OMG I DID IT! I built a recursive implementation of A* in Haskell all on my own for <a href=\"https://twitter.com/hashtag/AdventOfCode?src=hash&amp;ref_src=twsrc%5Etfw\">#AdventOfCode</a> Day 24.</p>\n<p>Didn&#39;t even have to look it up 💪</p>\n<p> <a href=\"https://t.co/9j4Iq5VN1u\">pic.twitter.com/9j4Iq5VN1u</a></p>\n<p>&mdash; Swizec (@Swizec) <a href=\"https://twitter.com/Swizec/status/945176148358524929?ref_src=twsrc%5Etfw\">December 25, 2017</a></p></blockquote>\n<p><script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></p>\n<p>The puzzle uses different phrasing, but that&#8217;s what it is.</p>\n<blockquote><p>Build a bridge out of the magnetic components strewn about nearby.</p>\n<p>Each component has two ports, one on each end. The ports come in all different types, and only matching types can be connected. You take an inventory of the components by their port types (your puzzle input). Each port is identified by the number of pins it uses; more pins mean a stronger connection for your bridge. A 3/7 component, for example, has a type-3 port on one side, and a type-7 port on the other.</p>\n<p>Your side of the pit is metallic; a perfect surface to connect a magnetic, zero-pin port. Because of this, the first port you use must be of type 0. It doesn&#8217;t matter what type of port you end with; your goal is just to make the bridge as strong as possible.</p>\n<p>The strength of a bridge is the sum of the port types in each component. For example, if your bridge is made of components 0/3, 3/7, and 7/4, your bridge has a strength of 0 3 3 7 7 4 = 24.</p></blockquote>\n<p>You can model this as a graph path finding algorithm.</p>\n<p>Each component is a node. It connects to all other components with matching pin numbers. Our job is to find the most expensive path in this imaginary graph.</p>\n<p>Let&#8217;s take the test input:</p>\n<pre>0/2\n2/2\n2/3\n3/4\n3/5\n0/1\n10/1\n9/10\n</pre>\n<p>With those nodes, our graph of connections looks like this 👇</p>\n<img class=\"aligncenter size-full wp-image-8003\" src=\"https://swizec.com/blog/wp-content/uploads/2017/12/advent-of-code-day-24-graph.jpg\" alt=\"\" srcset=\"https://swizec.com/blog/wp-content/uploads/2017/12/advent-of-code-day-24-graph.jpg 800w, https://swizec.com/blog/wp-content/uploads/2017/12/advent-of-code-day-24-graph-300x225.jpg 300w, https://swizec.com/blog/wp-content/uploads/2017/12/advent-of-code-day-24-graph-768x576.jpg 768w\" sizes=\"(max-width: 800px) 100vw, 800px\" /><img src=\"graph\" alt=\"\" />\n<p>Sorry that&#8217;s not laid out the best and I don&#8217;t have my usual colourful markers on me right now. But that&#8217;s our graph.</p>\n<p>The correct solution in this case is: <code>0/1--10/1--9/10</code> for a total strength of <code>31</code>.</p>\n<h2>My A* implementation in Haskell</h2>\n<p><a href=\"https://github.com/Swizec/advent-of-code-2017/blob/master/24.hs\">Full code on Github</a></p>\n<p>To find that solution we can use the famous <a href=\"https://en.wikipedia.org/wiki/A*_search_algorithm\">A* algorithm</a>, which is itself an improvement on the even more famous <a href=\"https://en.wikipedia.org/wiki/Dijkstra%27s_algorithm\">Dijkstra algorithm</a>. This is the stuff I used to nerd out on in college. 😇</p>\n<p>Now I can&#8217;t promise my algorithm is a true implementation of A* <em>or</em> of Dijkstra&#8217;s algorithm. I used what I remembered from college as inspiration and derived the search algorithm from scratch all on my own.</p>\n<figure><img src=\"https://upload.wikimedia.org/wikipedia/commons/5/5d/Astar_progress_animation.gif\" alt=\"A* search algorithm visualization\" /><figcaption>A* search algorithm visualization</figcaption></figure>\n<p>It was so much fun that it kept me from my Christmas duties and my girlfriend complained. A lot.</p>\n<p>The core of my solution is the recursive <code>buildBridge</code> function. It builds bridges (graph paths) from all possible candidates for the next bridge piece, then chooses the best one.</p>\n<pre lang=\"haskell\">-- build bridge with maximum score\nbuildBridge::Int -> [(Int, Int)] -> [(Int, Int)] -> [(Int, Int)]\nbuildBridge port [] bridge = bridge\nbuildBridge port pool bridge\n    | length opts > 0 = maximumBy (comparing heuristic) $ map (\\(nextPort, link) -> \n        buildBridge nextPort (poolWithout link pool) (bridge ++ [link])) opts\n    | otherwise = bridge\n    where opts = candidates port pool []\n    \nheuristic::[(Int, Int)] -> Int\nheuristic links = sum [a b | (a, b) <- links]\n</pre>\n<p>That's not the prettiest Haskell code. Here's what it means:</p>\n<ul>\n<li><code>buildBridge</code> is a function that takes a number, two lists of <code>(number, number)</code> tuples, and returns a list of <code>(number, number)</code> tuples. The number is the <code>port</code> we're trying to build bridges for, the first list is a <code>pool</code> of available components, and the 3rd list is the current <code>bridge</code> we're extending.</li>\n<li>if the <code>pool</code> of available components is empty, return the <code>bridge</code></li>\n<li>build a list of <code>candidates</code> for the next component and put it in <code>opts</code></li>\n<li>if <code>opts</code> has a length greater than zero, return the best bridge where you <code>buildBridge</code> for each candidate component</li>\n<li>if there are no available candidates, return the <code>bridge</code></li>\n<li>the <code>heuristic</code> function sums all ports in the bridge</li>\n</ul>\n<p>Each time we go into a recursion, we take components out of the component pool that's passed into <code>buildBridge</code>. That guarantees we don't accidentally use a component multiple times.</p>\n<p>I find it difficult to visualize how this algorithm works. 😅 It's something between a breadth first search and Dijkstra's algorithm. Not actually sure it's A* after all 🤔</p>\n<h2>How it works</h2>\n<p>For every node, we find all possible nodes we can connect to (its neighbors). For each of those we build a path all the way to the end. This gives us all possible paths through the graph.</p>\n<p>Then we unwind the recursion to collapse them into the best possible path.</p>\n<p>For the test input, all possible exhaustive paths are:</p>\n<pre>0/1--10/1--9/10\n0/2--2/3--3/4\n0/2--2/3--3/5\n0/2--2/2--2/3--3/4\n0/2--2/2--2/3--3/5\n</pre>\n<p>As our recursion unwinds, it picks the best path based on our heuristic function. You can think of that process as replacing nodes with their values and picking the best option.</p>\n<pre># Step 1\n0/1--10/1--19\n0/2--2/3--7\n0/2--2/3--8\n0/2--2/2--2/3--7\n0/2--2/2--2/3--8\n\n# Step 2\n0/1--30\n0/2--13\n0/2--2/2--13\n\n# Step 3\n31\n15\n0/2--17\n\n# Step 4\n31\n15\n19\n\nStep 5\n31\n</pre>\n<p>At each step of unwinding, we can discard low value alternatives when they share the same bridge root. Eventually we end up with a single possibility.</p>\n<p>This <em>sounds</em> a lot like the description of A<em>, but I'm honestly not sure that my algorithm is A</em>. 😕</p>\n<h2>The helper functions</h2>\n<p>Either way, to find those <code>candidates</code>, we use the <code>candidates</code> function:</p>\n<pre lang=\"haskell\">-- find all possible candidates for next link\ncandidates::Int -> [(Int, Int)] -> [(Int, (Int, Int))] -> [(Int, (Int, Int))]\ncandidates port [] acc = acc\ncandidates port pool acc\n    | (-1, -1) == link = acc\n    | otherwise = acc    [(nextPort, link)] ++ (candidates port nextPool acc)\n    where (nextPort, link) = findNext port pool\n          nextPool = poolWithout link pool\n</pre>\n<p>This function takes a <code>port</code> we're connecting to, a <code>pool</code> of components, and the current known list of results, <code>acc</code>.</p>\n<p>We use <code>findNext</code> to find the next component we can use, called <code>link</code>. Link because it's going to be a link in the bridge. We take it out of the <code>nextPool</code> of components passed into recursion using <code>poolWithout</code>.</p>\n<p>If the <code>link</code> was found, we expand our known list of candidates, <code>acc</code>, with the new link and a call to <code>candidates</code> with the remaining pool.</p>\n<p>You may be wondering why we're spending so much time passing ports around instead of nodes. It's because each node is made out of two ports and each port can only be used once. We try to keep track of that.</p>\n<p>For instance when we look for candidates to connect to <code>(0, 1)</code> we know that <code>0</code> is already used. So we look for anything that can connect to <code>1</code>. When we find <code>(1,2)</code> and <code>(3,1)</code> we have to note that <code>1</code> is used up so the next node will have to connect to either <code>2</code> or <code>3</code>.</p>\n<p>The <code>findNext</code> function is where this finding happens.</p>\n<pre lang=\"haskell\">-- find next link in bridge and which port to use for next next link\nfindNext::Int -> [(Int, Int)] -> (Int, (Int, Int))\nfindNext port [] = (port, (-1,-1))\nfindNext port pool\n    | port == left = (right, (left, right))\n    | port == right = (left, (left, right))\n    | otherwise = findNext port (tail pool)\n    where (left, right) = head pool\n</pre>\n<p><code>findNext</code> returns the first matching component from our pool. When the pool is empty, it returns <code>(-1, -1)</code> to signify nothing was found.</p>\n<p>When the <code>port</code> matches either <code>left</code> or <code>right</code> side of the component, we return that component and the next port it can match to. If <code>left</code> matched, we return <code>(right, (component))</code>, if <code>right</code> matched, then we return <code>(left, (component))</code>.</p>\n<p>If nothing matched and there's still stuff in the pool, we return whatever <code>findNext</code> finds in the pool without the first element. Because we checked the first element just now.</p>\n<p>Recursion 🤙</p>\n<p>The <code>poolWithout</code> function we used in a couple places is a simple <code>filter</code> by they way 👇</p>\n<pre lang=\"haskell\">poolWithout::(Int, Int) -> [(Int, Int)] -> [(Int, Int)]\npoolWithout link pool = filter (\\x -> link /= x) pool\n</pre>\n<h2>And that works</h2>\n<p>That mass of recursion that's hard to visualize in your mind works. It really does. I'm kinda surprised. It feels like magic.</p>\n<p>I mean, I wrote the algorithm. I derived it from scratch. And when I try to think about how it works my mind just goes</p>\n<figure><img src=\"http://www.reactiongifs.com/r/2013/10/tim-and-eric-mind-blown.gif\" alt=\"\" /></figure>\n<p>Recursion is hard, okay.</p>\n<p>So did I build A* or not? This is gonna bother me 😕</p>\n<h2>PS: star 2</h2>\n<p>For Star 2, we had to find the longest possible bridge with the best score. Same algorithm, different heuristic function.</p>\n<pre lang=\"haskell\">heuristic2::[(Int, Int)] -> [(Int, Int)] -> Ordering\nheuristic2 a b\n        | la > lb = LT \n        | la > lb = GT\n        | la == lb = compare (heuristic a) (heuristic b)\n        where la = length a\n              lb = length b\n</pre>\n<p>Compare lengths, if lengths are the same, use the previous heuristic function based on strength.</p>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"82ad2636-d321-5331-a8a6-b7223a4d38e3"}}