{"data":{"wordpressPost":{"title":"17. Maj","content":"<p>\n Some interesting things have happened today, but they are not what this blog is about, oh no, those are being saved for later. In their stead I give you a <a href=\"http://en.wikipedia.org/wiki/Gonzo_journalism\" target=\"_blank\">gonzo</a> tale of Saturday night.\n</p>\n<p>\n Roaring down the highway, speakers blasting music in my ears as speeds far above the speed limit I thought to myself: &bdquo;If I actually find the place it will be a miracle!&ldquo;</p>\n<p> A quick swerve and some stop lights later I wedged the car between a red battered one and a blue unbattered one, leaving half of it out in the open because there was simply no room. I had found the place. Without taking a wrong turn and most surprisingly without calling for additional directions. For once the guy&#39;s directions were sufficient. A miracle in itself.</p>\n<p> Dusk was upon us as the armies of the night invaded the sky and the poor chap was pushed into full blown depression. The square in the wall was shining light on me and muffled sounds of distant music came from within. Down the stairs I went thinking that, oh god, it&#39;s already started and I was late.</p>\n<p> Finding the right door to open once down there was a true escapade. Doors everywhere you looked, some opened, some closed, most locked. Finally I choose the right one and step into the dark muck of the club.</p>\n<p> The music I had heard was not coming from the band the evening revolved around. Oh no. It was just speakers bigger than myself and five people sitting on an old sofa full of smoke buds and beer. What&#39;s this I shouted! But nobody gave notice.</p>\n<p> I tried mingling for a bit. The task was difficult, there wasn&#39;t enough beer involved in their systems&#39; makeup just yet. The mingling would have to wait. So I resorted to discovering just what the club was comprised of. Apparently the most significant part of the club were pipes and cables and things I would never understand. But they were there regardless.</p>\n<p> The stage was a small one, filled with cables and guitars and amps and dials and buttons and odd things only a drunk person could use. I was not allowed. The band would have to get up there in its drunken stupor and do their thing. Nobody else knew how.</p>\n<p> Except maybe for the Zooland band members who came to see the show. Perhaps.</p>\n<p> A sit on the sofa is offered. &bdquo;Yes, yes, fine very well, I will sit with you&ldquo;</p>\n<p> &bdquo;So when&#39;s the show then?&ldquo; I ask the person next to me who is none other than the guy&#39;s girlfriend I&#39;ve heard so much about but never actually met. That rotten bastard. Hiding a treasure such as this.</p>\n<p> &bdquo;Well they need to have the sound check and then the drinks and you know. About &#8230; a lot later than right now&ldquo;</p>\n<p> &bdquo;Good god!&ldquo; I thought, &bdquo;I&#39;ve descended into the snake pit of perversion and fun. What am I to do until then!&ldquo;</p>\n<p> But nobody heard my plea anymore. Did I even say it out loud? </p>\n<p> Suddenly I realised I was walking around again in a bored stupor. How&#39;d this happen, wasn&#39;t I just sitting in a very comfortable position on a comfortable sofa being comfortable? Why did I get up?</p>\n<p> Out of nowhere the guy shows up, looks at me, suggest we go to the backstage.</p>\n<p> &bdquo;What? Backstage? Sure sure, yes of course, why not, let&#39;s go, let&#39;s go! What are you waiting for!&ldquo;</p>\n<p> But he wasn&#39;t, he was already almost there. I followed.</p>\n<p> The sofa here was even more comfortable. One of those old springy kinds that just enwraps you in a very frightening way when you sit on it. But you yelp out ecstatically about its comforts. Soon enough we were babbling away about events occuring a few nights ago, or was it a week. The guy spent that time in a very drunken state not remembering any of it.</p>\n<p> Promises have been made on my part never to speak of what happened that day, in that backstage for that matter, never. Why would? We were probably fornicating and that is simply not something you tell everyone about. Especially if you&#39;re both very straight and very normal.</p>\n<p> Normal! HA!</p>\n<p> Out of nowhere his girlfriend shows up. Was that her on the phone a few moments earlier while I was still babbling away things I wasn&#39;t supposed to? Did she hear? Were we sweaty? I couldn&#39;t resist the temptation any longer. She had to be asked!</p>\n<p> &bdquo;How long does it take to do those fancy shoelace artwork thingies?&ldquo;</p>\n<p> &bdquo;What?&ldquo;</p>\n<p> &bdquo;The shoes woman! The shoes! God damn it, your shoes!&ldquo;</p>\n<p> &bdquo;About five minutes&ldquo;</p>\n<p> &bdquo;No way,&ldquo; I though, &bdquo;she lies! Everyone with the checkerboard shoelaces does. They all do I tell you, everyone! It takes me more than five minutes to tie my bloody boots and you&#39;re telling me this? No way I&#39;ll ever believe any of you. Bloody nimble fingered people&ldquo;</p>\n<p> I&#39;m touching the light bulb, covered with something red, on the wall. I&#39;d noticed it a few moments earlier. It was simply something that had to be touched!</p>\n<p> On the sofa again I was offered free drinks by that very same girl person. Do I want a drink? Yes, sure of course, I could go for a drink, my mouth is the bloody Sahara by now. What? Choices? No, I don&#39;t care, just something nonalcoholy, I am driving you know. Flavours? What the hell are you on about? Just bring me something, I don&#39;t care.</p>\n<p> And suddenly I was alone on that comfortable sofa making me feel comfortable and petrifiedly sunk. Oh fuck, the band&#39;s starting! I calmly raced out of the backstage, across the stage, nicked my hat back from the guy and positioned myself in the crowd of twenty.</p>\n<p> A-Zone, or aZone or Azone or whatever it is they spell their bloody, not yet officialised, name, I will never learn this, were at it again. Sound screaming out of the huge speakers I was leaning on and the lead shouting into the mic. It was ecstasy. Perhaps not quite the type of ecstasy you get from seeing Big Foot Mama live, but definitely the sense of &bdquo;This band is going places, if only they play it just right.&ldquo;</p>\n<p> I&#39;ve known the band ever since their beginnings as Untitled and they&#39;ve grown. Missing some of the old hits I dearly loved I was blasted with their song Ti, or is it Ti!, who could tell. The rhythm of that one is still ringing in my ears and it&#39;s not just because it&#39;s the only one they did twice.</p>\n<p> At first the applauds were mellow and luke warm, but they grew starker and starker as the people got drunker and drunker. Not sure how you can get so much drunker in a little more than an hour, but it might just be the band and the people warming up to them.</p>\n<p> 17. Maj, or May if we&#39;re being terribly Englishy and refusing our language the right even to be forming this story, what the hell, why am I doing this? Am I not patriotic? Bloody hell, and so much written already. No, cannot be fucked to redo all this in the one and only really good language.</p>\n<p> Where were we? Ah yes, that song, a hugely awesome rock balade, is awesome. No doubt about it, definitely the most bestest in the repertoir. The lyrics are completely something I will never be able to memorise, but to hell with that, it&#39;s an awesome song.</p>\n<p> And just like that the show was over and I craving for more. Fascist bastards. And that&#39;s a real insult too, they&#39;re pro communism. Being left high and dry I was seeking a leaf to hold on to. Everyone is grouping up quickly, I must do something about this or they will all become unavailable.</p>\n<p> There he is. The guy. No, not even notice me will you. Suddenly he&#39;s in front of me. Time has passed? </p>\n<p> &bdquo;Were you good? You&#39;re asking me if you were good?&ldquo; I thought, but being cool about it I just went &bdquo;You were bloody awesome. Really. Not like the last time at all. You&#39;re not even that drunk &#8230;yet&ldquo;</p>\n<p> He smiled and walked off to destinations unknown.</p>\n<p> And just like that the place emptied, the DJ that followed was left to play to an empty room and the car I had borrowed from mum specifically to be able to come to this venue was full of an amplifier and a bass guitar. What the hell! Those things are bloody huge, huger than the trunk of the car.</p>\n<p> We shoved ourselves next to them, me for driving, the guy for holding the amp and the bass and his lass to sit in front and tell me where to go and not to listen to him telling me where to go. In her defence, he did once suggest I swerve left right into a wall. Idiot.</p>\n<p> Suburbia is a strange place, when it&#39;s undecided the suburbia of what exactly it is, it becomes even stranger. The houses did not look all the same and the streets were very differing amongst each other. But I&#39;ll be damned if I knew where I was half the time. Bloody miracle I got home on my own.</p>\n<p> Unloading the car, seeing the guy&#39;s girly&#39;s house from outside and the garage from within &#8230; well maybe this part isn&#39;t so interesting. Let&#39;s just leave it out of the tale.</p>\n<p> Next interesting thing that was going on was us at a long dead garden party type of thing. It&#39;s been finished for hours but the people were still there refusing not to have drunken fun. I was perhaps the only not drunk person there at all. But hell, it was entertaining.</p>\n<p> &bdquo;Hi, who are you?&ldquo;</p>\n<p> &bdquo;What me? Oh I&#39;m just myself, you know, standing here, looking at you people&ldquo;</p>\n<p> Why is this girl talking to me? What are her motives, what does she want of me damn it! Maybe if I just talk to her nicely and chatter along she won&#39;t bite my head off when we&#39;re done. Maybe, just maybe I&#39;ll live to tell about it. Are those horns coming out of her head?</p>\n<p> &bdquo;What are you doing?&quot;\n</p>\n<p>\n<br />\n &bdquo;I&#39;m just admiring your backpack. It&#39;s the same as mine!&ldquo; &#8230; &bdquo;No of course I didn&#39;t repeat after you! Lol you&#39;re being silly!&ldquo; Yes, I do say lol in real life, deal with it.</p>\n<p> Why is the guy gesturing frantically at me? Having a seizure are we? Hit on her? No, you&#39;re crazy. I don&#39;t want anything to do with this one. She&#39;ll bite my head off and I need that bloody thing to put my hat on. Where am I to put a hat without a head you rotten bastard! Oh look, how nice of him to fend away every other male who wants to bud in on this conversation. It&#39;s cute and he&#39;s probably saving their lives &#8230; this one looks dangerous.</p>\n<p> What? You want my msn? You want to talk to me again? Sure you do, give me the cellphone, this will take too long if I try telling you what to write down. Hmmm, nice one, she went away, I could flee with this piece of machinery in my hand &#8230; No, just write down what she wants, best to give these fiends what they ask for. Anger is unpredictable.</p>\n<p> Going home? Sure sure, you go. Relieved that my life was saved so miraculously by something as benign as curfew for the poor sixteen year old, I walked back into the old crowd of that girlfriend and, well, the guy was mingling frantically anyway, he wasn&#39;t to be counted on.</p>\n<p> Yes she did run away. No I wasn&#39;t at fault. God, woman! Why does everyone think I should hit on her! And just like that we were suddenly being terrorised by a huge tall guy who claims to have huge general knowledge but couldn&#39;t name three famous painters.</p>\n<p> A few weird conversations later, just the guy, the girl and myself sitting in the middle of the street with myself being the physical third wheel and the girl being a conversational one. What is it about the guy and myself that whenever we&#39;re with one of his girlfriends they&#39;re the ones to be left out. Weird.</p>\n<p> Roaring down the highway with music blasting in my ears at four in the morning I eventually came home through the empty road and slowly creeped into bed and died until noon.</p>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"3651fc2f-4205-50e6-85f4-694df35919e4"}}