{"data":{"wordpressPost":{"title":"That one time a simple for-loop increased conversions by 19%","content":"<p>Once upon a time, I made a brilliant decision: We&#8217;re going to make a new background worker for every analytics event on our platform.</p>\n<p>The goal was simple: have real-time analytics, don&#8217;t be bound to a single provider, keep local copies of all events in case something goes wrong.</p>\n<p>I designed a system that does that. Clients (web and mobile) send events to our server, our server stores them in the database and creates a new worker on the queue. That worker runs, sends the event to Mixpanel, and marks it as sent.</p>\n<p>With this design, we can easily switch to a different provider. Just change the call on our backend, clients keep the same API. Wonderful.</p>\n<p>If anything goes wrong when talking to Mixpanel, or if we need to run a complex query involving events and the rest of our data, we can. All events are stored. Wonderful.</p>\n<p>Job well done.</p>\n<img src=\"https://media.giphy.com/media/Mp4hQy51LjY6A/giphy.gif\" />\n<p>Until one day <a href=\"https://www.yup.com\">Yup</a> got a lot of traffic.</p>\n<p>No, the analytics didn&#8217;t stop working. Our database didn&#8217;t get flooded. Oh no. Don&#8217;t you worry about our database. Postgres can handle hundreds of millions of rows. Postgres is a champ.</p>\n<p>No, no. What happened was that our &#8220;We send code to your phone to log in&#8221; system stopped sending out codes. 2 minutes, 3 minutes, sometimes an hour late. Often ten codes at a time would arrive to the same person because they retried so often. Codes were out of sequence, too.</p>\n<p>Wait what?</p>\n<p>A-ha! Let me explain!</p>\n<p>You see, we use <a href=\"https://github.com/mperham/sidekiq\">Sidekiq</a> to queue our background jobs. It assigns all your tasks to a <code>default</code> queue unless you specify.</p>\n<p>Somewhere along the line, we got lazy and we stopped specifying. Everything went to the same queue and it worked great. Until we had traffic.</p>\n<img class=\"alignnone size-full wp-image-7874\" src=\"https://swizec.com/blog/wp-content/uploads/2017/10/backed-up-queue.png\" width=\"958\" height=\"540\" srcset=\"https://swizec.com/blog/wp-content/uploads/2017/10/backed-up-queue.png 958w, https://swizec.com/blog/wp-content/uploads/2017/10/backed-up-queue-300x169.png 300w, https://swizec.com/blog/wp-content/uploads/2017/10/backed-up-queue-768x433.png 768w\" sizes=\"(max-width: 958px) 100vw, 958px\" />\n<p>Once we had traffic, our analytics workers filled up the queue. Users created tens of them before they even got to the login screen. Others were creating hundreds past the login screen.</p>\n<p>At one point, we estimate we had almost 20,000 jobs stuck in the queue. Most of them were analytics. Some of them were business critical. Many of them were waiting to let people login and try our service.</p>\n<p>😅</p>\n<p>How do you fix this?</p>\n<p>With a <code>for</code> loop.</p>\n<p>Let me explain.</p>\n<p>Say you&#8217;re sending each event in its own worker. The job itself is really fast. It takes less than 1 second to execute. But scheduling that job, keeping it around, making a worker to run it, executing the Ruby on Rails machinery… all that takes time. A lot of time.</p>\n<p>But instead of being eager and opportunistic, you can send events in batches. Say a worker wakes up every 5 minutes and sends all events from the past 5 minutes that haven&#8217;t been sent yet.</p>\n<p>Now you have a worker that takes longer to run. Several seconds, even a few minutes.</p>\n<p><strong>But you run only 30 jobs per hour instead of 10,000.</strong></p>\n<img class=\"alignnone size-full wp-image-7873\" src=\"https://swizec.com/blog/wp-content/uploads/2017/10/batched-queue.png\" width=\"958\" height=\"542\" srcset=\"https://swizec.com/blog/wp-content/uploads/2017/10/batched-queue.png 958w, https://swizec.com/blog/wp-content/uploads/2017/10/batched-queue-300x170.png 300w, https://swizec.com/blog/wp-content/uploads/2017/10/batched-queue-768x435.png 768w\" sizes=\"(max-width: 958px) 100vw, 958px\" />\n<p>The downside? Instead of real-time analytics, you have to wait 5 minutes to see what&#8217;s up.</p>\n<p>How often do you check those charts anyway? Once a day? Every hour? Pretty sure you&#8217;re not checking every two seconds.</p>\n<p>Code send times dropped from an average of 3 to 4 minutes to an average of about 10 seconds. Sometimes 20.</p>\n<p>Our conversion rate from downloading <a href=\"https://www.yup.com\">Yup</a> to having a trial increased by 19%. All from a 5-line <code>for</code> loop. Boom.</p>\n<img src=\"https://media.giphy.com/media/OK27wINdQS5YQ/giphy.gif\" />\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"a93a450a-b48c-5bf4-b7aa-875c1b72abe6"}}