{"data":{"wordpressPost":{"title":"Boobies","content":"<p>\n Firstly I should just mention that due to untranslatability this post will be available only in English and since that means it doesn&#39;t have to be written twice it might get a bit long, but then again it might not, who could really tell in advance right &#8230; you have been warned.\n</p>\n<p>\n Have you ever thought about how many words there are for naughty human bits? Well I would wager most languages do this but english seems especially creative with inventing obscure meraphors to name things like breasts or genitalia, and who could blame it really, it&#39;s fun to make up words and only denote what you mean by tone of voice or context.\n</p>\n<p>\n I&#39;m not sure why, but in the mouth of a skilled vocaliser pretty much any word can sound naughty and practically any word can have a meaning of, let&#39;s say juggs, when used properly. Hell, there are millions of them ranging all the way from the very clinical breasts to juicy twins. Practically any round item can be used as a metaphor for the wretched sacks of blubber &#8230; like melons or oranges.\n</p>\n<p>\n Yes, of course, they aren&#39;t direct synonyms, which is probably what gives the whole mess reason to live really, because who would want to use words that mean exactly the same &#8230; that&#39;s right, nobody. Each of the metaphors speaks of a bit different boobs, but in the long run they&#39;re all still just breasts.\n</p>\n<p>\n When you think about it though, most of the words really don&#39;t fit the subject at hand at all. Breasts is too stiff and clinical, juggs just sounds too dirty and boobs simply doesn&#39;t have enough syllables even tho\n</p>\n<p>\n ugh it is rather rounded &#8211; comes out too hard. The only word that does them justice is boobies, because let&#39;s face it, the word simply symbolises what it represents in all possible ways possible.\n</p>\n<p>\n There are two syllables, representing the duality of the subject matter, it is filled with round sounds like <em>b</em> and <em>o</em>, and hell, even the lovable <em>l </em>flows nicely and roundly off the tongue. The <em>ie</em> is a sound of, well it&#39;s difficult to explain, but it makes the word whole. It makes the word roll off your tongue nicely and without any hassle &#8230; just like boobies should in the hands of a skilled practitioner, round, soft and smooth &#8230;\n</p>\n<p>\n But anyway, the point at hand is that there are few words in english that sound so beautiful and so wholly symbolise their meaning. The only phrase that comes close in sound to boobies is <em>cellar door</em> and nobody can really say just why that sounds so nice.\n</p>\n<p>\n&nbsp;\n</p>\n<p>\n In after thought, I wonder if all this talk about boobies and sex will make google find me easier &#8230; it just might, everybody knows google is so popular because it&#39;s the single biggest source of free porn online.</p>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"f0df2597-f047-5c80-8d6b-cddf3f7a4f0f"}}