{"data":{"wordpressPost":{"title":"In year 2009 I will &#8230;","content":"<p>New year&#8217;s resolutions are a fairly popular phenomenae right about now and since I can&#8217;t remember ever making any and probably even if I had done them I forgot since they weren&#8217;t written down, I&#8217;ve decided to once for a change give you a normal blogpost. I will write down my very own new year&#8217;s resolutions without cynicism, without criticising others for making them, without even calling the population at large stupid for taking this time out of the year to make ground breaking decisions instead of revising their daily lives on a daily basis. No, that will come tomorrow or the day after that. Perhaps.</p>\n<p>So, in year 2009 I will &#8230;</p>\n<p>&#8230; do my best to achieve the target weight I&#8217;ve set for myself quite some time ago and haven&#8217;t managed to achieve. Despite what you might be thinking this isn&#8217;t about losing weight, I would like to put on ten more kilograms, but of muscle rather than fat. Fat is too easy.</p>\n<p>&#8230; do everything in my power to make the next few steps to becoming filthy rich. No silly &#8220;oooh rich people be dumb because they take our money durr&#8221; from me, no, I will be rich. Rather sooner than later.</p>\n<p>&#8230; do everything I can to make Twitulater the next best thing since sliced bread and at the very least as popular as TweetDeck. So far it&#8217;s looking promising, mustn&#8217;t fuck up now.</p>\n<p>&#8230; buy a beemer because I&#8217;ve promised mum I&#8217;d save up for a vehicle and buy one instead of paying rent at home. But I&#8217;d also promised myself my first bought car would be a beemer. Saving up looking promising so far.</p>\n<p>&#8230; become even more cynical and convoluted than I was so far. Why? Because I love fucking with people and there is no better way to fuck with them than not caring about most of the things you say and being completely reliant on your ability to repair any damage your words do.</p>\n<p>&#8230; buy a cane because I&#8217;ve wanted one for ages.</p>\n<p>&#8230; finish first year of uni. I have to, I must stop being so stupid about this whole thing and even though I don&#8217;t believe in formal education, the rest of the world does and if I ever want to have a backup plan in case all my become-filthy-rich schemes fail I need to have some sort of formal degree.</p>\n<p>&#8230; try my best to screw with my girlfriend and learn as much as I can about the female psyche from her.</p>\n<p>&#8230; not push my mental experiments on the girlfriend so far as to damager her or our relationship.</p>\n<p>That&#8217;s it for now I think, have a lot of work to do next year, best get cracking right away.</p>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"b150cbb5-9392-5a14-a07b-f444d7f200ad"}}