{"data":{"wordpressPost":{"title":"TV&#8217;s are now computers O.o","content":"<p>The television set I grew up with left our place yesterday. It&#8217;s actually kind of odd, as my hometown has changed year to year, as I went to different schools, changed my computers, my tastes in culture, even most of the furniture I&#8217;m using &#8230; the one thing that has always stayed the same was the family television set.</p>\n<div style=\"width: 360px\" class=\"wp-caption alignright\"><img class=\" \" title=\"The old telly\" src=\"http://swizec.com/blog/wp-content/uploads/2011/11/tumblr_lummi415Um1qekjngo1_50010.jpg\" alt=\"The old telly\" width=\"350\" height=\"350\" /><p class=\"wp-caption-text\">The old telly</p></div>\n<p>I still sort of remember the shopping trip when we brought it home with my dad. I must have been around four years old, which would make that TV around twenty years old now.</p>\n<p>Twenty long years.</p>\n<p>And now it&#8217;s gone. It went quietly, without fanfare, nobody gave it two thoughts. As simple as moving a big lump of glass and electronics and plastic down four flights of stairs without a lift. For the last year you even had to use a toothpick to turn on our dear telly, and lately the image was all flickery and without colour.</p>\n<p>And then we plugged in the new one.</p>\n<p>Holy mother of god, what televisions have done in the past 20 years! That thing is a freaking computer!</p>\n<p>Hell, you have to politely ask it to recognise all manners of external devices, even the set-top-box needs to politely introduce itself! The menus and dials indicate that something as simple as a sound system needs a warm introduction as well.</p>\n<div style=\"width: 360px\" class=\"wp-caption alignleft\"><img class=\" \" title=\"Sexy new telly\" src=\"http://swizec.com/blog/wp-content/uploads/2011/11/tumblr_lun8x9awgB1qekjngo1_5003.jpg\" alt=\"Sexy new telly\" width=\"350\" height=\"350\" /><p class=\"wp-caption-text\">Sexy new telly</p></div>\n<p>Yep, that telly rules the living room and <em>it knows it</em>. I&#8217;m sure whenever the television is off it sings <em><a href=\"http://www.youtube.com/watch?v=wyx6JDQCslE&amp;ob=av3e\" target=\"_blank\">sexy and I know it</a></em> quietly in its own ear.</p>\n<p>The most technologically interesting bit I&#8217;ve found so far is the ethernet port on the back.</p>\n<p>Apparently you can connect the television (should I be calling this thing a stripped down computer?) to your home network and stream movies right from a computer &#8211; obvious choice here would be my linux box holding the collection of roughly 960GB of video &#8230; why do I have that much again? Guess that happens when you have FTTH.</p>\n<p>There&#8217;s problem with this epic feature though. The telly is still not a computer and can&#8217;t just browse stuff on the network. Nope, needs something called a <a class=\"zem_slink\" title=\"UPnP AV media server\" href=\"http://en.wikipedia.org/wiki/UPnP_AV_media_server\" rel=\"wikipedia\">UPnP Media Server</a> to stream the files. Unfortunately, the internet is very scarce with information about this (or I suck at looking for it), but the best I&#8217;ve found so far is <a href=\"http://mediatomb.cc/\" target=\"_blank\">MediaTomb</a>.</p>\n<p>No luck so far getting the TV to recognise this server exists on the network and playing the files. Brilliant success playing HD movies from a portable disk though &#8230;</p>\n<p>Another useful feature on these modern television set things is the internet. Sure, it&#8217;s a stripped down internet reduced to a bunch of icons, sometimes called apps, that you can use discretly rather as a proper browser, but hey, when was the last time you watched youtube and vimeo videos on a telly?</p>\n<p>Or used facebook and twitter for that matter?</p>\n<p>There&#8217;s probably some way to hack this, there&#8217;s bound to be support for a real browser deep down in the bowels of this OS &#8230; but I will restrain myself from looking for it. This is the family telly, not one of my computers and is not a playground.</p>\n<p>Oh and perhaps most surprising of all, the UX is <em>good</em>.Up to par with, if not better than, with iOS. No joke. Philips knows what they&#8217;re doing. I was highly surprised!</p>\n<p>Now if only Siol put a UX even remotely as good on their set-top-box I&#8217;m sure everyone would be a happy camper.</p>\n<p>edit: I just discovered that the telly does in fact have a full blown browser</p>\n<div class=\"zemanta-pixie\" style=\"margin-top: 10px; height: 15px;\"><a class=\"zemanta-pixie-a\" title=\"Enhanced by Zemanta\" href=\"http://www.zemanta.com/\"><img class=\"zemanta-pixie-img\" style=\"border: none; float: right;\" src=\"http://img.zemanta.com/zemified_e.png?x-id=f32cc307-9bfd-47c8-acb1-647a6808b08b\" alt=\"Enhanced by Zemanta\" /></a></div>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"3c2d4b1b-be8e-5e09-b8c0-b4b1e2ab85be"}}