{"data":{"wordpressPost":{"title":"Let&#8217;s talk about filter bubbles","content":"<p>There&#39;s been a lot of talk of filter bubbles and echo chambers. <a href=\"http://graphics.wsj.com/blue-feed-red-feed/#/president-trump\">The blue feed this, the red feed that</a>. The media is biased, the facebook ruined information, the twitter is a cesspool, The Result is <em>their fault</em>.</p>\n<p><a href=\"https://techcrunch.com/2016/11/10/facebook-admits-it-must-do-more-to-stop-the-spread-of-misinformation-on-its-platform/\">Facebook must change!</a> Twitter must change! <em>Media</em> must change!</p>\n<p>Here is a truth:</p>\n<p><iframe width=\"580\" height=\"435\" src=\"https://www.youtube.com/embed/5vBGOrI6yBk?feature=oembed\" frameborder=\"0\" allowfullscreen></iframe></p>\n<p>Here is another truth:</p>\n<p><iframe width=\"580\" height=\"435\" src=\"https://www.youtube.com/embed/HFvT_qEZJf8?feature=oembed\" frameborder=\"0\" allowfullscreen></iframe></p>\n<blockquote><p>\nTelevision is not the truth! Television is a God-damned amusement park! Television is a circus, a carnival, a traveling troupe of acrobats, storytellers, dancers, singers, jugglers, side-show freaks, lion tamers, and football players. We&#39;re in the boredom-killing business!\n</p></blockquote>\n<p>Replace television with social media, most of the internet, hell, even traditional newspapers, and you&#39;ll get the situation we find ourselves in.</p>\n<p>All media is the same entertaining shit. Designed to please your ego, validate your beliefs, and never to upset you. Unless, of course, upsetting you boils down to <em>&quot;See how bad your life <strong>could</strong> be but isn&#39;t? Go you!&quot;</em></p>\n<p>This is not a consequence of some vast conspiracy, of The Man suppressing dissent. It&#39;s an emergent result of what <em>you</em> (and I) enjoy. The result of our collective preference, if you will.</p>\n<p>Fundamentally, people want to be entertained, not informed, validated, not challenged.</p>\n<blockquote class=\"twitter-tweet\" data-width=\"550\">\n<p lang=\"en\" dir=\"ltr\">Fundamentally the problem is people want to be <br />entertained, not informed, <br />coddled and validated, not challenged.</p>\n<p>FB/TW is just a symptom.</p>\n<p>&mdash; Swizec (@Swizec) <a href=\"https://twitter.com/Swizec/status/796772354592382976\">November 10, 2016</a></p></blockquote>\n<p><script async src=\"//platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></p>\n<p>Facebook, Twitter, click-based journalism, television, and the media in general, they&#39;re all just symptoms of our collective laziness. They do all they can to keep us engaged and coming back. They don&#39;t care about informing you, and you don&#39;t care about being informed. You think you do, but that&#39;s not what you click on.</p>\n<p>And why would you?</p>\n<p>It&#39;s tiring to always fight for your beliefs. It&#39;s exhausting to defend your viewpoint. It&#39;s frustrating that two people can fundamentally disagree and still both be right.</p>\n<blockquote><p>\nThere are several cognitive biases (among them <a href=\"https://en.wikipedia.org/wiki/Illusory_truth_effect%0A\"> the illusory truth effect</a>, <a href=\"https://en.wikipedia.org/wiki/Confirmation_bias\">confirmation bias</a>, <a href=\"https://en.wikipedia.org/wiki/Bandwagon_effect\">the bandwagon effect</a>, and <a href=\"https://en.wikipedia.org/wiki/Congruence_bias\">congruence bias</a>) that make people engage more strongly with ideas that fit their preconceptions and discount ideas that don’t.\n</p></blockquote>\n<p>This leads to echo chambers. We each become wrapped in our own little bubble where the world agrees with us, we&#39;re always right, and Those Others™ are just too dumb and delusional to know any better.</p>\n<p><em>They</em> think <em>you&#39;re</em> just as dumb and delusional as <em>you</em> think <em>they</em> are.</p>\n<p>So what can you do?</p>\n<p>Seek disagreement. Click links you hate. Like and heart and comment on posts you think are crazy, backwards, and dumb. <em>Train</em> the algorithms to give you everything. Show the journalists that they should cover all angles.</p>\n<p>Yes, this will make your Facebook and Twitter and the rest &quot;worse&quot;. It will make your life harder and the internet less fun. But remember: when two people always agree, one of them is unnecessary.</p>\n<p>Become friends with people you disagree with.</p>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"cac556a1-3184-595d-a5f1-7487bbe6d3ae"}}