{"data":{"wordpressPost":{"title":"Inspired by the 180 websites I will understand 52 academic papers in 52 weeks","content":"<p><em>[This post started the challenge to understand 52 papers in 52 weeks. You can read the entries, <a href=\"http://swizec.com/blog/category/52-papers-in-52-weeks\">here</a> or get notified of new posts by <a href=\"http://swiz.ec/52papers-list\">email</a>]</em></p>\n<div style=\"width: 650px\" class=\"wp-caption alignnone\"><a href=\"http://www.flickr.com/photos/joebeone/755879254/\"><img title=\"Reading academic papers, by joebeone\" alt=\"Reading academic papers, by joebeone\" src=\"https://draftin.com:443/images/2379?token=TruF3uhF7jkHVOCLMbpVK7fLhcQJjbewvRzZwlj8MlU8_-snhy0fCT7XmeskYF1sH0wGAMwTGOunsE5kMC6x0zA\" width=\"640\" height=\"480\" /></a><p class=\"wp-caption-text\">Reading academic papers, by joebeone</p></div>\n<p><a href=\"http://jenniferdewalt.com/\">Jennifer Dewalt</a> recently finished her challenge and created 180 websites in 180 days. Kudos to her!</p>\n<p>This got me thinking, what is that one thing I have always wanted to do, but haven&#8217;t had the right motivation? I already <a href=\"http://swizec.com/blog/a-year-of-750words-com-with-shiny-graphs/swizec/4378\">write</a> and <a href=\"http://swizec.com/blog/30-day-fitness-experiment-with-results/swizec/6326\">exercise</a> every day so that&#8217;s that for the obvious challenges.</p>\n<p>But I don&#8217;t read enough.</p>\n<p>Sure I probably <del>spend</del>waste upwards of two hours a day reading things online, but that&#8217;s like fast food for the brain. Whenever I hit something deeply interesting that will take more than five minutes to read I just close the tab after five paragraphs.</p>\n<p>I&#8217;m a terribly slow reader too. Last time I measured it took me half an hour to read 10 pages of Hemingway. Part of the problem is that I like reading books when I&#8217;m comfortable and then I keep dozing off no matter how much fun I&#8217;m having.</p>\n<p>Books are out of the question then. I read three or four per year, start reading six, buy eight, and that&#8217;s good enough.</p>\n<p>But I&#8217;ve always loved reading academic papers. Those bastions of bleeding edge research, the ten page blogpost of a scientist and their team, written in that loving academic drone of a voice, with all the chest-thumping fancy words so you don&#8217;t even think to doubt the author&#8217;s intelligence.</p>\n<p>In my experience it takes some three to four hours of furrowed eyebrows and meaningful grunts before you understand a serious academic paper enough to explain it. Six if it&#8217;s not from your field. Eight if it&#8217;s biology.</p>\n<p>Biology is hard okay.</p>\n<p>But it&#8217;s effort well spent! I have never walked away from an academic paper without having learned something deeply interesting and insightful.</p>\n<p>The challenge: Read and explain one paper per week for a year. 52 papers, 52 weeks.</p>\n<p>Simple.</p>\n<p>I am going to read papers from all fields. Sometimes this is going to mean extended research to figure out the backstory, other times it will be simple. But I don&#8217;t know where to find all those papers.</p>\n<p>If you have an interesting paper you&#8217;ve been meaning to get to, but just haven&#8217;t found the time. I am your man! Send me an email: <a href=\"mailto:swizec@swizec.com\">swizec@swizec.com</a></p>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"11515820-1189-5f55-a925-5978b12b58d1"}}