{"data":{"wordpressPost":{"title":"I wish my doctor was a vet","content":"<p>Over the weekend my cat got seriously ill. She hasn&#8217;t been eating well for a while, but you know how cats are, they always pull through and with a very hairy kitty you don&#8217;t even notice there&#8217;s any <a class=\"zem_slink\" title=\"Weight loss\" href=\"http://en.wikipedia.org/wiki/Weight_loss\" rel=\"wikipedia\">weight loss</a>.</p>\n<div style=\"width: 377px\" class=\"wp-caption alignright\"><img class=\" \" title=\"My cat\" src=\"http://swizec.com/blog/wp-content/uploads/2011/12/9cc4d6860ef011e1a87612313804ec91_73.jpg\" alt=\"My cat\" width=\"367\" height=\"367\" /><p class=\"wp-caption-text\">My cat</p></div>\n<p>I mean, I&#8217;ve seen her avoid eating for several days simply to extort getting tastier food.</p>\n<p>This time though it was serious &#8211; we took her to a vet. Turns out she nearly died and even now we won&#8217;t know if she&#8217;s going to pull through until Friday (tomorrow).</p>\n<p>But that&#8217;s not what I want to talk about. I want to compare what it&#8217;s like visiting a veterinary with a sick pet and what it&#8217;s like for a sick human to visit a regular doctor.</p>\n<h2>A tale of two doctors</h2>\n<p>The vet was very busy. They had an emergency surgery going on, there was a dog that needed a long procedure done and we ended up waiting for half an hour before the vet could give the kitty a proper examination.</p>\n<p>When we got in, through profuse apologies over our half an hour wait, he immediately started explaining possible reasons for the cat&#8217;s weight loss and explained in detail which tests will be performed. The cat was then sedated, blood was taken and he immediately took it to another room to perform bloodwork.</p>\n<p>Something about checking kidney, liver and pancreas function. While we were waiting he took on some other pets, but kept coming to check back on us every five minutes or so while the bloodwork was being done &#8211; presumably by a machine.</p>\n<p>The whole thing took about twenty minutes and showed a pretty grim picture. There was a fair chance Kitty had aids because her <a class=\"zem_slink\" title=\"Complete blood count\" href=\"http://en.wikipedia.org/wiki/Complete_blood_count\" rel=\"wikipedia\">white cell count</a> was practically zero and it looked like her liver might be completely fried. We were shown graphs and carefully explained what they meant.</p>\n<p>After the aids test came back negative an assistant shaved the cat&#8217;s tummy and the vet performed ultrasound. I got to see my cat&#8217;s innards and even though I couldn&#8217;t really tell what was going on the vet explained it pretty well &#8211; not only giving me an aloof explanation and symptoms, but carefully explained the reasoning behind everything he said.</p>\n<p>Save for picking apart words, I couldn&#8217;t really understand what he was saying, but the fact he explained everything was very reassuring. Made it look like he wasn&#8217;t just pulling things out of his arse.</p>\n<p>Cat has some sort of bacterial infection of the liver and now we have to take her back every day for shots, feed her a carefully selected diet and tomorrow we&#8217;ll know if she&#8217;s making a recovery and will be able to eat her meds as pills.</p>\n<p>Looks good so far, she&#8217;s started eating pretty well. That&#8217;s a good sign I think.</p>\n<p>Oh and the special diet, the medicine we have to give her &#8211; all provided by the vet, he even lent us a kitty box so we can transport her to and fro easier since we&#8217;ve lent ours to my gran. The whole visit was over with in about two hours.</p>\n<p>And the vet spent another five minutes at the end to profusely apologize about the half an hour wait.</p>\n<h3>Compare that to my last brush with healthcare.</h3>\n<p>A few years ago I got really sick. The kind of sick where a proud doctor-disliking 20-something crawls out of his bedroom one day and asks his mother to take him to the doctor.</p>\n<div style=\"width: 377px\" class=\"wp-caption alignleft\"><img class=\" \" title=\"Geeky cat\" src=\"http://swizec.com/blog/wp-content/uploads/2011/12/f2ea2d400a7211e1a87612313804ec91_72.jpg\" alt=\"Geeky cat\" width=\"367\" height=\"367\" /><p class=\"wp-caption-text\">Geeky cat</p></div>\n<p>When we got there it wasn&#8217;t particularly busy, but we were first reprimanded that we dared come when my personal doctor wasn&#8217;t working and are forcing somebody else to work. Imagine that! And we didn&#8217;t even have an appointment or anything, how dare we!?</p>\n<p>I had such a high fever I wasn&#8217;t really processing everything, but the doctor said it looks like I might have something weird so I should probably get some bloodwork done.</p>\n<p>They sent me to a whole other part of the building, where I had to wait in another <a class=\"zem_slink\" title=\"Waiting room\" href=\"http://en.wikipedia.org/wiki/Waiting_room\" rel=\"wikipedia\">waiting room</a> until somebody could draw my blood. While waiting I got really lightheaded and nearly collapsed into the blood letting chair. I think a couple of nurses actually jumped up and caught me so I didn&#8217;t fall to the ground.</p>\n<p>Eventually I made my way back down to the original doctor and waited in the waiting room.</p>\n<p>When it was finally my turn again i was told that I have some sort of viral <a class=\"zem_slink\" title=\"Angina pectoris\" href=\"http://en.wikipedia.org/wiki/Angina_pectoris\" rel=\"wikipedia\">angina</a>, which is odd since angina&#8217;s are usually bacterial infections. But whatever.</p>\n<p>I was told not to leave home for at least a month since one of the symptoms is swelling of internal organs and any physical exertion could rupture my spleen &#8230; I think with a ruptured spleen you bleed out in a couple of minutes?</p>\n<p>Nevertheless, I was given antibiotics, because maybe, just maybe, it wasn&#8217;t a viral angina after all, or it might be both types of angina at once.</p>\n<p>What?</p>\n<p>This meant a trip to the pharmacy before going home as well &#8230;</p>\n<p>The whole thing lasted something like four hours, I visited several different doctors &#8211; luckily in the same general building &#8211; and was eventually told that the simple act of walking around could kill me.</p>\n<h2>Public vs. private?</h2>\n<p>But that&#8217;s <a class=\"zem_slink\" title=\"Public health\" href=\"http://en.wikipedia.org/wiki/Public_health\" rel=\"wikipedia\">public medicine</a> for you.</p>\n<p>This probably isn&#8217;t really a comparison between vets and human doctors, but a comparison between private and public medicine, which really makes me wish I could afford <a class=\"zem_slink\" title=\"Private healthcare\" href=\"http://en.wikipedia.org/wiki/Private_healthcare\" rel=\"wikipedia\">private medicine</a> and that if I do in fact start affording private medicine, that doesn&#8217;t mean I have to keep giving god knows how much money to public medicine.</p>\n<h6 class=\"zemanta-related-title\" style=\"font-size: 1em;\">Related articles</h6>\n<ul class=\"zemanta-article-ul\">\n<li class=\"zemanta-article-ul-li\"><a href=\"http://money.marksandspencer.com/news/2010/09/uninsured-pet-owners-charged-more-by-vets/7310/\">Uninsured pet owners charged more by vets</a> (money.marksandspencer.com)</li>\n<li class=\"zemanta-article-ul-li\"><a href=\"http://lillij.wordpress.com/2011/11/05/i%e2%80%99ve-been-sick%e2%80%a6-but-now-i%e2%80%99m-all-better/\">I&#8217;ve been sick&#8230;. 🙁 But now I&#8217;m all better!</a> (lillij.wordpress.com)</li>\n<li class=\"zemanta-article-ul-li\"><a href=\"http://money.marksandspencer.com/news/2010/07/one-third-of-pets-may-be-overweight,-say-vets/7169/\">One third of pets may be overweight, say vets</a> (money.marksandspencer.com)</li>\n</ul>\n<div class=\"zemanta-pixie\" style=\"margin-top: 10px; height: 15px;\"><a class=\"zemanta-pixie-a\" title=\"Enhanced by Zemanta\" href=\"http://www.zemanta.com/\"><img class=\"zemanta-pixie-img\" style=\"border: none; float: right;\" src=\"http://img.zemanta.com/zemified_e.png?x-id=994bba52-216c-4a62-8e01-b01213c76dae\" alt=\"Enhanced by Zemanta\" /></a></div>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"00cb4d9f-103a-5fa3-b2f1-73640fbe5532"}}