{"data":{"wordpressPost":{"title":"What I learned from Piketty&#8217;s Capital in the 21st Century","content":"<p><center><a href=\"https://amzn.to/2J2wl53\"><img src=\"https://images-na.ssl-images-amazon.com/images/I/41OKpWydb-L._SX321_BO1,204,203,200_.jpg\" /></a></center></p>\n<p><em>Capital in The 21st Century</em> is a great example of how you can take 6 basic points and expand them into a 26 hour book. That&#8217;s right. The audiobook is 26 hours long.</p>\n<p>At 1.5x listening speed, it washed over me during workouts for a month and a half. It will not make you run faster or lift harder, but it will keep your brain engaged and make you go, <em>&#8220;Huh, I never thought of that that way.&#8221;</em></p>\n<p>I wouldn&#8217;t say I was entertained. I was intrigued.</p>\n<p>A lot of what Piketty writes about rings true, validates the word on the street, if you know what I mean. The things people rumble about, the murmurs going through society, stuff everyone young enough complains about, it all gets argumented and substantiated with numbers and historical facts by Piketty.</p>\n<p>His core points are:</p>\n<ol>\n<li>Growth of Western economy is slowing down</li>\n<li>The rest of the world is catching up and will eventually slow</li>\n<li>Growth creates economic mobility</li>\n<li>We&#8217;re sliding back towards a 19th century -like society</li>\n<li>Economic equality is necessary for democratic equality</li>\n<li>A <em>progressive</em> global tax on capital would fix problems</li>\n</ol>\n<p><em>Capital in the 21st Century</em> focuses on the economics of equality and why we do or don&#8217;t have it.</p>\n<p>Piketty argues that society was very inegalitarian in the 19th century and before. At least in Europe. You had <a href=\"https://en.wikipedia.org/wiki/Rentier_capitalism\">rich rentiers</a> who lived on rents coming from their capital (mostly land), and you had the hoi polloi that had to work for a living.</p>\n<p>The two classes rarely mixed. Even if you were a very well off lawyer or doctor, you would not get into the rentier class. There just wasn&#8217;t enough wage growth to ever get there.</p>\n<p>Even if you increased your wages by a lot, you couldn&#8217;t catch up with a rentier because their capital kept growing at capital rates, and they could afford to reinvest most of it.</p>\n<p>So your only option was to inherit or marry well.</p>\n<p>Then revolutions happened (mostly the French one), and certain taxes were introduced, and eventually &#8220;shocks of early 20th century&#8221; (the two wars, the Great Depression) occurred. This reset the playing field and created conditions for the high growth economy we saw in the 20th century.</p>\n<p>We thought we’d defeated the evil rentiers. And it&#8217;s not clear <em>why</em> they&#8217;re evil. For centuries, we were fine with people owning a lot of capital and making a living from allowing others to use that capital.</p>\n<p>Then we decided as a society that this is no good. French Revolution. Later massive taxes. Then in the 80’s, somebody looked at this and said, <em>&#8220;Eh, maybe being rich ain&#8217;t so bad.”</em> Taxes were lowered, conditions were tweaked, and we spiraled into the current situation.</p>\n<p>The issue, according to Piketty, is that the world is no longer trying to catch up to where it would&#8217;ve been without The Shocks. And when an economy isn&#8217;t growing, there is a lack of opportunity for advancement.</p>\n<p>It’s harder to start a business, harder to rise up the ranks of a growing company because companies aren&#8217;t growing, etc.</p>\n<p>The lower the growth, the more important having pre-existing capital becomes. Eventually, capital gains are so much higher than normal economy growth that the 1% is growing in wealth exponentially faster than everyone else.</p>\n<p>What&#8217;s interesting is that the average person in the world, according to Piketty, has about $60,000 of wealth. Assets less outstanding debts.</p>\n<p>But the 1% have billions.</p>\n<p>And we, as a society, have decided that&#8217;s not cool. Right now, there are rumblings. It can eventually lead to revolutions like it did in 18th century France, or even repatriations like it did in 19th century Russia and mid-20th century Eastern Europe.</p>\n<p>The government can taketh, and if they decide they need to, they will. The hoi polloi can rabble rouse and get you into trouble and convince the government that it should taketh.</p>\n<p>Sort of.</p>\n<p>According to Piketty, we can avoid this fate by introducing a global capital tax. At the very least, an inheritance and gifting tax. Some way to limit how far away from the rest of society the richest people can get.</p>\n<h2>The one piece of Actionable Advice™</h2>\n<p>All that economic theory is great. It makes you sound smart in a pub and is curious to think about. But it won&#8217;t help much in your day-to-day life.</p>\n<p>But this piece of advice will 👇</p>\n<p>There are only 2 ways to move into the 1% if you weren&#8217;t born there. You can build a business or  you can become a top executive.</p>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"b8e1bde8-8c8c-54e9-bb95-25de8661fa0b"}}