{"data":{"wordpressPost":{"title":"Who killed Amanda Palmer","content":"<p>\nThis is why I love Amanda Palmer, just pre-ordered her album and got a very elaborate thank you over e-mail. Four pdf&#39;s and a stencil, it totally made my day so here&#39;s the first and most important pdf quoted for you:\n</p>\n<p>\nDear You, Listener &#8211; <br />\nIt&#39;s Amanda. <br />\nThank you, so much, for buying this record. <br />\nIf you are downloading this file, it means that you know how to use a computer. <br />\nIf you know how to use a computer, you could have easily gotten this record for free from <br />\nany of your friends. <br />\nBut instead, you bought it. For that, I am truly grateful. <br />\nWe are living in strange times for the record business. <br />\nRecorded music has been perceived as not worth paying for for a while now, but it still <br />\ncosts money to record music. <br />\nMoreover, a musician must have money to eat, pay rent, buy instruments, do coke off of <br />\nstrippersʼ tits and all of the other things musicians must do to ﬁnd their muse. <br />\nIt&#39;s going to be an interesting few years, these next few, while the business expands and <br />\ncontracts and musicians experiment with new ways to actually make money off of their <br />\nrecorded music while more and more people buy computers and ﬁgure out that to PAY for <br />\nmusic in a STORE is becoming rather ridiculous and redundant. <br />\nMY dream about the future is that the artist/listener relationship will trump everything else, <br />\nand that true fans and appreciators of artists will actively WANT to support them, will <br />\nWANT to give them money, perhaps in a slightly different conﬁguration than we&#39;re used to. <br />\nI&#39;m trying to ﬁgure out creative ways to do that. Time was, famous painters and musicians <br />\nhad rich patrons and royalty who fed them and kept them kicking around because ART <br />\nMADE LIFE BETTER AND MORE INTERESTING. Nowadays, with the power of the net, a <br />\nmish-mashy assortment of people spanning the globe can be that patron, if it&#39;s wisely <br />\norganized. Those people would be, ahem, YOU. <br />\nFor now, there are two simple, and very powerful, things you can do to help me <br />\nout&#8230;.above and beyond buying this record, above and beyond buying merchandise and <br />\nconcert tickets and books and all the other things I will try to entice you to buy: Stay in <br />\ntouch with me (make sure you&#39;re on the MySpace or mailing list &#8211; if you&#39;re not, please, <br />\nplease subscribe) and spread the word. Your recommendation about this record to a friend <br />\nmeans WAY more than any fancy marketing me or my label can do. <br />\nIf you love it, share it. Really. Do. <br />\nLong live the punk cabaret, comrades. <br />\nXXXOOO <br />\namanda palmer <br />\nP.S. As a token of appreciation, please enjoy some previews of photos and a story from <br />\nWho Killed Amanda Palmer (the BOOK)&#8230;</p>\n<p>I mean &#8230; how often is it that people actually thank you for buying their stuff these days?</p>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"d9a118a5-d272-55fe-9ad6-bd6160e6f566"}}