{"data":{"wordpressPost":{"title":"What I learned from Sherry Walling&#8217;s Keeping Your Sh*t Together","content":"<a href=\"https://amzn.to/2Jm2Z1H\"><img src=\"https://pbs.twimg.com/media/DXQvIqGVoAIEKDw.jpg\" /></a>\n<p>I started reading Sherry Walling&#8217;s <em>The Entrepreneur’s Guide to Keeping Your Sh*t Together</em> more than a month ago. It&#8217;s a 164 page book. I finished a week and a half ago and haven&#8217;t found time to condense my thoughts until now.</p>\n<p>Talk about needing to keep my shit together 😅</p>\n<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"und\" dir=\"ltr\"><a href=\"https://t.co/dRXxfC5Su9\">pic.twitter.com/dRXxfC5Su9</a></p>\n<p>&mdash; Swizec (@Swizec) <a href=\"https://twitter.com/Swizec/status/969451663684657152?ref_src=twsrc%5Etfw\">March 2, 2018</a></p></blockquote>\n<p><script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></p>\n<p>Sherry Walling&#8217;s book is great. You should read it.</p>\n<p>A little light on practical advice, heavy on understanding <em>why</em> you feel overwhelmed. The writing is light enough to read with half a brain thinking about the pressures that are making you feel overwhelmed.</p>\n<p>Perfect targeting 👌</p>\n<p>Keeping Your Sh*t Together is one of those books that you should Just Read™. It&#8217;s hard to condense into a few bullet points of practical advice. You read it and its lessons sit somewhere deep in your subconscious. When you face a situation or recognize a pattern, your mind says <em>&#8220;Ah! I&#8217;ve read about that before! I wonder where?&#8221;</em></p>\n<h2>The Important Learnings</h2>\n<p>Walling talks about different founders having different modes of working and how that contributes to their stress and overwhelmedness. When they are stressed, some people tend towards chaos. They say fuck it and throw caution to the wind. Others say, “Ok, shit. I need to get organized,” and become too rigid.</p>\n<p>So you have to look into yourself and see what&#8217;s up. If you&#8217;re too unstructured, adding some structure to your life will help. If you&#8217;re too structured, letting go will help because you can&#8217;t control everything.</p>\n<p>And you should have a growth mindset always.</p>\n<p>She says that vacations also help and are important. You are human, and you should keep yourself human. Sometimes, if everything is falling to shit around you, the best thing to do is to take a step back and go on vacation. The steaming pile of dung will still be there when you get back, but you&#8217;ll have a fresh perspective.</p>\n<p>And maybe you should try yoga. It relaxes and creates space.</p>\n<p>If you feel like there isn&#8217;t enough time in the day to get everything done, time is rarely the problem. You&#8217;re probably suffering from a mindshare issue. Something weighing on your mind? That&#8217;s gonna seep into all other tasks and make them slow. No good.</p>\n<p>Manage your <em>energy</em>, not your time.</p>\n<p>And avoid chronic stress. Acute stress makes you crazy productive and focused. Like an imminent hard deadline. Chronic stress makes you dead. Literally, it can take decades off your life span.</p>\n<p>So take a break.</p>\n<p>Oh, and your company can&#8217;t love you back. You feel towards your company like you would towards your baby. MRI scans show evidence of this. Same regions of the brain light up when you think about your baby or about your business.</p>\n<p>But a baby can love you back. A business cannot.</p>\n<p>And avoid burnout. You burn out when you have little social support, feel like your goals are meaningless, and have chronic stress.</p>\n<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">Chronic stress without social support, without meaningful goals and little control over how you work</p>\n<p>👇</p>\n<p>Burnout <a href=\"https://t.co/hl5httwKIb\">pic.twitter.com/hl5httwKIb</a></p>\n<p>&mdash; Swizec (@Swizec) <a href=\"https://twitter.com/Swizec/status/976667477080813569?ref_src=twsrc%5Etfw\">March 22, 2018</a></p></blockquote>\n<p><script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></p>\n<p>Once you burn out for real, it can take years to come back.</p>\n<p>5/7 book. Recommending Sherry Walling&#8217;s <em>Entrepreneur&#8217;s Guide to Keeping your Sh*t Together</em> to everyone I know who&#8217;s feeling whelmed.</p>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"695db475-f9a7-5d9c-b58c-f27b86dc3ae6"}}