{"data":{"wordpressPost":{"title":"Twitter solves massive bug","content":"<p>Today I resolved a bug lurking deep within the workings of my <a href=\"http://chlorineboards.swizec.com/\" target=\"_blank\">Chlorine Boards framework</a> and I have <a href=\"http://twitter.com\" target=\"_blank\">twitter</a> to thank. When I made a blogpost about how <a href=\"http://swizec.com/blog/drug-use-is-not-abuse/2/374\">drug use is not abuse</a> a person following me on twitter immediatelly picked up on the post, gave it a read, retweeted and wanted to leave a comment. But couldn&#8217;t. Immediately <a href=\"http://twitter.com/OneLuvGurl\" target=\"_blank\">@OneLuvGurl</a> tweeted to me about how she can&#8217;t comment.</p>\n<p>We tweeted back and forth for about an hour about the issue when I finally just asked her to send me the comment and I&#8217;ll see what I can do. It turned out that it was indeed, as I feared, the comment&#8217;s fault. So I started poking around until I found what was wrong. The comment was too long &#8230; but how can this be? The darn thing isn&#8217;t very long at all.</p>\n<p>Two hours later I finally found out what the issue was and was able to resolve it. It would appear that three, or was it four, years ago I&#8217;ve made a terrible design flaw &#8211; I decided to use GET requests for ajax instead of POST requests. Since GET requests have a limited length this was naturally a disaster waiting to happen and I&#8217;m surprised the issue could go so long without being noticed, but I&#8217;m glad it&#8217;s resolved and I&#8217;ve already updated all the websites running on Chlorine Boards with the surprisingly simple fix.</p>\n<p>This event just goes to show how much more than just status updates <a href=\"http://twitter.com\" target=\"_blank\">Twitter</a> has become and just how awful bugs can be.</p>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"ca4d21b1-0c99-588d-b0b6-32e8c7767941"}}