{"data":{"wordpressPost":{"title":"Why everything must change every five years","content":"<img class=\"alignnone size-full wp-image-8211\" src=\"https://swizec.com/blog/wp-content/uploads/2018/02/change.jpg\" width=\"1024\" height=\"923\" srcset=\"https://swizec.com/blog/wp-content/uploads/2018/02/change.jpg 1024w, https://swizec.com/blog/wp-content/uploads/2018/02/change-300x270.jpg 300w, https://swizec.com/blog/wp-content/uploads/2018/02/change-768x692.jpg 768w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" />\n<p>You complain about <a href=\"https://www.google.com/search?q=javascript+fatigue&amp;oq=javascript+fatigue&amp;aqs=chrome..69i57j0l3.2712j0j1&amp;sourceid=chrome&amp;ie=UTF-8\">JavaScript fatigue</a>, and that&#8217;s valid. The ecosystem moves fast, and it&#8217;s hard to keep up. Dare I say impossible?</p>\n<p>But won&#8217;t you think of the authors and the conferences and the speakers and the trainers and video course makers and everyone else working hard to teach you all the new things?</p>\n<p>A whole industry relies on new things coming out to confuse you!</p>\n<p>Why, if you&#8217;re not confused about that new feature, who will come to our talks? Who are we going to teach?</p>\n<p>If a new framework doesn&#8217;t come out to boil the ocean and replace everything that existed before it, who is going to buy the hundreds of books and video courses that we want to make?</p>\n<p>You can&#8217;t make more sales if there&#8217;s nothing new to sell. If you can&#8217;t make more sales, how are you gonna pay rent? Hosting fees? Vacations in Bali?</p>\n<p>Sure –– hundreds, even thousands of people enter the field every day. People change jobs and become software engineers. People go from one type of engineering to another. People grow up and get their first jobs.</p>\n<p>The field is growing, and that&#8217;s a good thing. You can sell your conferences and your books and your courses to the newcomers.</p>\n<p>But wouldn&#8217;t it be nice if you could also sell them to everybody else? There&#8217;s a lot more of everybody else.</p>\n<p><a href=\"https://www.bls.gov/ooh/computer-and-information-technology/software-developers.htm\">Software Engineering is growing at about 24% per decade</a>. You can&#8217;t build a training industry on that. Not a big one anyway.</p>\n<img src=\"https://media.giphy.com/media/cEYFeDKVPTmRgIG9fmo/giphy.gif\" />\n<p>There&#8217;s a whole other 76%! You can sell stuff to them.</p>\n<p>But you first need to get them confused.</p>\n<p>Invent a new frontend framework. Say that tables are bad and CSS rules all. 10 years later, turn CSS into tables. Double whammy!</p>\n<p>Create new bundlers and compilers and tell everyone that JavaScript must be compiled – it&#8217;s really much better that way. Invent a whole new way to talk to backends because REST and Ajax are lame.</p>\n<p>Don&#8217;t tell anyone that all these things are pretty much the same as always behind the scenes. You still need Ajax to talk to the backend, everything still turns into HTML in the end, and CSS still winds up a bunch of <code>&lt;style&gt;</code> tags no matter what bundler you use. 🤫</p>\n<p>It&#8217;s the oldest play in the book. Invent something new, convince everyone it&#8217;s better, watch a cottage industry spring up around it. Training, consulting, all the things.</p>\n<p>But really, we&#8217;re all at the mercy of this. Sometimes, I think the big companies just have too many engineers with nothing to do so they keep coming up with new things.</p>\n<p>¯&#92;_(ツ)_/¯</p>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"dd3628af-73a2-5a36-ae84-69fb2490945e"}}