{"data":{"wordpressPost":{"title":"It&#8217;s Just Like Knitting","content":"<p>Knitting is good for you. If you’re young, it relaxes you, relieves your stress, and gives you a creative outlet. If you’re old, it also reduces your cognitive impairment.</p>\n<p><a href=\"http://well.blogs.nytimes.com/2016/01/25/the-health-benefits-of-knitting/\">There’s a whole New York Times article about it</a></p>\n<p>When I was 6 or 7, I made half a scarf. I think I decided that it was too hard and too boring and that you can always ask your mum to make a scarf for you.</p>\n<p>I’m 28 now, and relaxation and stress relief are always welcome. Avoiding cognitive impairment is a big plus, too. But I still think knitting is kind of pointless when artisanal free range scarfs are cheaper than a nice dinner.</p>\n<p>So I bought a lock picking set and some clear locks instead. It’s kinda like knitting, right?</p>\n<blockquote class=\"imgur-embed-pub\" lang=\"en\" data-id=\"a/v79Kw\"><p><a href=\"//imgur.com/v79Kw\">New hobby!</a></p></blockquote>\n<p><script src=\"//s.imgur.com/min/embed.js\" async=\"\" charset=\"utf-8\"></script></p>\n<p>The basic tumbler lock was quick to figure out:</p>\n<ol>\n<li>Apply pressure with torsion wrench</li>\n<li>Take any small-enough pick</li>\n<li>Fiddle around</li>\n<li>Lock pops open</li>\n</ol>\n<p>After just a few hours of practice, I can open that one particular lock in about 10 seconds. It&#8217;s super disconcerting now that I think about it …</p>\n<p>The other two locks that I’ve got are proving much harder. I’m almost certain the approach should work: apply gentle pressure, fiddle with pins, lock opens.</p>\n<p>One of them has this weird configuration where the pins are perpendicular to the key plane. This makes all of my lock picks too big to effectively fiddle around. Either they don’t fit inside at all, or they can’t reach deep enough to fiddle the last pin or two.</p>\n<img class=\"alignnone size-full wp-image-6972\" src=\"http://swizec.com/blog/wp-content/uploads/2016/08/sideways-pins.gif\" alt=\"sideways-pins\" />\n<p>The third lock … holy shit, where do I even begin? There are no pins, only notches. Or notch-like things. I don’t know what they’re called.</p>\n<p>When you insert the key, nothing moves. Then the first half-twist moves some pin-notch-things, and another half-twist moves the other pin-notch-things. This dislodges two metal balls, which in turn allows you to open the lock.</p>\n<p>The whole lock is super elegant. No springs, no fuss, just a really damn hard lock to pick. I’m sure you could Google for it, but what do you even Google for?</p>\n<p>All I need now is an endless supply of random locks. Then I, too, can be like Sherlock Holmes.</p>\n<figure><img src=\"http://static2.hypable.com/wp-content/uploads/2015/03/Elementary-season-3-Sherlock-locks.jpg\" alt=\"\" /></figure>\n<p>And yes, it <em>is</em> relaxing. Especially the part where I can’t unlock the front door to our apartment.</p>\n<p>Yet ?</p>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"c28c9200-7ebf-5359-9007-689113e342ef"}}