{"data":{"wordpressPost":{"title":"Some tricks I learned recording &#038; publishing an educational video every day for 30 days","content":"<img class=\"alignnone size-full wp-image-8404\" src=\"https://swizec.com/blog/wp-content/uploads/2018/05/F5F63D9C-009C-4F68-A4F5-EFF20A28E0E9.png\" width=\"1280\" height=\"720\" srcset=\"https://swizec.com/blog/wp-content/uploads/2018/05/F5F63D9C-009C-4F68-A4F5-EFF20A28E0E9.png 1280w, https://swizec.com/blog/wp-content/uploads/2018/05/F5F63D9C-009C-4F68-A4F5-EFF20A28E0E9-300x169.png 300w, https://swizec.com/blog/wp-content/uploads/2018/05/F5F63D9C-009C-4F68-A4F5-EFF20A28E0E9-768x432.png 768w, https://swizec.com/blog/wp-content/uploads/2018/05/F5F63D9C-009C-4F68-A4F5-EFF20A28E0E9-1024x576.png 1024w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" />\n<p>From April 5th to May 9th, I published <a href=\"https://www.youtube.com/playlist?list=PLF8WgaD4xmjWuh7FTYTealxehOuNor_2S\">30 videos about React</a> on the internets. All of the internets. <a href=\"https://twitter.com/Swizec/status/981932124231024640\">Twitter</a>, <a href=\"https://www.facebook.com/swizecpage/\">Facebook</a>, <a href=\"https://www.youtube.com/playlist?list=PLF8WgaD4xmjWuh7FTYTealxehOuNor_2S\">YouTube</a>, <a href=\"https://learnwhileyoupoop.com/\">learnwhileyoupoop.com</a>. Each video up to 2 minutes 20 seconds long, each part of my initial <a href=\"https://learnwhileyoupoop.com\">Learn While You Poop</a> series, each starting in my bathroom, some with drawings on mirrors, others with computer screencasts.</p>\n<p>Goal was to publish 30 instructional videos in 30 days and test the hypothesis that a quick lightweight approach to teaching new technical skills exists. It went great 😎</p>\n<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">Not sure, if it’s just me but past few weeks this has been the first link I’ve shared, when somebody asks for programming related learning material. </p>\n<p>It might be just me…</p>\n<p>💩</p>\n<p>🤣 ➡️ 🚪</p>\n<p>&mdash; Tuomas Jomppanen (@tuomasj) <a href=\"https://twitter.com/tuomasj/status/998526109317828608?ref_src=twsrc%5Etfw\">May 21, 2018</a></p></blockquote>\n<p><script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></p>\n<p>Altho… the full playlist is just 29 videos. Did I lose count? 🤔</p>\n<p>And there&#8217;s 34 days between Apr 5th and May 9th because staying on the wagon is hard but not too hard, heh 😇</p>\n<p>6560 views on YouTube</p>\n<p>12019 views on Twitter</p>\n<p>5729 views on Facebook (+ 56k paid but meh)</p>\n<p>Overall, great success! 💪</p>\n<p>As I prep to start the next 30-day module, here are some things I&#8217;ll have to keep in mind 👇</p>\n<h3>1. Keep your head still</h3>\n<p>George Clooney in an interview with David Letterman once said the director of ER told him: <em>&#8220;Man, you could be a great actor one day if only you learn to keep your head still!&#8221;</em></p>\n<p>I don&#8217;t know about that director, but I find the less I move my head, the easier it is to fix problems in my line delivery with editing tricks. Missed a word? Started rambling? Cut it out when editing.</p>\n<p>If your head doesn&#8217;t move, the viewer won&#8217;t even notice the cut.</p>\n<h3>2. Eye contact with the camera</h3>\n<p>Make eye contact with the camera. You are talking to the person who is watching, and your eyes are captivating. The better you keep focus on the camera, the better they&#8217;ll keep focus on the video.</p>\n<p>Avoid darting your eyes to the screen to check if your shot is good. Your shot is okay and the camera is on. Look deep into the lens.</p>\n<h3>3. Keep your volume stable</h3>\n<p>When you forget a word, you tend to draaaaag out the previous word then say the next word super loud when you remember it.</p>\n<p>You gooooooo INTO THe woods.</p>\n<p>This is hard to edit and annoying to listen to. Keep your volume stable and you can cut out any awkward pauses. Cover up a lot. The viewer won&#8217;t even notice.</p>\n<h3>4. Don&#8217;t draaaaaag out words when you forget a line</h3>\n<p>Even better than keeping your volume stable is to avoid dragging out words when you forget a line. You don&#8217;t have to keep making noise.</p>\n<p>Forgot your line? Shut up.</p>\n<p>Silence is easy to cut out. Especially if you keep your head still.</p>\n<h3>5. Forgot a line, try again</h3>\n<p>If you forget a line, just try again. Do not stop the camera. Do not reset the shot. Just shut up for a second or two, then try again.</p>\n<p>You can cut out the false starts. You will save a lot of time, if you just keep going and repeat the same stuff multiple times.</p>\n<p>Especially if you keep your head still.</p>\n<h3>6. Change your shot</h3>\n<p>Watching still video is boring and your audience will drift away. Try to change the shot every 20 to 30 seconds.</p>\n<p>The reason you can&#8217;t keep your eyes of the TV is that you&#8217;re both predator and prey. Your brain is hardwired to motion interrupts.</p>\n<p>If you see motion out of the corner of your eye, you look. You then give it your attention for a bit, then return to whatever.</p>\n<p>Still shots don&#8217;t hold your attention. Shots changing too often overwhelm you and don&#8217;t hold your attention.</p>\n<p>Shots changing just often enough make it impossible for you to look away because whenever your attention is about to wander, your subconscious motion detector gets pinged again.</p>\n<p>This is why screencasts and college lectures are so hard to watch while a TV running in the room steals everyone&#8217;s attention.</p>\n<h3>7. Build a buffer</h3>\n<p>Staying on the wagon is hard. Making video every day is hard.</p>\n<p>Sure, it takes just 1 hour to make a 2-minute video when things go well. But shit happens.</p>\n<p>Bug in your code? Oops, video took 3 hours, and you&#8217;re not getting sleep tonight.</p>\n<p>Bug in your gear? Aaaargh.</p>\n<p>Girlfriend wants to have a nice dinner and spend some time with you? Shit, no video tonight, I guess.</p>\n<h3>8. Mornings are not quiet</h3>\n<p>Morning time is quiet time. You are left alone and you can write a lot. It&#8217;s great.</p>\n<p>But video requires actual silence. Your microphone picks up all the noise that comes from the street and from your girlfriend in the bathroom and from your bird waking up and…</p>\n<p>Basically, you have to record at night. Or in a special room that you don&#8217;t have.</p>\n<h3>9. Timebox</h3>\n<p>Your video is never going to be perfect. Your taste is better than your skill. Your time is more limited than you think.</p>\n<p>If you want to publish every day, you often have to say <em>&#8220;Fuck it, this is good enough&#8221;</em> and press the magic button.</p>\n<p>That&#8217;s okay. Not everything has to be a hit.</p>\n<p>Some videos will get more views some will get less. They all contribute to getting in front of people and building your audience. Keep pressing publish.</p>\n<p><a href=\"https://zenpencils.com/comic/90-ira-glass-advice-for-beginners/\">Your skills will catch up to your taste.</a></p>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"55536a52-0e4b-5777-aa3d-9ce0572f4d4a"}}