{"data":{"wordpressPost":{"title":"I learned two things today 12.8.","content":"<div style=\"width: 310px\" class=\"wp-caption alignright\"><a href=\"http://swizec.com/blog/wp-content/uploads/2011/08/20110813-084033.jpg\"><img src=\"http://swizec.com/blog/wp-content/uploads/2011/08/20110813-084033.jpg\" alt=\"20110813-084033.jpg\" class=\"alignnone size-full\" /></a><p class=\"wp-caption-text\">Blowing air up a computer</p></div>\n<p>Today I learned that replacing a keyboard on a Unibody MacBookPro is a very expensive affair. Spilled some water on it last night and even though everything was working the right shift key was stuck and I eventually locked myself out of the computer completely because I couldn&#8217;t type the password.</p>\n<p>Took the computer apart but wasn&#8217;t able to get to the last dropplets of water. Taking a laptop in such condition to the Apple Store turns out to be a pretty fruitless idea as well. Was told my best and only bet was just to replace the whole thing with a new one. Going to the mac repair shop was a bit better. They only wanted 550 dollars to replace the whole upper part of the laptop. I couldn&#8217;t just buy a new keyboard either because the holes don&#8217;t fit the US keyboard layout &#8230; enter key is different.</p>\n<p>On the other hand I discovered a wonderful new method of writing today. Bought a wireless apple keyboard that can attach to either my laptop, iPad or iPhone. Connecting it to the smallest possible device is both fun and &#8230; well kind of weird. But having an iPhone in my pocket and typing without seeing what I&#8217;m doing is really brilliant for creative writing. In fact I&#8217;m writing this very post by having the iPad in a completely different place that I can&#8217;t even see and when it&#8217;s done I&#8217;ll just edit. </p>\n<p>This really quiets the inner editor so I can write in peace 🙂 And I can totally write pretty much wherever now, there is no cumbersome laptop or anything ^^</p>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"4671e4fd-9ea4-5d3b-9d34-2ff269036538"}}