{"data":{"wordpressPost":{"title":"Doing a startup taught me the value of staying in school","content":"<div class=\"zemanta-img\" style=\"margin: 1em; display: block;\">\n<div style=\"width: 250px\" class=\"wp-caption alignright\"><a href=\"http://www.flickr.com/photos/36683613@N08/5785335346/\"><img title=\"Frankfurt: Reflection of giants\" src=\"http://swizec.com/blog/wp-content/uploads/2011/06/5785335346_32457a62b2_m47.jpg\" alt=\"Frankfurt: Reflection of giants\" width=\"240\" height=\"240\" /></a><p class=\"wp-caption-text\">Image by Bas Lammers via Flickr</p></div>\n</div>\n<p>This post has been brewing for the past few months. I decided to finally write it to psyche myself up for the onslaught of the exam season starting next week.</p>\n<p>A little background; a few months ago I crashed and burned doing a big swing for the fences, a startup I had been working on practically full-time for a year and a half that evolved from a project I had been working on for a year before even that. We did the whole thing, tried to get funding, went to a Mini <a class=\"zem_slink\" title=\"Seedcamp\" rel=\"homepage\" href=\"http://www.seedcamp.com\">Seedcamp</a>, got to the interview stages of <a class=\"zem_slink\" title=\"Seedcamp Week\" rel=\"homepage\" href=\"http://www.seedcamp.com/pages/weeks_program\">Seedcamp Week</a>, we even applied to <a class=\"zem_slink\" title=\"Y Combinator\" rel=\"homepage\" href=\"http://www.ycombinator.com\">YCombinator</a> and got some one-on-one meetings with actual VC&#8217;s. You could say it was going pretty well until it stopped going at all well and the co-founder and I split up, or I was kicked out depending on how you look at it &#8230; truth be told I was getting pretty bummed out about everything anyway.</p>\n<p><em style=\"font-size: 1.3em;\">tl;dr -&gt; Confronting the vast vastness of everything you don&#8217;t know and can never hope to understand will leave you a better man (or woman).</em></p>\n<p>But the crash and split up isn&#8217;t what I want to talk about today, that story still isn&#8217;t something I&#8217;m quite ready to put into writing. Perhaps I&#8217;ll be &#8220;over it&#8221; when I financially recuperate &#8230; anyway &#8230;</p>\n<p>What I came online to say today is that through all of it, the thick and the thin, the ups and the downs, I <em><strong>never dropped out of uni.</strong></em> The thought crossed my mind, it crossed my mind a <em><strong>lot</strong></em>.</p>\n<p><!--more--></p>\n<p>But I didn&#8217;t do it. I think that was the best decision I have ever made.</p>\n<p>You see, when I started working on <a class=\"zem_slink\" title=\"Twitulater\" rel=\"homepage\" href=\"http://twitulater.com/\">Twitulater</a>, the project eventually leading to Preona and LazyReadr &#8230; I was a brat. A total and utter brat. I was the sort of person who was too cool for school, too cool for advice, too cool for everything, I was king of the world and I <em>knew</em> I could do anything and was better than everyone. Simply because I had put up a couple of websites.</p>\n<p>Oh yes, I knew it all and I was best of the best. Fuck professors and fuck anyone trying to tell <em>me</em> how to code something. I know better. Didn&#8217;t you hear? I&#8217;ve got two pretty cool websites under my belt and I totally did them under conditions of utter cushiness and at no risk on my part at all. They weren&#8217;t even my websites per se, I was just paid to make them.</p>\n<div class=\"zemanta-img zemanta-action-dragged\" style=\"margin: 1em; display: block;\">\n<div style=\"width: 250px\" class=\"wp-caption alignright\"><a href=\"http://www.flickr.com/photos/30934989@N06/3242353102\"><img title=\"The Process\" src=\"http://swizec.com/blog/wp-content/uploads/2011/06/3242353102_d77481609e_m5.jpg\" alt=\"The Process\" width=\"240\" height=\"180\" /></a><p class=\"wp-caption-text\">Image by neil conway via Flickr</p></div>\n</div>\n<p>Back then I <strong>knew</strong> there was nothing a <a class=\"zem_slink\" title=\"Higher education\" rel=\"wikipedia\" href=\"http://en.wikipedia.org/wiki/Higher_education\">university education</a> could provide for me. What does such an arcane institution know about how the real modern world works anyway? There&#8217;s nothing they can teach me. Somehow, through sheer dumb luck, I didn&#8217;t drop out. Probably because I was kind of intrigued by what the higher classes might bring, but mostly because life as a student is simply cheaper and cushier for various reasons.</p>\n<p>I don&#8217;t think I&#8217;m that person anymore.</p>\n<p>Those 17 months of being a startup were the single most transformative experience of my life. Something about being on the line for everything and anything, trying to act the role of both CEO and CTO (however badly), being allowed to play in the Smart Kids &#8482; sandbox &#8230; it fundamentally changed me.</p>\n<p>What I&#8217;ve come to realize is that there is just this fundamental difference in thinking that exists between people who have done the whole university schtick and those that dropped out. Obviously there are exceptions, but I think that there is something much more that a university education provides, far beyond any interesting facts and theories you can learn on wikipedia any day of the week.</p>\n<p>It gives you better frameworks for thinking.</p>\n<p>It teaches you to better question everything, not to question for the sake of questioning, but for the sake of proving to yourself and others that what you&#8217;re doing, that what somebody else is doing, is really the way it should be done. It also gives you a much wider berth of existing theories and hypotheses that you can use to create new knowledge from.</p>\n<div class=\"zemanta-img zemanta-action-dragged\" style=\"margin: 1em; display: block;\">\n<div style=\"width: 310px\" class=\"wp-caption alignleft\"><a href=\"http://commons.wikipedia.org/wiki/File:Nail_in_a_block_of_wood.jpg\"><img title=\"A nail sticking out from a block of wood.\" src=\"http://swizec.com/blog/wp-content/uploads/2011/06/300px-Nail_in_a_block_of_wood8.jpg\" alt=\"A nail sticking out from a block of wood.\" width=\"300\" height=\"200\" /></a><p class=\"wp-caption-text\">Image via Wikipedia</p></div>\n</div>\n<p>As a very smart man once said &#8220;When all you have is a hammer, everything looks like a nail&#8221;.</p>\n<p>While this may be true even after spending several years at uni, when all you have is a hammer, everything still looks like  a nail, but suddenly you start questioning whether what you have in your hand is really <strong><em>just</em></strong> a hammer and whether that nail might be more than a nail. And besides, there&#8217;s this hacksaw in your backpack now, maybe you don&#8217;t need the nail and hammer after all and what you really want is to make two planks from one?</p>\n<p>This reformed way of thinking that can only come from learning strikingly opposite theories and explanations of the same phenomena (something high schools simply don&#8217;t seem to do), also has a profound effect on your inner douchebag. Suddenly you aren&#8217;t the smartest in the world anymore, your horizons are expanded and you can accept the fact that there are many explanations for the same thing that can make sense and be perfectly valid.</p>\n<p>Being around smart people, confronted with the vast vastness of everything you don&#8217;t know and can never hope to understand is simply humbling and I fully believe it will leave you a better man (or woman).</p>\n<p>PS: I think a big part of the startup+school combo that made it work so well is that I had a hard enough job so I could instantly apply the stuff I was learning at school instead of learning all these awesome &#8220;useless&#8221; things at class and then spending my days setting up a better web form.</p>\n<h6 class=\"zemanta-related-title\" style=\"font-size: 1em;\">Related articles</h6>\n<ul class=\"zemanta-article-ul\">\n<li class=\"zemanta-article-ul-li\"><a href=\"http://screditcrunch.com/2011/04/26/we-never-give-up/\">We Never Give Up (we were accepted to Seedcamp!)</a> (screditcrunch.com)</li>\n<li class=\"zemanta-article-ul-li\"><a href=\"http://blog.seedcamp.com/2011/05/going-east-again-seedcamp-ljubljana_25.html\">Going East again &#8211; Seedcamp Ljubljana</a> (seedcamp.com)</li>\n<li class=\"zemanta-article-ul-li\"><a href=\"http://eu.techcrunch.com/2011/05/23/crunching-some-data-after-3-5-years-of-seedcamp/\">Crunching some data after 3.5 years of Seedcamp</a> (eu.techcrunch.com)</li>\n</ul>\n<div class=\"zemanta-pixie\" style=\"margin-top: 10px; height: 15px;\"><a class=\"zemanta-pixie-a\" title=\"Enhanced by Zemanta\" href=\"http://www.zemanta.com/\"><img class=\"zemanta-pixie-img\" style=\"border: none; float: right;\" src=\"http://img.zemanta.com/zemified_e.png?x-id=4039ac37-92e2-408d-a892-9374fdc2ac87\" alt=\"Enhanced by Zemanta\" /></a></div>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"4980a111-1649-5e20-a4e9-415fc7f704a1"}}