{"data":{"wordpressPost":{"title":"If the first page of The Martian was written in different type systems","content":"<p>Or: How Types Influence Readability.</p>\n<h2>Traditional static typed</h2>\n<p><em>Where the compiler knows nothing you don&#39;t tell the compiler.</em></p>\n<p><code>KNOWLEDGEREPOSITORY</code> LOG <code>ELEMENT</code> ENTRY: <code>DATE</code> SOL 6</p>\n<p><code>Human</code> I&#39;m <code>Opinion</code> pretty much fucked.</p>\n<p><code>Opinion</code> That&#39;s my considered opinion.</p>\n<p><code>Opinion</code> Fucked.</p>\n<p><code>Timespan</code> Six days into <code>Opinion</code> what should be the <code>Opinion</code> greatest <code>Timespan</code> month of <code>Timespan</code> my life, and what should be the greatest month of my life <code>TypeConversion</code> turned into a <code>Opinion</code> nightmare.</p>\n<p>I <code>Opinion</code> don&#39;t even know <code>ManyHumans</code> who&#39;ll <code>Activity</code> read LOG. I <code>Activity</code> guess <code>ManyHumans</code> someone will <code>Activity</code> find LOG <code>Timespan</code> eventually. <code>Opinion</code> Maybe a <code>Timespan</code> hundred years from now.</p>\n<p><code>RhetoricDevice</code> For the record… I <code>Activity</code> didn&#39;t die on <code>Date</code> Sol 6. <code>Opinion</code> Certainly <code>ManyHumans</code> the rest of the crew <code>Opinion</code> thought I did, and I can&#39;t <code>Activity</code> blame the rest of the crew. Maybe there&#39;ll be <code>Timespan</code> a day of <code>Activity</code> national mourning for <code>Human</code> me, and <code>KnowledgeRepository</code> my Wikipedia page will say, <code>Quote</code> &quot;Mark Watney is the only human being to have died on Mars.&quot;</p>\n<h2>Untyped</h2>\n<p><em>Where the compiler knows nothing and you&#39;re pretty sure it&#39;s impossible to explain how your code works to a machine.</em></p>\n<p>THING: SOL 6</p>\n<p>Individual pretty much fucked.</p>\n<p>That&#39;s something.</p>\n<p>Fucked.</p>\n<p>Six days into experience, and experience&#39;s turned into a thing.</p>\n<p>Individual don&#39;t even know stuff. Individual guess someone will a discovery. Maybe in future.</p>\n<p>For the record… person didn&#39;t something on Sol 6. Certainly other people thought person did, and individual can&#39;t blame people. Maybe there&#39;ll be future something for me, and my thing will say, &quot;Mark Watney is the only human being to have died on Mars.&quot;</p>\n<h2>Local type inference</h2>\n<p><em>Where the compiler can often guess what you mean.</em></p>\n<p><code>KNOWLEDGEREPOSITORY</code> LOG <code>ELEMENT</code> ENTRY: <code>DATE</code> SOL 6</p>\n<p><code>Human</code> I&#39;m <code>Opinion</code> pretty much fucked.</p>\n<p>That&#39;s my considered opinion.</p>\n<p>Fucked.</p>\n<p><code>Timespan</code> Six days into <code>Opinion</code> what should be the <code>Opinion</code> greatest <code>Timespan</code> month of my life, and it&#39;s turned into a <code>Opinion</code> nightmare.</p>\n<p>I <code>Opinion</code> don&#39;t even know <code>ManyHumans</code> who&#39;ll <code>Activity</code> read LOG. I guess someone will <code>Activity</code> find it eventually. <code>Opinion</code> Maybe a hundred years from now.</p>\n<p><code>RhetoricDevice</code> For the record… I <code>Activity</code> didn&#39;t die on  Sol 6. <code>Opinion</code> Certainly <code>ManyHumans</code> the rest of the crew <code>Opinion</code> thought I did, and I can&#39;t <code>Activity</code> blame them. Maybe there&#39;ll be a day of <code>Activity</code> national mourning for  me, and <code>KnowledgeRepository</code> my Wikipedia page will say, <code>Quote</code> &quot;Mark Watney is the only human being to have died on Mars.&quot;</p>\n<h2>Global type inference</h2>\n<p><em>Where the compiler knows everything – often more than you.</em></p>\n<p>LOG ENTRY: SOL 6</p>\n<p>I&#39;m pretty much fucked.</p>\n<p>That&#39;s my considered opinion.</p>\n<p>Fucked.</p>\n<p>Six days into what should be the greatest month of my life, and it&#39;s turned into a nightmare.</p>\n<p>I don&#39;t even know who&#39;ll read this. I guess someone will find it eventually. Maybe a hundred years from now.</p>\n<p>For the record… I didn&#39;t die on Sol 6. Certainly the rest of the crew thought I did, and I can&#39;t blame them. Maybe there&#39;ll be a day of national mourning for me, and my Wikipedia page will say, &quot;Mark Watney is the only human being to have died on Mars.&quot;</p>\n<h2>My point?</h2>\n<p>People don&#39;t hate on old skool static typing because typing types is hard. They hate on it because it&#39;s annoying to read.</p>\n<p>The pendulum swung too far with untyped languages, and our code is nice to read but hard to understand. We&#39;re getting back on track with <a href=\"http://wiki.c2.com/?SufficientlySmartCompiler\">sufficiently smart compilers</a> and type inference.</p>\n<p>The future is bright.</p>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"cd4e426f-e4e7-5d47-bb55-e5b0a6f4fc4b"}}