{"data":{"wordpressPost":{"title":"I am a Groundbreaking Thinker &#8230;","content":"<p>&#8230; accord to a <a class=\"zem_slink\" title=\"Personality test\" rel=\"wikipedia\" href=\"http://en.wikipedia.org/wiki/Personality_test\">personality test</a> I just took. Wow, groundbreaking AND a thinker. I&#8217;ll take it even though the very first question I was given had me thinking for a while which option I should pick. The rest were simple dead on choices. <a class=\"zem_slink\" title=\"Woot\" rel=\"wikipedia\" href=\"http://en.wikipedia.org/wiki/Woot\">Woot</a>!</p>\n<p>But I&#8217;ll let <a href=\"http://www.ipersonic.com/type/GT.html\" target=\"_blank\">the test do the talking</a> savvy?</p>\n<p><em>Groundbreaking Thinkers are charming, enthusiastic persons. They really bubble over with <a class=\"zem_slink\" title=\"Energy\" rel=\"wikinvest\" href=\"http://www.wikinvest.com/industry/Energy\">energy</a> and like to take centre stage. They love variety both professionally and privately. Groundbreaking Thinkers tackle changes consistently with their optimism and firm belief in their own abilities; they are always on the look-out for improvement possibilities. Their excellent <a class=\"zem_slink\" title=\"Communication\" rel=\"wikipedia\" href=\"http://en.wikipedia.org/wiki/Communication\">communication skills</a> are of great advantage to them here. They approach the world with curiosity and openness and master new situations with a great deal of talent for improvising and with resourcefulness. Their spare time is taken up with a large number of hobbies; most Groundbreaking Thinkers like to travel in order to gather as many different impressions as possible. This personality type is unbeatable at discovering new possibilities.</p>\n<p>In their work, Groundbreaking Thinkers highly rate challenges and diversified tasks. They cannot stand routine and too detailed work. They love to astound others with bold ideas for an original, new project and then leave it up to the others to implement them. Hierarchies, rules and regulations arouse their opposition and they love outsmarting the system. It is vital to them that they enjoy their work; if this is the case, they quickly become pure workaholics. Their creativity best takes effect when they work independently; but they are very good at motivating others and infecting them with their optimistic nature. Conceptual or advisory activities appeal especially to Groundbreaking Thinkers. It can happen that some people feel somewhat duped by their flexible, spontaneous nature. Learn more about the Groundbreaking Thinker at work &#8230;</p>\n<p>Their sociability and enterprise ensure that Groundbreaking Thinkers always have a large circle of friends and acquaintances in which activity plays an important role. As they are mostly in a good mood, they are popular and very welcome guests. Grumbling and peevishness are unknown to them. However, they do tend to be a little erratic and unstable when it comes to obligations and this makes them appear to be unreliable to some. Groundbreaking Thinkers are very critical and demanding when it comes to picking a partner because they look for the ideal relationship and have a very concrete picture of this ideal relationship. Mutual aims in life are very important to them. They do not like compromising and would rather remain alone. For the partner, it is often a challenge to have a <a class=\"zem_slink\" title=\"Interpersonal relationship\" rel=\"wikipedia\" href=\"http://en.wikipedia.org/wiki/Interpersonal_relationship\">long-term relationship</a> with a Groundbreaking Thinker. Groundbreaking Thinkers need a lot of space and diversity or otherwise they become bored and feel cramped. Types who are rather more traditionalistic often have problems with the willingness of Groundbreaking Thinkers to take risks and their often crazy, spontaneous actions. However, if one can summon up sufficient flexibility and tolerance for them, one will never be bored in their presence and will always have a loyal and faithful partner. Learn more about the Groundbreaking Thinker in love &#8230;</em></p>\n<p>I&#8217;d be hard pressed to label this as good or bad, but I&#8217;m sure I get on a lot of people&#8217;s nerves.</p>\n<div class=\"zemanta-pixie\" style=\"margin-top: 10px; height: 15px;\"><a class=\"zemanta-pixie-a\" title=\"Reblog this post [with Zemanta]\" href=\"http://reblog.zemanta.com/zemified/94580d68-81c4-477b-a450-e1bb77ebd4ed/\"><img class=\"zemanta-pixie-img\" style=\"border: none; float: right;\" src=\"http://img.zemanta.com/reblog_e.png?x-id=94580d68-81c4-477b-a450-e1bb77ebd4ed\" alt=\"Reblog this post [with Zemanta]\" /></a><span class=\"zem-script more-related pretty-attribution\"><script src=\"http://static.zemanta.com/readside/loader.js\" type=\"text/javascript\"></script></span></div>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"05d47b4e-f8ee-5bdd-b231-446f79296162"}}