{"data":{"wordpressPost":{"title":"Death of Drnovšek","content":"<p>\n  Last week rumours were spread like wildfire over the blogosphere of the slovenian internets about Drnov&scaron;ek&#39;s death. They were untrue and, to be quite honest, rather audacious and a tad distasteful. Well as life would have it they were only untrue at the moment and it so happened that last night he passed away.\n</p>\n<p>\n  Hokus pokus and the media goes into turmoil and devotes a lot of time to talking about this event and how good a man Drnov&scaron;ek was and how much he&#39;s done for our politics and the general outlook of the country to the outside world. He was a good man, beyond doubt. And he looked like an alien, but we never held that against him.\n</p>\n<p>\n  What I personaly find awfully disgusting about this whole thing is how a mere few months ago everyone was taking punches at him for wasting money on visiting his shamans and about how he isn&#39;t being a good role model to the common folk by going for alternative medicine. Not to mention the way he personally went to handle the whole Strojan situation. Oh we just could not get over htat one, a president, fighting with mere gypsies.\n</p>\n<p>\n  Now that he&#39;s dead the situation has changed. He was the first president in the world to have the cohones for a formal visit with native americans, a brave man for showing his approval of alternative medicine despite his position and a very good guy for being able to lower to the level of common man to try and understand his problems and resolve a serious situation.\n</p>\n<p>\n  Oh get a grip people! You disgust me! Look, the man is dead, it doesn&#39;t matter whether you think poorly of him or not, whether you say it or not. What matters is that now he&#39;s dead and we should pay him the respect he needs to be paid.\n</p>\n<p>\n  Can&#39;t Drnov&scaron;ek have some peace and quiet even in death?</p>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"1c281970-06b3-5f96-aeca-6dc96d848641"}}