{"data":{"wordpressPost":{"title":"Perl will solve your bug!","content":"<p>\nYesterday upon coming to work I was greeted by an e-mail saying that <a href=\"http://detextive.net\" target=\"_blank\">Detextive</a>  is having issues when large files are uploaded. It instantly felt suspicious because it didn&#39;t <em>use</em> to have these problems. So off I go and try a 100k word file on for size and woe and behold, the upload hung. Not to be deterred I turned on debugging and tried again, this time the culprit reared its ugly head and said hello.\n</p>\n<p>\nThe file uploaded well, but where it failed was &#8230; counting the number of words there was. Strange huh? See the word counting &quot;algorithm&quot; kind of took more than 30 seconds to execute on such a monstrous text and so a timeout occured. I could&#39;ve gone the usual solution, shoved it into an asynchronous process and simply wait it out, but it didn&#39;t feel right. I shouldn&#39;t <em>have to</em> do something like that just to bloody count how many words there were in a file. And there wasn&#39;t anything I could do with the algorithm to speed it up since regex function calls where hanging not the algorithm itself.\n</p>\n<p>\nSo I turned to python, python is cool right? It&#39;s bloody fast, has awesome string support and is overall very easy to program, especially since I already have some experience with it. But what&#39;s this? It doesn&#39;t support unicode character properties in regexes? WHAT? What the hell &#8230; onward!\n</p>\n<p>\nAfter some shuffling around and trying to figure out what to do I decided, what the hell, let&#39;s try perl. And that&#39;s exactly what I did, I learned perl from scratch just to solve a bug, crazy. Next thing you know I&#39;m finding perl quite easy to code even though it&#39;s just about the same age I am and what&#39;s more, it counted the words and such not in a few seconds less, but in a bloody <strong>second!</strong> In light of this new discovery of perl&#39;s quickness I decided to put some other things into perl, for example in a later step I found out php&#39;s regexes and such take seven minutes to turn text into an array of words (for a 100k word file) and that&#39;s just not acceptable.\n</p>\n<p>\nIn other news, <a href=\"http://kde-look.org/content/show.php/Tea+Cooker?content=85564\" target=\"_blank\">Tea Cooker</a>  has been downloaded over 120 times and yesterday reached a stage where it is in fact very useful.</p>\n"},"site":{"siteMetadata":{"title":"Swizec Blog","subtitle":"Fetch Data From Local WP Install"}}},"pageContext":{"id":"e45aee4b-b4a9-5667-91bd-384d7224d84d"}}